{
  "_url": "https://github.com/PowerShell/PowerShell/issues/10058",
  "author": "KirkMunro",
  "body": "Are parameter set names considered contractual, and therefore changing a parameter set name is considered breaking, or can they be changed as required (i.e. when moving parameters into a new base class as part of a refactoring effort performed while fixing some issues in a set of commands that share those parameters)?\r\n\r\nThe [breaking change documentation](https://github.com/PowerShell/PowerShell/blob/master/docs/dev-process/breaking-change-contract.md) does not mention parameter sets at all, and therefore I would think parameter set names are not contractual, but thought I should check first to make sure.\r\n\r\ncc: @SteveL-MSFT ",
  "closed_at": "2019-07-25T19:34:50Z",
  "comments": [
    {
      "author": "BrucePay",
      "author_association": "COLLABORATOR",
      "body": "@KirkMunro Thanks for bringing this up. We decided way back in V1 that changing the name of a parameter set would officially not be considered a breaking change.  But of course it's a publicly visible property so i'm sure people have taken dependencies on them. At this point, the Committee should probably review this decision/guidance and update it if necessary.",
      "created_at": "2019-07-03T20:25:03Z",
      "updated_at": "2019-07-03T20:25:03Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "I would not want it to be a breaking change because we have already discussed that parameter binding should be enhanced to support more features (like PSMore idea and more flexible parameter set description notation).\r\nIt also seems that the addition of any new parameter may cause a redefinition of parameter sets in any cmdlet.",
      "created_at": "2019-07-04T15:47:29Z",
      "updated_at": "2019-07-04T15:49:04Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "@PowerShell/powershell-committee reviewed this.  We reaffirm that ParameterSet names are not a public api and changing them is not a breaking change.  We should update the breaking change contract doc to make this apparent and explicit.",
      "created_at": "2019-07-10T22:36:16Z",
      "updated_at": "2019-07-10T22:38:03Z"
    }
  ],
  "created_at": "2019-07-03T19:14:02Z",
  "number": 10058,
  "state": "closed",
  "title": "Is changing the name of a parameter set considered breaking?",
  "updated_at": "2019-07-26T03:02:50Z"
}