{
  "_url": "https://github.com/PowerShell/PowerShell/issues/10142",
  "author": "lukepuplett",
  "body": "# Summary of the new feature/enhancement\r\n\r\nAs a C# dev and occasional PS user I want the tab completion to recognise and cycle the options for shorthand CmdLet names like `New-AzResGroDep` so that I don't have to type so much before the tab completion suggestions are a usefully short list.\r\n\r\nIn Visual Studio the suggestions work in this way, so entering `this.LogFac` would suggest `this.LoggerFactory`. This is convenient and now natural to a bunch of developers.\r\n\r\n`New-AzResGroDep` would suggest `New-AzResourceGroupDeployment`\r\n\r\nThanks\r\n\r\n# Proposed technical implementation details (optional)\r\n\r\nI've no clue how to do this. I feel bad now.\r\n",
  "closed_at": null,
  "comments": [
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "Wasn't something like this already implemented, @SteveL-MSFT?\r\n\r\nI remember hearing about something that would expand tab completions by looking for acronyms or initialisms, did that ever make it in?",
      "created_at": "2019-07-12T16:37:53Z",
      "updated_at": "2019-07-12T16:37:53Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "@vexx32 yes, PS6.2 has abbreviation expansion which will be non-experimental in PS7 preview2.  Basically, in @lukepuplett's example, `n-argp` would expand to `New-AzResourceGroupDeployment`.  It specifically works against the upper case letters so doesn't fuzzy match additional characters.  What @lukepuplett is suggesting is a bit different and more of an expanded version of the abbreviation expansion",
      "created_at": "2019-07-12T20:00:50Z",
      "updated_at": "2019-07-12T20:00:50Z"
    },
    {
      "author": "lukepuplett",
      "author_association": "NONE",
      "body": "Okay thanks folks, good news. My suggested behaviour was proposed simply because I'm used to Visual Studio's.\r\n\r\nI must point out that the problems for me - and I'm assuming other people, too - are\r\n\r\n1. Typing long commands.\r\n1. Remembering the name of all the commands.\r\n\r\nBeing able to enter some of the tokens I do remember and tab-cycling them would help.\r\n\r\nMatching on the initials would solve 1 but doesn't sound like it would help at all with 2.",
      "created_at": "2019-07-16T18:51:31Z",
      "updated_at": "2019-07-16T18:54:12Z"
    }
  ],
  "created_at": "2019-07-12T16:23:05Z",
  "number": 10142,
  "state": "open",
  "title": "Tab completion matches first parts of words in CmdLet names",
  "updated_at": "2019-07-24T18:52:27Z"
}