{
  "_url": "https://github.com/PowerShell/PowerShell/issues/10162",
  "author": "TylerLeonhardt",
  "body": "# Summary of the new feature/enhancement\r\n\r\nThis is opened in response to negativity around experimental features and only having opt-in functionality.\r\n\r\nAs the title says, this tracks the idea of having all experimental features turned on in the Preview version of PowerShell to provide experimental feature authors the ability to get feedback on newly added experimental features.\r\n\r\nThere may be exceptions to this rule on experimental features that are drastic but It’s the role of a maintainer of PowerShell/PowerShell committee to decide this.\r\n\r\n# Proposed technical implementation details (optional)\r\n\r\nFor preview builds - experimental features are all on\r\nFor stable builds - experimental features are all off\r\n\r\ncc @SteveL-MSFT @joeyaiello ",
  "closed_at": "2019-08-08T18:37:26Z",
  "comments": [
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "That certainly seems like it would be a more productive use of experimental features and preview releases. I like it!",
      "created_at": "2019-07-15T18:13:34Z",
      "updated_at": "2019-07-15T18:13:34Z"
    },
    {
      "author": "KirkMunro",
      "author_association": "CONTRIBUTOR",
      "body": "In order to help gather input, it may be useful to show some information about experimental features on startup in preview builds. Having them on by default with no UX describing them doesn't help with gathering feedback about them since they risk appearing just like new features that are not experimental to end users.",
      "created_at": "2019-07-16T03:08:43Z",
      "updated_at": "2019-07-16T03:08:43Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": ">  it may be useful to show some information about experimental features on startup in preview builds.\r\n\r\nI agree that we could start with this before enabling experimental features by default.",
      "created_at": "2019-07-16T06:05:15Z",
      "updated_at": "2019-07-16T06:05:15Z"
    },
    {
      "author": "TylerLeonhardt",
      "author_association": "MEMBER",
      "body": "> it may be useful to show some information about experimental features on startup in preview builds\r\n\r\nThis will involve changes to ConsoleHost. As such we should be aware that other hosts will not get this feature - aka PowerShell Editor Services. ",
      "created_at": "2019-07-16T14:49:28Z",
      "updated_at": "2019-07-16T14:49:28Z"
    },
    {
      "author": "KirkMunro",
      "author_association": "CONTRIBUTOR",
      "body": "> This will involve changes to ConsoleHost. As such we should be aware that other hosts will not get this feature - aka PowerShell Editor Services.\r\n\r\nIt wouldn't necessarily have to be implemented as messages sent directly to the host. I haven't dug into how PSES works, but what other options does it provide for conveying information about experimental features that the PS Team wants feedback on as part of the review process of a preview release?",
      "created_at": "2019-07-16T15:12:04Z",
      "updated_at": "2019-07-16T15:12:04Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "For testing we enable experimental features one by one and run specific tests. Why is it not way for other (MSFT) projects? Also we have a cmdlet to enumerate experimental features so any project can monitor them.",
      "created_at": "2019-07-17T03:06:26Z",
      "updated_at": "2019-07-17T03:06:26Z"
    },
    {
      "author": "TylerLeonhardt",
      "author_association": "MEMBER",
      "body": "> It wouldn't necessarily have to be implemented as messages sent directly to the host.\r\n\r\nDo you have an alternative?\r\n\r\n> I haven't dug into how PSES works, but what other options does it provide for conveying information about experimental features that the PS Team wants feedback on as part of the review process of a preview release?\r\n\r\nWithout doing any work in PSES? - Write-* cmdlets and Console API\r\nWith doing minimal work in PSES? - Sending a message to VSCode that sends a “toast” within vscode",
      "created_at": "2019-07-17T18:49:36Z",
      "updated_at": "2019-07-17T18:49:36Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "I like the toast idea, but I think having a host-independent implementation would be best. 🤔 \r\n\r\nI know a fair few users who work with ConEmu, etc.",
      "created_at": "2019-07-17T19:07:54Z",
      "updated_at": "2019-07-17T19:08:04Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "@PowerShell/powershell-committee reviewed this, we agree with turning on experimental features by default in preview releases, but PS-Committee needs to decide which ones become non-experimental for RC and any features staying experimental will be disabled by default in RC.  Implementation should be to ship a config.json with the Preview.",
      "created_at": "2019-07-24T22:48:22Z",
      "updated_at": "2019-07-24T22:48:22Z"
    },
    {
      "author": "msftbot[bot]",
      "author_association": "NONE",
      "body": ":tada:This issue was addressed in #10228, which has now been successfully released as `v7.0.0-preview.3`.:tada:\n\nHandy links:\n* [Release Notes](https://github.com/PowerShell/PowerShell/releases/tag/v7.0.0-preview.3)\n",
      "created_at": "2019-08-20T22:36:53Z",
      "updated_at": "2019-08-20T22:36:53Z"
    }
  ],
  "created_at": "2019-07-15T17:43:24Z",
  "number": 10162,
  "state": "closed",
  "title": "Enable all experimental features in the preview version of PowerShell",
  "updated_at": "2019-08-20T22:36:53Z"
}