{
  "_url": "https://github.com/PowerShell/PowerShell/issues/10165",
  "author": "KirkMunro",
  "body": "# Steps to reproduce\r\n\r\n```powershell\r\n# Create a variable name that is nothing but spaces:\r\n${ } = 'boo'\r\n${ }\r\n\r\n# Create a variable name that contains leading or trailing whitespace:\r\n${   foo   } = 'bar'\r\n$foo # Not found\r\nGet-Variable -Name '   foo   ' -ValueOnly\r\n\r\n# Create a function whose name contains leading whitespace (trailing whitespace is silently stripped)\r\nNew-Item 'function: foo ' -Value {'Whitespace only'}\r\n& ' foo ' # Not found\r\n& ' foo' # This works (the trailing whitespace was ignored during creation of the function)\r\n\r\n# Create an alias whose name is nothing but whitespace\r\nNew-Alias -Name ' ' -Value Get-Date\r\n& ' ' # Shows the date\r\n\r\n# Set a breakpoint on a command that is just whitespace\r\nSet-PSBreakpoint -Command ' '\r\n\r\n# Try to trigger a breakpoint on that command\r\n& ' ' # Does not work\r\n\r\n# Set a breakpoint on a variable that is just whitespace\r\nSet-PSBreakpoint -Variable ' ' -Mode ReadWrite\r\n\r\n# Try to trigger a breakpoint on a variable whose name is nothing but whitespace\r\n${ } # triggers breakpoint\r\n\r\n# Create a filename in the current location that has leading and trailing whitespace in its name\r\nNew-Item ' huh.txt ' -Value 'Explorer does not allow such names to be created'\r\n\r\n# Open the file in notepad\r\nnotepad ' huh.txt ' # works\r\nnotepad ' huh.txt' # also works even though the trailing whitespace was dropped\r\nnotepad 'huh.txt' # does not work; prompts to create a new file\r\n```\r\n\r\n# Expected behavior\r\n\r\n1. Command and variable names should either be trimmed so that they contain no extraneous whitespace, or they should raise an error if they contain extraneous whitespace so that there is no ambiguity on the part of the person creating the command or variable.\r\n\r\n1. Set-PSBreakpoint should trim whitespace from string parameters.\r\n\r\n# Actual behavior\r\n\r\nAs indicated in the comments above.\r\n\r\n# How we might fix this\r\n\r\n## Define an AutoTrim attribute\r\n\r\nThis attribute would automatically trim string values before they are validated against validation attributes. That corrects the contents for commands, which is helpful; however, it means users can pass in values and get results that are different than those values (i.e. create an alias with leading/trailing whitespace and end up with alias that doesn't have the whitespace). This could hide bugs that exist in calling code.\r\n\r\n## Define a ValidateNoExtraneousWhitespace attribute\r\n\r\nThis attribute would result in an error in the parameter binder if a parameter of type `string` or a parameter that is a collection of type `string` contained strings that included leading or trailing whitespace, forcing the caller to deal with the problem. This is my preferred partial solution to this issue.\r\n\r\n# Questions\r\n\r\nIs there anything we can/should do about provider paths with leading/trailing whitespace? For PowerShell entities such as functions/aliases/variables, we can obviously generate errors if leading/trailing whitespace is used, but since files exist outside of PowerShell and can be created with spaces in Windows (not sure about macOS/Linux, haven't tested there), we probably can't provide a generic solution that prevents use of paths with extraneous whitespace.\r\n\r\n# Environment data\r\n\r\n```none\r\nName                           Value\r\n----                           -----\r\nPSVersion                      6.2.1\r\nPSEdition                      Core\r\nGitCommitId                    6.2.1\r\nOS                             Microsoft Windows 10.0.17763\r\nPlatform                       Win32NT\r\nPSCompatibleVersions           {1.0, 2.0, 3.0, 4.0…}\r\nPSRemotingProtocolVersion      2.3\r\nSerializationVersion           1.1.0.1\r\nWSManStackVersion              3.0\r\n```\r\n",
  "closed_at": "2019-07-31T22:46:59Z",
  "comments": [
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "> Is there anything we can/should do about provider paths with leading/trailing whitespace? \r\n\r\nFor FileSystem provider. Trailing whitespaces is removed. Leading whitespaces is meaningful.",
      "created_at": "2019-07-16T04:12:33Z",
      "updated_at": "2019-07-16T04:12:33Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "/cc @mklement0 For information.",
      "created_at": "2019-07-16T04:13:34Z",
      "updated_at": "2019-07-16T04:13:34Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "/cc @SteveL-MSFT \r\nFor PowerShell Committee review.\r\nFrom the issue and #10148, #10157\r\n\r\nHow we should resolve names (variables, aliases, functions/cmdlets) with whitespace characters (space, tab)?\r\n- at start like \"   abc\"\r\n- at end like \"abc   \"\r\n- with whitespace only like \"   \"\r\n\r\nSuggestions is\r\n- to disable with ArgumentException at creation time and CommandNotFoundException\r\n/VariableNotFoundException/AliasNotFoundException at getting time.\r\n- to trim silently.\r\n",
      "created_at": "2019-07-23T04:01:08Z",
      "updated_at": "2019-07-23T04:04:16Z"
    },
    {
      "author": "JamesWTruher",
      "author_association": "MEMBER",
      "body": "Why are we considering that we own the mandate for how people consider naming their variables. I really don't think there's a problem here. If *you* don't like this, then don't use it, but please don't try to tell me what I can name my variables.",
      "created_at": "2019-07-24T20:34:57Z",
      "updated_at": "2019-07-24T20:34:57Z"
    },
    {
      "author": "KirkMunro",
      "author_association": "CONTRIBUTOR",
      "body": "@JamesWTruher The problem is that bugs and unexpected behavior shows up from these types of edge cases. It isn't about telling you what you can/cannot use for variable/function/alias names. It is about ensuring there is some expectation of order though, so that you don't run into obscure bugs or unexpected behavior that show up when you use names that are not expected. Such \"restrictions\" would help the scripter, not just in their use of PowerShell, but in being a scripter/developer in general.\r\n\r\nOn the flip side, if we don't do this, do we have tests in place for such things (variable/function/alias names that are whitespace only or that start and/or end with whitespace), so that the scripter can reasonably expect them to work just fine? I'd wager that we don't, and I think it would be better to guide PowerShell scripter here in the right direction than to spend time testing/fixing the engine so that it properly supports such things throughout the language.\r\n\r\nA few well-intentioned limits here would be a good thing in my book.",
      "created_at": "2019-07-24T21:59:33Z",
      "updated_at": "2019-07-24T21:59:33Z"
    },
    {
      "author": "KirkMunro",
      "author_association": "CONTRIBUTOR",
      "body": "Here's another example that came up in an email list today, where appropriate boundaries are not in place and what may appear as strange bugs show up as a result:\r\n\r\n```powershell\r\n# You can define a function with a parameter name that is numeric.\r\n# This should not be allowed.\r\nfunction Test-ParameterName {\r\n    [CmdletBinding()]\r\n    param([Switch]$7)\r\n    # The body doesn't matter\r\n}\r\n\r\n# You can define a function with a parameter alias that is numeric.\r\nfunction Test-ParameterAlias {\r\n    [CmdletBinding()]\r\n    param([Alias('7')][Switch]$NumericAliasTest)\r\n    # The body doesn't matter\r\n}\r\n\r\n# You can't invoke either of these function with a parameter name or\r\n# alias that is numeric.\r\n# Strange bugs show up when you don't put appropriate boundaries\r\n# in place around command/variable/etc. names\r\nTest-ParameterName -7 # Returns an error\r\nTest-ParameterAlias -7 # Returns an error\r\n```\r\n\r\nIn this case, we should have rules for parameter names and parameter aliases. For example, if they start with a number, they must contain at least one alphabetic character. But even then, there are other considerations that need to be taken into account, like this one:\r\n\r\n```powershell\r\nfunction Test-ParameterName {\r\n    [CmdletBinding()]\r\n    param([Switch]$10mb)\r\n    # The body doesn't matter\r\n}\r\n\r\n# You can't invoke this with the parameter either because the name is\r\n# still numeric, even though it contains alphabetic characters.\r\nTest-ParameterName -10mb # Returns an error\r\n```\r\n\r\nI think we should support parameter names that are numeric, so that a command could have a parameter name such as `-32bit`, for example, but more consideration should be given to the many different types of numeric constants that can be used that contain alphabetic characters (e.g. `-1gb`, `-1d`, `-1e10`, `-0xabcd`, etc). In the case where a parameter name or a parameter alias starts with one or more numbers, maybe the parser should prevent any scenarios that represent static numbers. They aren't likely to come up as desirable parameter names anyway, perhaps with the exception of `-0xbadf00d`...😛\r\n",
      "created_at": "2019-07-25T22:14:02Z",
      "updated_at": "2019-07-25T22:23:02Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "@PowerShell/powershell-committee reviewed this, we don't see the value to spend time addressing this as this has been existing behavior forever and hasn't been an issue.  Filenames allow whitespace and this follows that convention.  Users can choose to use this if they choose and we shouldn't break them.",
      "created_at": "2019-07-31T22:46:59Z",
      "updated_at": "2019-07-31T22:46:59Z"
    },
    {
      "author": "msftrncs",
      "author_association": "CONTRIBUTOR",
      "body": "@KirkMunro, you can use parameters that start like `-32bit`, just not via the `-` designator, they instead require using hashes and the splat operator, or using an invoke object with parameter hash and with a new method coming soon with `@@{'32bit'=$true}`.",
      "created_at": "2019-07-31T23:52:49Z",
      "updated_at": "2019-07-31T23:52:49Z"
    }
  ],
  "created_at": "2019-07-15T18:33:29Z",
  "labels": [
    "Issue-Question",
    "WG-Language",
    "Resolution-Answered",
    "Breaking-Change",
    "Committee-Reviewed"
  ],
  "number": 10165,
  "state": "closed",
  "title": "These should probably not be possible",
  "updated_at": "2019-07-31T23:52:49Z"
}