{
  "_url": "https://github.com/PowerShell/PowerShell/issues/10182",
  "author": "zbalkan",
  "body": "# Summary of the new feature/enhancement\r\n\r\nAfter a few years of PowerShell usage, the environment has been polluted. So many installed & uninstalled modules, console settings, C# included tricks have come and passed. I tried to do a factory reset, removed the config.json files, registry settings, uninstalled some modules. Still, there are some leftovers. A module to reset, backup and restore PowerShell environment in the default modules would be helpful. \r\n\r\n# Proposed technical implementation details (optional)\r\n\r\n`Reset-PowershellEnvironment`: Removes all installed modules, cleans profiles, removes Registry settings. By default, it prompts for arguments.\r\n`-Console`: When the switch is defined, only the console settings are removed.\r\n\r\n`-Profile`: When the switch is defined, only the profiles are removed.\r\n\r\n`-Modules`: When the switch is defined, only the modules installed afterward are uninstalled.\r\n\r\n`Backup-PowershellEnvironment`: Backs up the environment settings to an XML or CliXml file.\r\n`Restore-PowershellEnvironment`: Restores the environment  settings from an XML or CliXml file",
  "closed_at": null,
  "comments": [
    {
      "author": "jdhitsolutions",
      "author_association": "COLLABORATOR",
      "body": "This sounds like a project for the community.  Or something that module authors should include. If you install a module that creates a set of registry keys, Microsoft would have no way knowing that or deleting them. The module author should include an uninstall command or provide documentation on what else you might need to do.  Who gets to define at the \"PowerShell Environment\" consists of? Your environment may be different than mine. Yes, I know there are parameter suggestions, but again, I think these are things the community could provide.\r\n",
      "created_at": "2021-06-14T20:10:30Z",
      "updated_at": "2021-06-14T20:10:30Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "I agree that this is not something that can be done reliably and predictably. There is a high risk of destroying the system altogether. This should be rejected.",
      "created_at": "2021-06-15T04:34:13Z",
      "updated_at": "2021-06-15T04:34:13Z"
    }
  ],
  "created_at": "2019-07-19T06:34:33Z",
  "labels": [
    "Issue-Enhancement",
    "WG-Cmdlets"
  ],
  "number": 10182,
  "state": "open",
  "title": "Reset-PowershellEnvironment",
  "updated_at": "2021-06-15T04:34:13Z"
}