{
  "_url": "https://github.com/PowerShell/PowerShell/issues/10183",
  "author": "mrhockeymonkey",
  "body": "In the latest release of powershell 7 preview 2 one of the features listed is support for compiling mofs on linux (#9834). I took this to mean that I could use a linux box to compile mofs that will later be applied to windows machines...\r\n\r\nI spent the best part of today trying to achieve just that but sadly with little success. I am using CentOS 7.6 and have installed [omi](https://github.com/microsoft/omi/releases) and [dsc-for-linx](https://github.com/microsoft/PowerShell-DSC-for-Linux/releases) but after having done so Get-DscResource does not return any resources\r\n\r\nI also tried running a configuration in case it was just a bug with the output but I get the below (CertificateDSC was just one of many stabs in the dark):\r\n```powershell\r\nAt line:6 char:9\r\n+         CertificateImport MyTrustedRoot\r\n+         ~~~~~~~~~~~~~~~~~\r\nUndefined DSC resource 'CertificateImport'. Use Import-DSCResource to import the resource.\r\n+ CategoryInfo          : ParserError: (:) [], ParentContainsErrorRecordException\r\n+ FullyQualifiedErrorId : ResourceNotDefined\r\n```\r\n\r\nI know this is a work in progress but will this eventually be a possibility? If so are there any issues/milestones to watch progress towards this goal? Or is it that only the linux specific \"nx\" resources will ever be available on a linux host?\r\n\r\n\r\n\r\n\r\n\r\n",
  "closed_at": "2020-01-22T12:28:59Z",
  "comments": [
    {
      "author": "mrhockeymonkey",
      "author_association": "NONE",
      "body": "Would anyone be able to shed some light on this? I thought i'd come back and try again now that preview 6 is released and no more features will be added. This time I tried Ubuntu Xenial, installed omi, dsc and pwsh-preview but I get the same issue. No DSC Resources are found. \r\n\r\nThese are the docs for reference: https://docs.microsoft.com/en-us/powershell/scripting/dsc/getting-started/lnxgettingstarted?view=powershell-6\r\n\r\nEDIT:\r\n\r\nAfter a bit more playing around with a custom resource to see if I can get it working I encountered the below warning. This was emitted when i tried to compile a configuration using my own resource. The resource doesn't show up in Get-DscResource but i thought why not try anyway...\r\n\r\n```bash\r\nWARNING: Embedded resources are not support on Linux or macOS.  Please see https://aka.ms/PSCoreDSC for more details\r\n```\r\nThe link is broken it seems so I'm still not sure if what I'm trying to do is supported or not? this suggests not whilst #9834 suggests it is...\r\n\r\n\r\n\r\n\r\n\r\n<blockquote><div><strong><a href=\"https://docs.microsoft.com/en-us/powershell/scripting/dsc/getting-started/lnxgettingstarted\">Get started with Desired State Configuration (DSC) for Linux - PowerShell</a></strong></div></blockquote>",
      "created_at": "2019-11-26T16:40:28Z",
      "updated_at": "2019-11-26T17:26:34Z"
    },
    {
      "author": "mrhockeymonkey",
      "author_association": "NONE",
      "body": "It looks like this was fixed in 7.0.0-rc.2. Compiling mofs now works fine. Sadly compiling with credentials doesn't work but i've opened #11656 as it is a separate issue and I will close this one. ",
      "created_at": "2020-01-22T12:28:59Z",
      "updated_at": "2020-01-22T12:28:59Z"
    }
  ],
  "created_at": "2019-07-19T16:02:18Z",
  "labels": [
    "Issue-Question",
    "Area-DSC"
  ],
  "number": 10183,
  "state": "closed",
  "title": "Compiling mofs on linux",
  "updated_at": "2020-01-22T12:28:59Z"
}