{
  "_url": "https://github.com/PowerShell/PowerShell/issues/10258",
  "author": "whitequill",
  "body": "# Summary of the new feature/enhancement\r\n\r\n\r\nI feel that he icon in Powershell 7 is not balanced and with a very neon pink and a very soft blue. I have a proposed icon that had slightly different colors as I saw in the Powershell 7 assets Powershell_avatar and I thought it still needed to look flashy.\r\n\r\n# Proposed technical implementation details (optional)\r\n\r\nHere is my proposed icon that I feel has more balanced colors over the purple and pink.\r\n[pwsh_32513.zip](https://github.com/PowerShell/PowerShell/files/3445231/pwsh_32513.zip)\r\n\r\nI would love to hear feedback on it and if anyone feels like my proposed colors aren't fitting. \r\nI did take a color theory class in college.\r\n",
  "closed_at": "2019-07-31T21:07:45Z",
  "comments": [
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "@whitequill Please follow issue pattern and add more info in the issue description.",
      "created_at": "2019-07-30T05:59:45Z",
      "updated_at": "2019-07-30T05:59:45Z"
    },
    {
      "author": "whitequill",
      "author_association": "NONE",
      "body": "I'm sorry I thought I had typed it.\r\nThis issue is simply that the present icon for Powershell looks like it has a magenta transparent color color from gifs that is being shown and I think that the pink clashes with the blue a lot!\r\n\r\nI am proposing a different color scheme. I noticed the\r\n[pwsh_32513.zip](https://github.com/PowerShell/PowerShell/files/3449856/pwsh_32513.zip)\r\nI picked the color triad of orange hex(ec7a00), red-orange hex(b01e00), and the current blue hex(00a3c9). the current analogical purple hex(461466), pink hex(ec008c) and the same blue, feel like they are vibrating and uncomfortable to the eyes.\r\n\r\nI didn't do a re-theme of the Powershell avatar but, it looks like its just a de-saturation of the current colors and I understand that the whole theme is suppose to sell this avatar from it being in the assets folder.",
      "created_at": "2019-07-31T05:04:51Z",
      "updated_at": "2019-07-31T05:32:46Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "/cc @SteveL-MSFT for conclusion. ",
      "created_at": "2019-07-31T06:05:33Z",
      "updated_at": "2019-07-31T06:05:33Z"
    },
    {
      "author": "msftrncs",
      "author_association": "CONTRIBUTOR",
      "body": "@whitequill, you can go back and edit your original post.   You probably posted you information over the comment marks, and so your text is commented out.  You can then edit it and make the original post your proposal.",
      "created_at": "2019-07-31T06:05:49Z",
      "updated_at": "2019-07-31T06:05:49Z"
    },
    {
      "author": "whitequill",
      "author_association": "NONE",
      "body": "@msftrncs sorry I didn't see notice the comment block at the time.",
      "created_at": "2019-07-31T11:34:39Z",
      "updated_at": "2019-07-31T11:34:39Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "@whitequill I believe the coloring of the icon is intended to match the coloring of the original character design for the \"PowerShell Hero\" (some of the art can be found [here](https://docs.microsoft.com/en-us/powershell/digital-art) and the branding you can see in the install process as well.\r\n\r\nIt's also worth noting that the current colour of the icon is only used for preview versions, and only to help distinguish it from the (usually fairly plain) black icon that is used for GA releases like the ones you can see on 6.0.x, 6.1.x, and 6.2.x. 🙂 ",
      "created_at": "2019-07-31T12:33:04Z",
      "updated_at": "2019-07-31T12:33:04Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "@vexx32 is exactly right.  The official stable icon is the simple black one.  Only the Preview releases get the avatar themed one.\r\n\r\n@whitequill your version actually looks pretty good, but not sure what we'd use it for since we already have branded icons to differentiate stable and preview releases.",
      "created_at": "2019-07-31T21:07:45Z",
      "updated_at": "2019-07-31T21:07:45Z"
    }
  ],
  "created_at": "2019-07-30T05:01:32Z",
  "number": 10258,
  "state": "closed",
  "title": "redone powershell icon over purple pink and blue",
  "updated_at": "2019-07-31T21:07:51Z"
}