{
  "_url": "https://github.com/PowerShell/PowerShell/issues/10348",
  "author": "msftrncs",
  "body": "While trying to understand why PSReadLine highlights operator tokens in command mode as operators (though they are not in that context) , I determined that the parser/tokenizer (Tokens Class) has a method that specifically resets the TokenKind of a token, to 'Generic'.  However it fails to remove the flags originally set from the original TokenKind.  This most commonly occurs to the operators, which in command mode, are not operators and instead are treated as unquoted arguments.  PSReadLine uses the TokenFlags UnaryOperator, BinaryOperator and AssignmentOperator to highlight operators, and so that is what it sees\r\n\r\n# Steps to reproduce\r\n\r\n```powershell\r\necho 1 + 2 + 3 (1 + 2 + 3)\r\n#      ^   ^ not operators\r\n#                 ^   ^ operators!\r\n```\r\n",
  "closed_at": null,
  "comments": [
    {
      "author": "lzybkr",
      "author_association": "MEMBER",
      "body": "I removed the `Area-PSReadLine` tag. The issue can only be worked around in PSReadLine, a proper fix in the PowerShell parser might help other tools as well.",
      "created_at": "2019-08-21T12:28:50Z",
      "updated_at": "2019-08-21T12:29:02Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "Is there any behaviour that depends on the retention of the original TokenFlags values? It seems odd not to reset the flags when changing the TokenKind. 🤔 \r\n\r\nIf not, it doesn't seem like a particularly complex fix.",
      "created_at": "2019-08-21T12:35:00Z",
      "updated_at": "2019-08-21T12:35:00Z"
    },
    {
      "author": "lzybkr",
      "author_association": "MEMBER",
      "body": "Clearing the \"operator\" token flags when changing the token kind to `Generic` feels safe to me.",
      "created_at": "2019-08-21T13:40:31Z",
      "updated_at": "2019-08-21T13:40:31Z"
    }
  ],
  "created_at": "2019-08-13T04:20:41Z",
  "labels": [
    "Issue-Question",
    "WG-Engine"
  ],
  "number": 10348,
  "state": "open",
  "title": "Operators tokens remain flagged as operators after TokenKind is changed to Generic in Command Mode",
  "updated_at": "2019-08-21T13:40:31Z"
}