{
  "_url": "https://github.com/PowerShell/PowerShell/issues/10426",
  "author": "mklement0",
  "body": "# Steps to reproduce\r\n\r\n```powershell\r\n# OK: convert via cast (assigns $true)\r\n$b = [bool] [pscustomobject]::new()\r\n\r\n# !! BROKEN: convert via type constraint\r\n[bool] $b = [pscustomobject]::new()\r\n```\r\n\r\n# Expected behavior\r\n\r\nNo output. Both assignments should succeed.\r\n\r\n# Actual behavior\r\n\r\nThe 2nd statement causes the following error:\r\n\r\n```none\r\nCannot convert value \"System.Management.Automation.PSCustomObject\" to type \"System.Boolean\". \r\nBoolean parameters accept only Boolean values and numbers, such as $True, $False, 1 or 0\r\n```\r\n\r\n# Environment data\r\n\r\n```none\r\nPowerShell Core 7.0.0-preview.3\r\n```\r\n",
  "closed_at": null,
  "comments": [
    {
      "author": "BrucePay",
      "author_association": "COLLABORATOR",
      "body": "@mklement0 What's happening is that the second example is using parameter binder logic. For parameters that are constrained to boolean we have special logic that restricts the allowed values that can be assigned to boolean to be `true`, `false`, 0 and 1. For example, you'll get the same error if you try to assign a string to the constrained variable. Historically, this behaviour was implemented as a result of usability feedback from the Exchange team. People kept trying to type `\"true\"` and `\"false\"` and getting an unexpected result. Anyway, given that the behaviour is consistent between parameter variables and non-parameter variables I don't really think there's an issue here.",
      "created_at": "2019-08-27T20:31:29Z",
      "updated_at": "2019-08-27T20:31:29Z"
    },
    {
      "author": "mklement0",
      "author_association": "CONTRIBUTOR",
      "body": "@BrucePay: Thanks for explaining the background, but I do think there is a _usability_ issue here:\r\n\r\nUsers shouldn't have to think about _parameters_ in this context, and shouldn't have to worry about constraints that come with that, given that they're operating in _expression_ mode and thinking about _variables_, especially since in all other cases `[<type>] $foo = ...` and `$foo = [<type>] ...` result in the same value value getting assigned to `$foo`.\r\n(And if there are other cases where this equivalence doesn't hold, they should be addressed too.)\r\n\r\nThat something is amiss is indicated by the fact that the error message mentions a _parameter_: `Boolean parameters accept only`, which is obviously confusing in the context of assigning a _variable_.\r\n\r\nFrom a user's perspective, this coupling is an _implementation detail_, and the _internal_ consistency is not helpful. \r\n\r\nNote that the coupling is _not_ documented in the only place that I'm aware of that (far too lightly) touches on casts, [`about_Variables`](https://docs.microsoft.com/en-us/powershell/module/microsoft.powershell.core/about/about_variables?view=powershell-6#types-of-variables).\r\n\r\nAs an aside: There's also no mention there of the little-known fact that - as a _useful_ case of sharing functionality with parameters - you can not only _type_-, but also _validation_-constrain your variables:\r\n\r\n```powershell\r\n[ValidateNotNullorEmpty()] [string] $foo = ''  # fails\r\n```\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
      "created_at": "2019-08-27T21:18:15Z",
      "updated_at": "2019-08-27T21:18:15Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "Given that this also doesn't happen with any other type, I think it makes sense to remove this special case. See #13651 for a related issue that arises because of this special casing.\r\n\r\n/cc @SteveL-MSFT @rjmholt can we get y'all's thoughts on this one?",
      "created_at": "2020-09-17T23:32:49Z",
      "updated_at": "2020-09-17T23:32:49Z"
    },
    {
      "author": "rjmholt",
      "author_association": "COLLABORATOR",
      "body": "I think the big considerations for me are:\r\n\r\n- Can we make this change in attributed assignment without making it in parameter binding? (where I think the failure is valid UX, and more importantly is established behaviour)\r\n- If so, does that make PowerShell more complicated by once again introducing a slight variation of concepts or logic?\r\n\r\nI suspect that most users don't think of constrained assignment as a form of parameter binding, so muddying the concept might not have dire consequences. But even if so, I suspect decoupling the two pieces of logic while still getting things like validation attributes to work properly will be a large task.",
      "created_at": "2020-09-28T13:37:01Z",
      "updated_at": "2020-09-28T13:37:01Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "Seems to me the logic would be better placed in the binder logic itself, rather than in variable assignment. Might be a bit of work to do, but IMO typical variable assignments should not be half mixed up in what should be binder-specific logic. The binder does a fair bit of extra logic as it is already, it's kind of weird that this (and seemingly this alone) got thrown into the standard variable assignment logic.",
      "created_at": "2020-09-28T13:54:35Z",
      "updated_at": "2020-09-28T13:54:35Z"
    },
    {
      "author": "mklement0",
      "author_association": "CONTRIBUTOR",
      "body": "@rjmholt:\r\n\r\nAgreed on point 1.\r\n\r\n> muddying the concept might not have dire consequences\r\n\r\nIn the spirit of @vexx32's comment: It is the _current_ behavior that amounts to muddying: the inappropriate application of argument-mode parsing to expression-mode assignments.\r\n\r\n(Most users are probably not even aware that you can use validation attributes in constrained assignments too, and I'm not sure it has any real-world uses. Similarly, that a nonsensical constrained assignment such as\r\n`[alias('hi')] [Parameter(Mandatory)] [string] $there = 'foo'` is quietly accepted is worrisome, though that may be a manifestation of a larger problem of randomly placed attributes getting quietly ignored - see #10614)\r\n\r\n",
      "created_at": "2020-09-28T14:04:37Z",
      "updated_at": "2020-09-28T14:04:37Z"
    }
  ],
  "created_at": "2019-08-22T20:23:41Z",
  "labels": [
    "Issue-Question",
    "WG-Engine"
  ],
  "number": 10426,
  "state": "open",
  "title": "Type-constrained Boolean variables fail to implicitly convert from most types, such as PSObject / PSCustomObject instances",
  "updated_at": "2022-03-27T01:48:34Z"
}