{
  "_url": "https://github.com/PowerShell/PowerShell/issues/10490",
  "author": "towerbe",
  "body": "When running the command\r\n\r\nGet-Help <insert command name here>-online\r\n\r\nfrom PSCore 6.2.2, it opens the web page for the Powershell **5.0** documentation for the command.  One would think this should open the version-specific version of the documentation.  Not only has this caused issues for me, but I've also had experience where Microsoft support personnel were quoting from the wrong version of documentation because they didn't realize what was happening.\r\n",
  "closed_at": "2019-09-06T14:49:12Z",
  "comments": [
    {
      "author": "towerbe",
      "author_association": "NONE",
      "body": "FYI, I just looked at PS7.  Same issue.",
      "created_at": "2019-09-05T20:54:28Z",
      "updated_at": "2019-09-05T20:54:28Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "Have you run the `Update-Help` command to ensure you have the latest copy of the help & forwarding links? 🙂 ",
      "created_at": "2019-09-05T20:55:42Z",
      "updated_at": "2019-09-05T20:55:42Z"
    },
    {
      "author": "towerbe",
      "author_association": "NONE",
      "body": "I'd love to do that in PSCore 6.x, but considering that proxy doesn't work in 6.x and isn't going to be fixed (see https://github.com/PowerShell/PowerShell/issues/9495) I can't.  And yes I have in 7. Same issue.\r\n\r\nApologies in advance for the snarkiness.",
      "created_at": "2019-09-05T20:57:35Z",
      "updated_at": "2019-09-05T20:57:35Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "/cc @sdwheeler and @SteveL-MSFT -- is this something we need to rectify here or in https://github.com/MicrosoftDocs/PowerShell-Docs ? 🙂 \r\n\r\nAlso, should we perhaps consider making the help links for core modules into shortlinks to make updating the link targets simpler? \r\n\r\n<blockquote><img src=\"https://repository-images.githubusercontent.com/44411511/850abe80-7ca6-11e9-886f-a1b13b275ae0\" width=\"48\" align=\"right\"><div><img src=\"https://github.githubassets.com/favicon.ico\" height=\"14\"> GitHub</div><div><strong><a href=\"https://github.com/MicrosoftDocs/PowerShell-Docs\">MicrosoftDocs/PowerShell-Docs</a></strong></div><div>The official PowerShell documentation sources. Contribute to MicrosoftDocs/PowerShell-Docs development by creating an account on GitHub.</div></blockquote>",
      "created_at": "2019-09-05T21:04:28Z",
      "updated_at": "2019-09-05T21:05:41Z"
    },
    {
      "author": "sdwheeler",
      "author_association": "COLLABORATOR",
      "body": "For PS v6, this should be fixed already. Just need to run `Update-Help -Force`.",
      "created_at": "2019-09-05T21:08:15Z",
      "updated_at": "2019-09-05T21:08:15Z"
    },
    {
      "author": "towerbe",
      "author_association": "NONE",
      "body": "@sdwheeler, I was able to temporarily set the proxy for my PS v6 installation and force an update-help.  It is indeed fixed.  Thanks for that.  I did the same thing for PS v7, and it is now pointing at the  v6 online documentation instead of the v5 online documentation as before.\r\n\r\nProgress.",
      "created_at": "2019-09-06T12:56:36Z",
      "updated_at": "2019-09-06T12:56:36Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "Correct me if I'm wrong here @sdwheeler but I don't think the PS7 help is live yet, is it? Are we waiting for PS7 release to push that to the public docs pages?",
      "created_at": "2019-09-06T13:43:09Z",
      "updated_at": "2019-09-06T13:43:09Z"
    },
    {
      "author": "sdwheeler",
      "author_association": "COLLABORATOR",
      "body": "PSv7 content has been published to the live website. It started with a copy of PSv6 content. Somecmdlet reference has been updated for PSv7 but only if a) the code PR for the change was merged in the PowerShell source repo, and b) somebody wrote the doc updates. The PSv7 content is considered to be **preview** content.\r\n\r\nFor PSv6 and PSv7, I created all new FWLinks to point to the correct online content. You have to download the latest help files to get those links. However, I don't think we are building and hosting updateable help CABs for PSv7 yet. So if you try `Update-Help` in PSv7 you probably get PSv6 content. Publishing PSv7 CABs will get turned on for the GA release.\r\n\r\nI did not fix any FWLink problems for PS5.1 and below since we are not publishing updated CABs at this time. There several MS-internal technical and procedural issues we have to solve to publish new CABs for PS5.1 and below.\r\n\r\nOne way to get updated help for any version is to build the CAB files yourself from the markdown source using PlatyPS and then install them from a local folder. This would be similar to the `Save-Help`/`Update-Help` scenario.",
      "created_at": "2019-09-06T14:49:12Z",
      "updated_at": "2019-09-06T14:53:00Z"
    }
  ],
  "created_at": "2019-09-05T20:53:36Z",
  "number": 10490,
  "state": "closed",
  "title": "PowerShell Core get-help online points to wrong version",
  "updated_at": "2019-09-16T10:35:18Z"
}