{
  "_url": "https://github.com/PowerShell/PowerShell/issues/10541",
  "author": "kilasuit",
  "body": "Issues can get closed as answered when they really aren't\r\n![image](https://user-images.githubusercontent.com/6355225/64915572-30fa7d00-d762-11e9-85e9-e291874adbbb.png)\r\n\r\nAn example is #10509 where there is further conversation happening after the issue has been flagged as resolution-answered & a single day of no further responses.\r\n\r\nPerhaps msftbot should look for issues that have not had a response for 3 days and then mark them as closed instead of the current 1 day behaviour",
  "closed_at": "2020-02-01T00:00:23Z",
  "comments": [
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "I was thinking maybe a week or so? Because, really, if there is no discussion further, it doesn't matter if the wait time is 3 days or 1 week. But yeah, either way it definitely needs to be more than 1 day. It's too abrupt. 🙂 ",
      "created_at": "2019-09-15T02:33:40Z",
      "updated_at": "2019-09-15T02:33:40Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "We set the label _manually_, GitHub does not send notifications for the event and users will not see the status change _until the issue is closed_. So the proposal make no sense.",
      "created_at": "2019-09-16T09:48:25Z",
      "updated_at": "2019-09-16T09:48:25Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "@iSazonov we're seeing issues closed when PS team or maintainers see the issue as answered. Users are not always looking for an answer and are instead making a module suggestion.\r\n\r\nAdditional time period is needed to allow users to communicate their intentions more clearly and resolve misunderstandings. So either the bot needs to be adjusted or maintainers / PS team need to be much more hesitant to mark issues as resolved or answered without first confirming with the user who opened the issue.\r\n\r\nIf we do not, people will be deterred from reporting issues. The perception currently is frequently that their requests are not being heard out completely, and being dismissed at the earliest opportunity.",
      "created_at": "2019-09-16T10:53:22Z",
      "updated_at": "2019-09-16T10:53:38Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "@vexx32 It is __manual__ work to set resolution label (auto close works only from PRs). We could be deffer this for a week but (1) really we have no conflicts - we very rarely receive requests for reopen, (2) it can consume many time to review events for a week.\r\n\r\n__I'd happy to get requests to close issues that deserve it __ that not only saves my time but makes the repo more clean.\r\n\r\nThere are many issues that are too general to be implemented and will never be resolved. I believe we should close such dead issues to force splitting them on issues which would be understandable, small and easy to implement.\r\n\r\n",
      "created_at": "2019-09-16T12:32:22Z",
      "updated_at": "2019-09-16T12:32:22Z"
    },
    {
      "author": "kilasuit",
      "author_association": "COLLABORATOR",
      "body": "@iSazonov we get that but respectfully you are just one of the collaborators and we aren't asking for the label removed\r\n\r\n> we very rarely receive requests for reopen, \r\n\r\nthis is in part because IMO it can feel hostile to open a ticket and have it rashly closed by a bot **1 day** after the label assigned that it's resolved. This *should* be changed to a longer period to allow additional views",
      "created_at": "2019-09-16T17:56:08Z",
      "updated_at": "2019-09-16T17:56:08Z"
    },
    {
      "author": "kilasuit",
      "author_association": "COLLABORATOR",
      "body": "another hastily closed ticket because of msftbot #10540",
      "created_at": "2019-09-18T02:06:38Z",
      "updated_at": "2019-09-18T02:06:38Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "@kilasuit  #10540 is external issue. https://github.com/PowerShell/WindowsCompatibility is right place for the issue.\n\n<blockquote><img src=\"https://avatars0.githubusercontent.com/u/11524380?s=400&v=4\" width=\"48\" align=\"right\"><div><img src=\"https://github.githubassets.com/favicon.ico\" height=\"14\"> GitHub</div><div><strong><a href=\"https://github.com/PowerShell/WindowsCompatibility\">PowerShell/WindowsCompatibility</a></strong></div><div>Module that allows Windows PowerShell Modules to be used from PSCore6 - PowerShell/WindowsCompatibility</div></blockquote>",
      "created_at": "2019-09-18T03:01:23Z",
      "updated_at": "2019-09-18T03:01:25Z"
    },
    {
      "author": "doctordns",
      "author_association": "COLLABORATOR",
      "body": "I am not sure I totally agree with this (it's a wincompat issue not ours). At the end of the day, PowerShell 7 (at least P.3) can not support several modules (Best Practices, WSUS amongst them plus you can not install docker/WIn Containers). The goal of replacing WIndows PowerShell 5.x with PowerShell 7 is a worthy one and one I support - but these are two modules we need at least a workaround for. \r\n\r\nAnd immediately closing an issue, eg #10540 without ensuring the issue is actually resolved (or resolvable), seems premature.\r\n\r\nFinally, shouldn't it be for the OP to agree with closing an issue?",
      "created_at": "2019-09-18T09:34:41Z",
      "updated_at": "2019-09-18T09:34:41Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "@doctordns Answer was that you can/should report to https://github.com/PowerShell/PowerShellModuleCoverage all MSFT modules you find incompatible with PowerShell Core. _There_ issue will remain open until fix.\n\n<blockquote><img src=\"https://avatars0.githubusercontent.com/u/11524380?s=400&v=4\" width=\"48\" align=\"right\"><div><img src=\"https://github.githubassets.com/favicon.ico\" height=\"14\"> GitHub</div><div><strong><a href=\"https://github.com/PowerShell/PowerShellModuleCoverage\">PowerShell/PowerShellModuleCoverage</a></strong></div><div>Track issues related to using Windows PowerShell modules with PowerShell Core 6 - PowerShell/PowerShellModuleCoverage</div></blockquote>",
      "created_at": "2019-09-18T10:13:22Z",
      "updated_at": "2019-09-18T10:13:24Z"
    },
    {
      "author": "msftbot[bot]",
      "author_association": "NONE",
      "body": "This issue has been marked as answered and has not had any activity for **1 day**. It has been closed for housekeeping purposes.",
      "created_at": "2020-02-01T00:00:22Z",
      "updated_at": "2020-02-01T00:00:22Z"
    }
  ],
  "created_at": "2019-09-15T01:45:08Z",
  "number": 10541,
  "state": "closed",
  "title": "Housekeeping - msftbot needs to be tamed a bit",
  "updated_at": "2020-02-01T00:00:23Z"
}