{
  "_url": "https://github.com/PowerShell/PowerShell/issues/10589",
  "author": "msftrncs",
  "body": "I am still experiencing an issue where the icon (not the shortcut itself) is lost on the shortcut pinned on the task bar when upgrading PowerShell 7 preview versions.   (side note, 6.2.3 still lost the entire shortcut when upgrading from 6.2.2)   I just upgraded from preview 3 to preview 4.\r\n\r\n![image](https://user-images.githubusercontent.com/26179051/65366205-831a2300-dbe6-11e9-871a-4ec31fe7ee04.png)\r\n\r\nWindows 10, Insiders build (currently 18980).\r\n\r\nReference #8918, #6088",
  "closed_at": "2019-09-25T00:00:35Z",
  "comments": [
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "I think we will need to test 6.2.3 -> 7.0 upgrade before release. /cc @SteveL-MSFT @TravisEz13 ",
      "created_at": "2019-09-21T15:40:54Z",
      "updated_at": "2019-09-21T15:40:54Z"
    },
    {
      "author": "TravisEz13",
      "author_association": "MEMBER",
      "body": "Yes, this will occur due to how MSI works.  If this is a feature request that we actually support a real upgrade, I would suggest that we only do that with a different installer technology.  ",
      "created_at": "2019-09-21T17:44:43Z",
      "updated_at": "2019-09-21T17:44:43Z"
    },
    {
      "author": "msftrncs",
      "author_association": "CONTRIBUTOR",
      "body": "It would be nice  when upgrade from 6.x to final 7, that the user does not lose the shortcut/icon, but I don't expect that as much as I expect to upgrade minor versions without loss of shortcut/icon.\r\n\r\nIf the icon is going to be lost, and there is no real resolution to it (I think there is, a process should simply set the shortcut icon to the correct one instead of the MSI installer based icon, then when that shortcut is pinned it won't be using the installer icon), then keeping the shortcut around during the upgrade isn't that much use  … because now I have to unpin and repin the shortcut anyway.\r\n\r\n\r\n",
      "created_at": "2019-09-22T03:40:20Z",
      "updated_at": "2019-09-22T03:40:20Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "A reference to the icon looks like `%SystemRoot%\\Installer\\{8BC1F0C3-BB77-46F7-BE0F-34A81E60509E}\\PowerShellExe.ico`. Can we preserve the GUID? (The shortcut is in `C:\\Users\\username\\AppData\\Roaming\\Microsoft\\Internet Explorer\\Quick Launch\\User Pinned\\TaskBar` forlder)\r\nAlso we integrate the icon in exe file too. So the reference could be `%ProgramFiles%\\PowerShell\\7-preview\\pwsh.exe`. In the case we can not upgrade from preview to release.",
      "created_at": "2019-09-22T16:27:02Z",
      "updated_at": "2019-09-22T16:27:02Z"
    },
    {
      "author": "TravisEz13",
      "author_association": "MEMBER",
      "body": "This already occurs for non-previews, but we can make no such guarantees for previews builds without manually changes the guid often:\r\nhttps://github.com/PowerShell/PowerShell/commit/f5fc0535ac8a04edd2cf3ed6d4b901d949f16f52",
      "created_at": "2019-09-22T18:46:28Z",
      "updated_at": "2019-09-22T18:46:28Z"
    },
    {
      "author": "bergmeister",
      "author_association": "CONTRIBUTOR",
      "body": "I've already fixed the problem with the shortcuts pinned to the task bar in #9305 and in previews release of v7 it already works fine for me and other people (with the only small exception being the windows icon). I guess using an Insiders Windows build resets certain things during an upgrade which causes your problem.\r\nGenerally speaking, due to the default installation path changing between v6 and v7 shortcuts will need to be re-pinned anyway, remember guys: This is something external to the installation that is hard to manage and with WiX we are pretty much at the limit what is possible, MSIX should make things better.",
      "created_at": "2019-09-22T20:33:58Z",
      "updated_at": "2019-09-22T20:34:17Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "Clear about 6 -> 7 but @msftrncs reports that issue is with 7Preview3 -> 7Preview4",
      "created_at": "2019-09-23T03:11:01Z",
      "updated_at": "2019-09-23T03:11:01Z"
    },
    {
      "author": "msftrncs",
      "author_association": "CONTRIBUTOR",
      "body": "@bergmeister, it is true, the shortcut remains.  Also, maybe I should be more careful to post that I am using Win 10 Insiders.  I do use two machines, and when the issue happens on both of them, its very likely I will be posting from the Insiders machine, and I do not consider needing to indicate that I have demonstrated the issue on multiple installations with different versions.\r\n",
      "created_at": "2019-09-23T04:52:46Z",
      "updated_at": "2019-09-23T04:52:46Z"
    },
    {
      "author": "msftrncs",
      "author_association": "CONTRIBUTOR",
      "body": "Evidently I accidently hit tab and space, closing my last comment and the issue …  :(\r\n\r\nSo if I understand this whole thing correctly, it boils down to a GUID, which is allowed to change for each preview build, but will not be for the final version (or stable build) and its updates.",
      "created_at": "2019-09-23T05:22:03Z",
      "updated_at": "2019-09-23T05:22:03Z"
    },
    {
      "author": "bergmeister",
      "author_association": "CONTRIBUTOR",
      "body": "@msftrncs The improvement has only gone into v7. The improvement means that for patch (and I also think minor or major) upgrades of the MSI, the shortcut will be preserved. In any situation where the default installation path changes like e.g. from v6 to v7, I'd expect to change the GUID by design because the shortcut will point to the old, wrong location anyway. In a nutshell: The first upgrade from v6 to v7 will require a re-pin but any further minor or patch updates to v7 will not suffer from this problem.\r\nAlso please remember: You might see the icon disappear after a reboot but the pinned link on the taskbar still works. The icon issue seems to be a difficult Windows issue that would need to be worked around, which seems to be very hard when using WiX, I've asked in the WiX mailing list and got no answer.",
      "created_at": "2019-09-23T08:13:49Z",
      "updated_at": "2019-09-23T08:16:57Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "I didn't observe this issue from PS7 P3->P4.  As @bergmeister noted, this fix was not backported to PSCore6.x",
      "created_at": "2019-09-23T20:52:53Z",
      "updated_at": "2019-09-23T20:53:05Z"
    },
    {
      "author": "msftbot[bot]",
      "author_association": "NONE",
      "body": "This issue has been marked as answered and has not had any activity for **1 day**. It has been closed for housekeeping purposes.",
      "created_at": "2019-09-25T00:00:34Z",
      "updated_at": "2019-09-25T00:00:34Z"
    }
  ],
  "created_at": "2019-09-21T01:39:17Z",
  "labels": [
    "Issue-Question",
    "Area-Maintainers-Build",
    "Resolution-Answered"
  ],
  "number": 10589,
  "state": "closed",
  "title": "PowerShell preview Pinned Taskbar Icon is lost after upgrade",
  "updated_at": "2019-09-25T00:00:35Z"
}