{
  "_url": "https://github.com/PowerShell/PowerShell/issues/10658",
  "author": "Skybeat",
  "body": "\r\n\r\n# Steps to reproduce\r\n\r\n- create text file in UTF-8\r\n- run the follow command in powershell 5\r\n    `Get-Content <path to UTF8 file> -Encoding UTF8 | Set-Content <path to new output file> -Encoding default`\r\n- the output file will be encoded in ANSI (what is correct)\r\n\r\n- run the follow command in powershell core (6.2.1)\r\n    `Get-Content <path to UTF8 file> -Encoding UTF8 | Set-Content <path to new output file> -Encoding default`\r\n- the output file will be encoded in UTF8I (what is NOT correct)\r\n\r\n\r\n# Expected behavior\r\n\r\nthe output file from Set-Content with parameter \"-Encoding ANSI\" have to bee encoded in ANSI like it does in Powershell 5 and so on\r\n\r\n\r\n# Actual behavior\r\n\r\nthe output file from Set-Content with parameter \"-Encoding default\" is encoded in UTF8 what is wrong\r\n\r\n# Environment data\r\n\r\n<!-- provide the output of $PSVersionTable -->\r\n\r\nName                           Value\r\n----                           -----\r\nPSVersion                      6.2.1\r\nPSEdition                      Core\r\nGitCommitId                    6.2.1\r\nOS                             Microsoft Windows 6.1.7601 S\r\nPlatform                       Win32NT\r\nPSCompatibleVersions           {1.0, 2.0, 3.0, 4.0.}\r\nPSRemotingProtocolVersion      2.3\r\nSerializationVersion           1.1.0.1\r\nWSManStackVersion              3.0\r\n\r\n",
  "closed_at": "2019-10-09T23:47:48Z",
  "comments": [
    {
      "author": "Skybeat",
      "author_association": "NONE",
      "body": "One more thing what shows that there is a issue:\r\nIf i run the command `[System.Text.Encoding]::Default.EncodingName` in PowerShell 5 it shows \"Western Europen (Windows)\" what is correct. If i run the same command in Powershell Core 6.2.1, the outcome is \"Unicode (UTF-8)\" what is totally wrong.",
      "created_at": "2019-10-01T07:49:55Z",
      "updated_at": "2019-10-01T07:50:25Z"
    },
    {
      "author": "alexandair",
      "author_association": "CONTRIBUTOR",
      "body": "Default value for the `Encoding` parameter has been changed in PowerShell Core. Here is the excerpt from the Set-Content help doc:\r\n```\r\n-Encoding \r\nSpecifies the type of encoding for the target file. The default value is UTF8NoBOM.\r\n```",
      "created_at": "2019-10-01T09:38:40Z",
      "updated_at": "2019-10-01T09:38:40Z"
    },
    {
      "author": "jhoneill",
      "author_association": "NONE",
      "body": "> If i run the command `[System.Text.Encoding]::Default.EncodingName` in PowerShell 5 it shows \"Western Europen (Windows)\" what is correct. If i run the same command in Powershell Core 6.2.1, the outcome is \"Unicode (UTF-8)\" \r\n\r\nDifferent versions of .NET have different default text encodings.  (That's not a PowerShell thing) \r\nSee https://docs.microsoft.com/en-us/dotnet/api/system.text.encoding.default?view=netframework-4.8\r\nThere's a big warning and then an explanation of how it is set on .NET frame work followed by this:\r\n _On .NET Core, the Default property always returns the UTF8Encoding._\r\n\r\n ",
      "created_at": "2019-10-01T12:57:26Z",
      "updated_at": "2019-10-01T16:07:45Z"
    },
    {
      "author": "Skybeat",
      "author_association": "NONE",
      "body": "> > If i run the command `[System.Text.Encoding]::Default.EncodingName` in PowerShell 5 it shows \"Western Europen (Windows)\" what is correct. If i run the same command in Powershell Core 6.2.1, the outcome is \"Unicode (UTF-8)\"\r\n> \r\n> Different versions of .NET have different default text encodings. (That's not a PowerShell thing)\r\n> See https://docs.microsoft.com/en-us/dotnet/api/system.text.encoding.default?view=netframework-4.8\r\n> There's a big warning and then an explanation of how it is set on .NET frame work followed by this:\r\n> _On .NET Core, the Default property always returns the UTF8Encoding._\r\n> \r\n> > Default value for the `Encoding` parameter has been changed in PowerShell Core.\r\n> \r\n> This is in the `OutputEncoding` preference variable, which starts as `[System.Text.Encoding]::Default `\r\n\r\nThank you for the information!\r\n\r\nSo is there a way that i can change / overwrite the default encoding in powershel core, back to the \"old\" behavior we have had in PowerShell till 5.1? \r\nIf so, how can i do this in PowerShell Core?\r\nI mean i like it mutch more the way that default means the system-wide settings and not fixed UTF8, especially if I specify a special parameter like -Encoding.\r\nThat make absolutly no sense for me. In my opinion it wold be better to make the encoding for all this cmdleds default to UTF8 and as far as the parameter -Encoding is set it use the given codepage or if the value for -Encoding is default, it use the system-wide default setting, from the OS.\r\n\n\n<blockquote><div><strong><a href=\"https://docs.microsoft.com/en-us/dotnet/api/system.text.encoding.default\">Encoding.Default Property (System.Text)</a></strong></div></blockquote>",
      "created_at": "2019-10-01T15:35:03Z",
      "updated_at": "2019-10-01T15:35:05Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "You can set `$PSDefaultParameterValues['*:Encoding'] = 'ANSI'` or whatever value you happen to prefer. If you add that line to a `$profile` script, it will be effectively persistent. 🙂 ",
      "created_at": "2019-10-01T15:39:07Z",
      "updated_at": "2019-10-01T15:39:07Z"
    },
    {
      "author": "jhoneill",
      "author_association": "NONE",
      "body": "Sorry , what I said above about Output encoding is wrong. It is not used as the default value for encoding.  For more details on what it does see get-help about_preferenceVariables, and \r\n`get-help out-file -Parameter encoding`  says the defaults are set in cmdlets and gives the right default information on different versions. @vexx32  suggests one good solution, if the encoding matters to a given script/module, specify it explicitly in the code.\r\n",
      "created_at": "2019-10-01T16:14:05Z",
      "updated_at": "2019-10-01T16:14:05Z"
    },
    {
      "author": "Skybeat",
      "author_association": "NONE",
      "body": "> if the encoding matters to a given script/module, specify it explicitly in the code.\r\n\r\nWell, you are right that is a way but, now with this `-Encoding default` is all the time UTF8 and i have to explicit set the codepage, it goes from easy to complex. All scripts what comes from PowerShell 5 or below and worked very well, are now don't work as expected. It will coast a lot of time to find the issue  because of PowerShell core.  There is a nice sentence: Never change a simple running system.\r\nIn my opinion, users questions will now increase because of the crazy behavior of PowerShell Core when it comes to encoding.\r\n\r\nPerhaps it should be considered, for the parameter -Encoding, to introduce a value such as OSdefault, like `-Encoding OSdefault`\r\n\r\nBut any ways, now that i know how complex i have to do it, because PowerShell Core are not willing to use the OS default settings any more, I have to use the new way.\r\n\r\n",
      "created_at": "2019-10-01T19:14:13Z",
      "updated_at": "2019-10-01T19:14:13Z"
    },
    {
      "author": "jhoneill",
      "author_association": "NONE",
      "body": "\r\n\r\n\r\n\r\n\r\n\r\n@Skybeat  We may have been talking at cross-purposes. \r\n\r\n@SteveL-MSFT  this might not be answered after all. \r\n\r\nIn Windows PowerShell the helps says \r\n\" _Unicode is the default.\r\n   Default uses the encoding of the system's current ANSI code page_.\"\r\n\r\nThe current source has an  `ArgumentToEncodingTransformationAttribute ` class which  transforms \"Default\" \"Utf8\" and \"Utf8NoBom\" to the same thing. \r\n\r\nSo the **meaning of \"Default\" has changed** from \"Current default ANSI code page\" to \"default for this command\"  \r\n\r\n\r\nTo get the equivalent of `-Encoding Default` on Windows PowerShell one has to run \r\n`-Encoding $ExecutionContext.Host.CurrentCulture.TextInfo.ANSICodePage` on PowerShell 6/7 \r\nbut this means you can't have one script which works on all versions  \r\n\r\nReally, specifying `-encoding Default `  should revert to to what it did in 5. \r\n Currently it's a change which might break scripts which target \"5 and later\". \r\nHowever rolling it back should  not break anything for scripts which target \"6 and later\" because  no-one should be writing `-Encoding Default` in V6/7: tab completion doesn't suggest it, the help excludes it, and writing nothing at all achieves the same thing. \r\nIf someone wants to be explicit about UTF8 encoding in 6/7 they shouldn't be using \"default\" to do it but \"UTF8\" or \"UTF8NoBOM\".  \r\n\r\n\r\n\r\n ",
      "created_at": "2019-10-01T21:48:35Z",
      "updated_at": "2019-10-01T21:48:35Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "cc @JamesWTruher your thoughts on this?  Calling `Default` to mean Windows PowerShell would solve the compatibility concern, but the default is UTF8NoBOM so that would introduce confusion. ",
      "created_at": "2019-10-02T01:29:23Z",
      "updated_at": "2019-10-02T01:29:23Z"
    },
    {
      "author": "Skybeat",
      "author_association": "NONE",
      "body": "> Really, specifying `-encoding Default ` should revert to to what it did in 5.\r\n> Currently it's a change which might break scripts which target \"5 and later\".\r\n> However rolling it back should not break anything for scripts which target \"6 and later\" because no-one should be writing `-Encoding Default` in V6/7: tab completion doesn't suggest it, the help excludes it, and writing nothing at all achieves the same thing.\r\n> If someone wants to be explicit about UTF8 encoding in 6/7 they shouldn't be using \"default\" to do it but \"UTF8\" or \"UTF8NoBOM\".\r\n\r\nThat is what i mean.\r\nfor now scripts till Powershell 5.1 will not work as expected in PowerShell 6/7 (i have this issue by my own with currently 6 scripts).\r\nI change like this with \"-Encoding default\" will make all older scripts from Powershell 5.1 and older incompatible. \r\n",
      "created_at": "2019-10-03T14:44:47Z",
      "updated_at": "2019-10-03T14:44:47Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "I doubt telling people that the \"default\" setting for -Encoding (which isn't the _real_ default value for those cmdlets, which would still be `UTF8NoBom`) is WinPS's default is a good idea.\r\n\r\nFolks can just specify their encodings. This is a major version bump. Expecting folks to review and update their scripts before upgrading really ought to be a _given_, especially the ease of which you could do this with, for example, a hashtable variable for splatting into anything that needs an -Encoding parameter.",
      "created_at": "2019-10-03T14:52:32Z",
      "updated_at": "2019-10-03T14:52:32Z"
    },
    {
      "author": "Skybeat",
      "author_association": "NONE",
      "body": "> I doubt telling people that the \"default\" setting for -Encoding (which isn't the _real_ default value for those cmdlets, which would still be `UTF8NoBom`) is WinPS's default is a good idea.\r\n> \r\n> Folks can just specify their encodings. This is a major version bump. Expecting folks to review and update their scripts before upgrading really ought to be a _given_, especially the ease of which you could do this with, for example, a hashtable variable for splatting into anything that needs an -Encoding parameter.\r\n\r\nOn one hand your are true when you say the user have to check his scripts before. On the other handy, make a move from WinPS to PS Core as simple as posible and get more acceptance and enjoyment from the end users. It is not always good to reinvent the wheel! It has been so over 3 Powershell versions that will frustrate end users when everything is re-invented and will not promote the acceptance to PS Core right now.",
      "created_at": "2019-10-03T15:24:38Z",
      "updated_at": "2019-10-03T15:24:38Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "I appreciate the desire for convenience, but this is not a matter of reinventing the wheel. It's more a matter of aligning PowerShell to established standards in the majority of operational infrastructure, especially in (ever more common) environments where Unix operating systems run the server infrastructure. UTF8 without BOM is largely the standard encoding for text files at present. ",
      "created_at": "2019-10-03T15:32:45Z",
      "updated_at": "2019-10-03T15:33:06Z"
    },
    {
      "author": "Skybeat",
      "author_association": "NONE",
      "body": "> I appreciate the desire for convenience, but this is not a matter of reinventing the wheel. It's more a matter of aligning PowerShell to established standards in the majority of operational infrastructure, especially in (ever more common) environments where Unix operating systems run the server infrastructure. UTF8 without BOM is largely the standard encoding for text files at present.\r\n\r\nSo that means that Powershell, what comes from Windows platformes, must now go \"standarts\" from Unix world?!?! Why don't we say the Windows / Microsoft way is a standart and Unix is out of standart?!?!\r\n\r\nDon't get me wrong but i can't see any reason of the Encoding change. I can see only a lot of problems / issues for the end users special those who have been running scripts for years without any problems, but these will no longer work properly with Powershell core.\r\n\r\nFor example, the \"-Encoding default\" is changed to UTF8 all the time, but the Parameter Name -Encoding himself is not changed. Why you don't change the parameter name from \"-Encoding\" to \"-Encode\"? Because the reason is that PS 5 and older scripts want be work. \r\nSo please tell me the reason to change a running system to a system what brings so many issues for end users. And please don't say Unix is standart, a lot of users will say Windows is standard. Who has determined the Unix standard and everything else out of the standard?\r\n",
      "created_at": "2019-10-03T16:55:35Z",
      "updated_at": "2019-10-03T16:55:35Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "See [here](https://stackoverflow.com/questions/2223882/whats-the-difference-between-utf-8-and-utf-8-without-bom) for lengthy discussions on various reasonings for or against BOM. The general consensus is that it's not worth adding the BOM to UTF8 files.\r\n\r\nAt the end of the day, we're here now. And while I appreciate it might be an inconvenience to you to have to update your scripts, I don't think one person is a sufficient driving force to change the standard for all of PowerShell.\r\n\r\nIf it makes life difficult for you, you can easily set your own defaults for these parameters in a profile script or simply add one easy line to affected scripts to set the default for those scripts using my previous suggestion. 🙂 ",
      "created_at": "2019-10-03T18:01:50Z",
      "updated_at": "2019-10-03T18:01:50Z"
    },
    {
      "author": "jhoneill",
      "author_association": "NONE",
      "body": "@vexx32 \r\n> I doubt telling people that the \"default\" setting for -Encoding (which isn't the _real_ default value for those cmdlets, which would still be `UTF8NoBom`) is WinPS's default is a good idea.\r\n> \r\n> Folks can just specify their encodings. \r\n\r\nJoel, you're right. \"Default\" was a bad choice of name in Windows PowerShell. It doesn't come up with the argument completer, it's not listed in the help.  So people are no longer told about \"Default\" And if people want the default Ansi code page they can put `1252` or `$ExecutionContext.Host.CurrentCulture.TextInfo.ANSICodePage`\r\n\r\n**But** there is undocumented support for \"default\", which seems specifically so that old scripts don't break. Either that should go,  or it should keep those old scripts working in the way they used to work. Silently changing \"default\" mean what most people would expect is wrong. \r\n\r\nIt's one place. In EncodingUtils.cs there is this\r\n```\r\ninternal static Dictionary<string, Encoding> encodingMap = new Dictionary<string, Encoding>(StringComparer.OrdinalIgnoreCase)\r\n        {\r\n            { Ascii, System.Text.Encoding.ASCII },\r\n            { BigEndianUnicode, System.Text.Encoding.BigEndianUnicode },\r\n            { Default, ClrFacade.GetDefaultEncoding() },\r\n            { OEM, ClrFacade.GetOEMEncoding() },\r\n            { Unicode, System.Text.Encoding.Unicode },\r\n            { Utf7, System.Text.Encoding.UTF7 },\r\n            { Utf8, ClrFacade.GetDefaultEncoding() },\r\n            { Utf8Bom, System.Text.Encoding.UTF8 },\r\n            { Utf8NoBom, ClrFacade.GetDefaultEncoding() },\r\n            { Utf32, System.Text.Encoding.UTF32 },\r\n            { String, System.Text.Encoding.Unicode },\r\n            { Unknown, System.Text.Encoding.Unicode },\r\n        };\r\n     \r\n```\r\nEither delete the \"default\" entry and make people re-write to get the old behaviour or replace it with a suitable  `System.Text.Encoding.something`  which will give the old behaviour (without documenting it).  \r\n\r\n",
      "created_at": "2019-10-03T18:28:26Z",
      "updated_at": "2019-10-03T18:28:26Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "My personal opinion is (if anything) we should delete the `Default` entry and just document in the parameter help which of the standard options corresponds to the default value in pwsh, perhaps adding a note that it differs from Windows PowerShell. \r\n\r\nThat way we have a more clear and obvious sign to users coming from Windows PowerShell that this has changed, and we don't have inexplicable failures coming from somewhere else all of a sudden. 🙂 ",
      "created_at": "2019-10-03T18:36:40Z",
      "updated_at": "2019-10-03T18:36:40Z"
    },
    {
      "author": "jhoneill",
      "author_association": "NONE",
      "body": "I think deleting it is the second best choice. The ideal would be to keep it working but print a warning that it is deprecated, and delete it from a later version.\r\n",
      "created_at": "2019-10-03T19:21:24Z",
      "updated_at": "2019-10-03T19:21:24Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "@PowerShell/powershell-committee to discuss removing `Default`.",
      "created_at": "2019-10-03T19:24:19Z",
      "updated_at": "2019-10-03T19:24:19Z"
    },
    {
      "author": "Skybeat",
      "author_association": "NONE",
      "body": "> @PowerShell/powershell-committee to discuss removing `Default`.\r\n\r\nWhy you want discuss a remove? A remove will also break all WinPS scripts.\r\nWhy don't go back do the behavior of WinPS because you have allready a value UTF8 for param -Encoding?\r\n\r\nCan you please tell me the reason what makes iit so hard for you to let the old behavior from WinPS , in PS Core, as it is in WinPS?\r\nWhy is there a strong attempt to change or delete the value \"default\", which has existed for years and has been used and proven?\r\nThat makes no sense to me and I can not understand that.\r\nI mean PowerShell is a name of a strong and usefull product since years, and if you want change even such simple things like this, then maybe it is better you have to change the name of the product as well and let PowerShell die.\r\nI have the feeling that just this important part is completely ignored.\r\n\r\nBut ok, I'm only a small single user, we'll see what the future holds and how the stack overflow and co entries pile up because of such changes and end users are suffering.\r\n\r\nBut these are the different perspectives between developers of PowerShell and users of PowerShell. Maybe the focus should not only be on development but also on usability",
      "created_at": "2019-10-03T20:53:18Z",
      "updated_at": "2019-10-03T20:56:09Z"
    },
    {
      "author": "jhoneill",
      "author_association": "NONE",
      "body": "The alternative to delete is to make that line in  EncodingUtils.cs \r\n\r\n` { Default, System.Text.Encoding.GetEncoding(Host.CurrentCulture.TextInfo.ANSICodePage) }, `\r\n\r\nThis, delete and \"no change\" are the options the committee should discuss :-)  The choice between breaking change and non-breaking change are as simple as 3 options for one line. \r\n\r\n ",
      "created_at": "2019-10-03T21:02:33Z",
      "updated_at": "2019-10-03T21:02:33Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "@Skybeat the @PowerShell/powershell-committee has already discussed and approved the [RFC on default encoding](https://github.com/PowerShell/PowerShell-RFC/blob/35e0d7cf29a55980a428fd3b115d43b29638faf4/5-Final/RFC0020-DefaultFileEncoding.md).  Looking at it again, it appears we did not implement `$PSDefaultEncoding` where there is a `WindowsLegacy` value that would resolve your issue, but only if you knew about it.  The concept behind removing `Default` is that anyone relying on it would know immediately they were not getting the Windows PowerShell default encoding.  The absence of specifying `-Encoding` would be UTF8NoBOM.",
      "created_at": "2019-10-03T21:24:55Z",
      "updated_at": "2019-10-03T21:24:55Z"
    },
    {
      "author": "Skybeat",
      "author_association": "NONE",
      "body": "> @Skybeat the @PowerShell/powershell-committee has already discussed and approved the [RFC on default encoding](https://github.com/PowerShell/PowerShell-RFC/blob/35e0d7cf29a55980a428fd3b115d43b29638faf4/5-Final/RFC0020-DefaultFileEncoding.md). Looking at it again, it appears we did not implement `$PSDefaultEncoding` where there is a `WindowsLegacy` value that would resolve your issue, but only if you knew about it. The concept behind removing `Default` is that anyone relying on it would know immediately they were not getting the Windows PowerShell default encoding. The absence of specifying `-Encoding` would be UTF8NoBOM.\r\n\r\n@SteveL-MSFT \r\nthank you for your answer.\r\nNow after you remove the value `default,` will you also document (an example) how user can get back there funktionality as it was in WinPS? \r\nFor the parameter -Encoding, there is no value like `OSdefault` (like default was in WinPS). \r\nCan you may also discuss with the comittee, to implement a value like `OSdefault` with the value of default OS encoding ?\r\nWhat i mean is that as long as `OSdefault` is set as value for `-Encoding` it will use the OS default settings no matter if it is Unix or Windows. `OSdefault` force to read the OS default endocing and use it. That would be a very good and especially and easy usability and on top, the end user can easy see on the name of the value what it means.\r\n\r\nOr can you add a value for ANSI like `ANSI` and implement it with the code from @jhoneil\r\n`{ ANSI, System.Text.Encoding.GetEncoding(Host.CurrentCulture.TextInfo.ANSICodePage) },`\r\n\r\nThank you.",
      "created_at": "2019-10-03T21:46:17Z",
      "updated_at": "2019-10-03T21:50:37Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "I understand this is a pain point, the @PowerShell/powershell-committee will consider different options.  Removing `Default` is just one option.",
      "created_at": "2019-10-03T21:58:56Z",
      "updated_at": "2019-10-03T21:58:56Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "@PowerShell/powershell-committee discussed this.  Despite the pain of `Default` having different meanings on Windows PowerShell and PowerShell Core, we made a deliberate decision to enable cross platform support of PowerShell Core for the broader community.  At this point, no further changes are planned to be made.",
      "created_at": "2019-10-09T22:42:22Z",
      "updated_at": "2019-10-09T22:42:22Z"
    },
    {
      "author": "Skybeat",
      "author_association": "NONE",
      "body": "> @PowerShell/powershell-committee discussed this. Despite the pain of `Default` having different meanings on Windows PowerShell and PowerShell Core, we made a deliberate decision to enable cross platform support of PowerShell Core for the broader community. At this point, no further changes are planned to be made.\r\n\r\n@SteveL-MSFT \r\nThat means / you will say that \"to enable PowerShell Core for the broader community\" means you have to change the value \"default\" in the parameter \"_Encoding\" because to enable PS Core for a broader Community?!\r\nPlease read your own sentence again, that makes zero sence! Since WinPS there was a value \"UTF8\" for param \"-Encoding\" so it makes zero sence to change it with Core so that value \"default\" do exactly the same like \"UTF8\". \r\n\r\nAnd you would have reached the wider community if I had left the value \"Default\" on OS Encoding setting. Then you would reach even more in the community because it would be even more flexible as before and even more as it is now. Now there are 2 different values that the same do but no longer value to ANSI encoded. For all those who want to encode to ANSI it gets totally complicated starting with PS Core.\r\nThanks for opening PS Core to the broad community.\r\n\r\nSorry but you to a very big mistake on basic thinks! If this is how PS core gose to, than i have to tell all my customers to don't use PS Core because it is not longer a descendant of Powershell and not compatible to WinPS at all.\r\n\r\nThank you!",
      "created_at": "2019-10-10T11:46:50Z",
      "updated_at": "2019-10-10T11:46:50Z"
    },
    {
      "author": "Skybeat",
      "author_association": "NONE",
      "body": "It's a shame the issue has just been closed and the bug just stays in PS Core.\r\nI will explain the link to this issue and show the users (especially those who use Powershzell for many years in Windows) how important Microsoft's own product is now to their own operating system. Microsoft already counts alleged standards of Linux / Unix more than an existing and functinating standart functionality in Powershell.",
      "created_at": "2019-10-10T14:40:56Z",
      "updated_at": "2019-10-10T14:40:56Z"
    },
    {
      "author": "daxian-dbw",
      "author_association": "MEMBER",
      "body": "@Skybeat You can use ANSI encoding by specifying `-Encoding oem`. It uses [`GetOEMCP`](https://docs.microsoft.com/en-us/windows/win32/api/winnls/nf-winnls-getoemcp) to get the current OEM code page identifier for the OS on windows platform. ",
      "created_at": "2019-10-10T17:43:00Z",
      "updated_at": "2019-10-10T17:43:00Z"
    },
    {
      "author": "Skybeat",
      "author_association": "NONE",
      "body": "> @Skybeat You can use ANSI encoding by specifying `-Encoding oem`. It uses [`GetOEMCP`](https://docs.microsoft.com/en-us/windows/win32/api/winnls/nf-winnls-getoemcp) to get the current OEM code page identifier for the OS on windows platform.\r\n\r\nyes but it is still not compatible with WinPS 5.1 an older.\r\n\r\nIn this blog post [https://devblogs.microsoft.com/powershell/the-next-release-of-powershell-powershell-7/](url) from @SteveL-MSFT he was written the follow:\r\n\r\n> This means that Windows PowerShell and PowerShell Core users will be able to use the same version of PowerShell to automate across Windows, Linux, and macOS and on Windows, and PowerShell 7 users will have a very high level of compatibility with Windows PowerShell modules they rely on today.\r\n\r\nSo with the current situation, the statement of @SteveL-MSFT is wrong. \r\nI can run a script where i have `-Encoding default` inside with WinPS5.1 and PS Core but the result is totally different.\r\n\r\nFor example, I have run a script with `-Encoding default` for a long time in WinPS 5.1 and the file what was created via the script was encoded very well in ANSI. This file was hand over to a 3. party application (this application needs the data in ANSI) which imports the data.\r\n\r\nSince I have run the exact same script with PS Core, half of the 45000 employee data sets the 3. party application imported were destroyed and the employee can't work in this application. Thats because of this big bug / issue in PS Core. \r\n\r\nOnce again, don't think only as a developer, think more as end user who use this application maybe since PS 3.0 (in this version the -Encoding default was implemented).\r\n\r\nIn my case, more than 20000 employee base data in the shift planing system was destroyed and my client was very angry. Till i found the issue i takes 1,5 days. In this 1,5 days this more than 20000 employees can't book ther times or request absences and stuff like this.\r\n\r\nFrom my point of view, there must not be such changes in PS Core and these changes contradict the official statements that PS Core is compatible with WinPS.\r\n\r\nMaybe for the developers of Powershell Core it is not a big deal, to change some simple thinks like this, but for the people who use Powershell Core it is a big change and let break the scripts who use stuff like this.\r\n\r\nAnd the more crazy thing for me is why it is so hard for the dev team of PS Core and Microsoft to understand this and why theye can not admit that it was a mistake to make that change and say ok, we'll undo that change.",
      "created_at": "2019-10-10T20:58:03Z",
      "updated_at": "2019-10-11T21:01:37Z"
    },
    {
      "author": "jhoneill",
      "author_association": "NONE",
      "body": "> @PowerShell/powershell-committee discussed this. Despite the pain of `Default` having different meanings on Windows PowerShell and PowerShell Core, we made a deliberate decision to enable cross platform support of PowerShell Core for the broader community. At this point, no further changes are planned to be made.\r\n\r\n@SteveL-MSFT could you clarify what you mean by \"a deliberate decision to enable cross platform support\".  \r\n\r\nNeither the on-line help nor intellisense suggest \"default\". _No one should ever use `-encoding default` in code written for PowerShell 6 or 7,_ so it isn't a cross platform issue, as far as I can see.   \r\n\r\nI get the feeling that @Skybeat  manages systems which aren't running in English, and \"default\" gets the right code page but \"ASCII\" does not, a problem someone working in English doesn't have.   \r\n\r\nThere is one line of code in PowerShell core which seems to be there to ensure that if a script author put ` -encoding \"default\"` in a scripts for PowerShell 3,4,5 it doesn't throw an error don't throw an error, on 6 & 7. But, it appears that the person who put that line in did not understand that \"default\" here didn't mean what it usually means. Form @Skybeat 's point of view that misunderstanding means **New PowerShell = Corrupt Output.** \r\n\r\nDeleting that one line would force anyone using \"default\" to get their national code page to make a change, and changing it as I outlined in a previous post would all @Skybeat  's produced the expected out put. Either this was not clear to committee when it was discussed, or if was the benefit of silently corrupting output if a legacy choice is selected needs a little more explanation.\r\n",
      "created_at": "2019-10-12T18:38:55Z",
      "updated_at": "2019-10-12T18:38:55Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "@jhoneill the original change to Encoding was really to solve several problems:\r\n\r\n1. many cmdlets had their own `-Encoding` parameter which was using a ValidateSet so you had different values that could be used.  The fix here is to have all of them use the actual `[Encoding]` type consistently.\r\n2. the default Encoding for these cmdlets were not consistent.  Fix here is to align with direction of Win10 and also Unix systems which is UTF8NoBOM.\r\n\r\nBoth of these were breaking changes that @PowerShell/powershell-committee discussed at length and agreed for the future of PowerShell, these were the right changes even though there would be some pain points for users transitioning between Windows PowerShell and PowerShell Core.\r\n\r\n",
      "created_at": "2019-10-15T19:13:23Z",
      "updated_at": "2019-10-15T19:13:23Z"
    },
    {
      "author": "Skybeat",
      "author_association": "NONE",
      "body": "> @jhoneill the original change to Encoding was really to solve several problems:\r\n> \r\n> 1. many cmdlets had their own `-Encoding` parameter which was using a ValidateSet so you had different values that could be used.  The fix here is to have all of them use the actual `[Encoding]` type consistently.\r\n> 2. the default Encoding for these cmdlets were not consistent.  Fix here is to align with direction of Win10 and also Unix systems which is UTF8NoBOM.\r\n> \r\n> Both of these were breaking changes that @PowerShell/powershell-committee discussed at length and agreed for the future of PowerShell, these were the right changes even though there would be some pain points for users transitioning between Windows PowerShell and PowerShell Core.\r\n\r\n@SteveL-MSFT \r\nMay be you have done a mistake with the current change in PS Core and the default, because in all online docus (including the official MS docu for Win-Powershell example: [https://docs.microsoft.com/en-us/powershell/module/microsoft.powershell.management/set-content?view=powershell-5.1](url)  )\r\nthe value `default` is documentat as follow: `Default Uses the encoding that corresponds to the system's active code page (usually ANSI).` \r\nwhy did not you just add UTF8NoBOM as a new value and leave the rest as it was?\r\n\r\n>  these were the right changes even though there would be some pain points for users transitioning between Windows PowerShell and PowerShell Core.\r\n\r\nSo you call it \"some pain for users\" when such a useless change destroys millions of data in thousands of systems from thousands of companies at once?\r\nIs such a statement really the new thinking of Microsoft and the Powershell Core development team?\r\nTo make you understand what such rash changes have effects: In my company we have 50 employees, of which half use Powershell for years. Now I have asked my colleagues who uses the code \"Set-Content -Encoding default\" in their scripts. Everyone uses it.\r\nNow imagine the scriptre with such erroneous behavior, e.g. be used in banking or social work.\r\nCould you as a developer really not look over the counter and think of any effects before you start discussing something that is not worth discussing as it has been rooted in Powershell way too long?\r\nHave you ever considered discussing it with end users and listening to it before you know better about making such significant changes?\r\n\r\nSorry if I say so directly but it's a shame how you deal with the end users. You leave them alone with the problem and mistakes that you know and which have been reported to you.\r\nYou come with more and more excuses just to not have to admit a mistake and as always the users have to be this discharge and stand straight for it. Big movie @Microsoft\r\n",
      "created_at": "2019-10-15T20:00:03Z",
      "updated_at": "2019-10-15T20:00:30Z"
    },
    {
      "author": "Skybeat",
      "author_association": "NONE",
      "body": "@all\r\nis there a way to override the incorrect behavior (bug) of `-encoding default` in Powershell core?\r\nI mean not in every script himself, i mean system-wide! ",
      "created_at": "2019-10-15T20:02:29Z",
      "updated_at": "2019-10-15T20:03:50Z"
    },
    {
      "author": "jhoneill",
      "author_association": "NONE",
      "body": "@SteveL-MSFT \r\nOK got it now. \r\n[Encoding] objects don't work with V5 because of the validate sets in use. That needs to be fixed ... but just typing the parameter as [system.text.encoding] won't allow code pages and \"OEM\" which leads to` encodingMap `in the code which gets to the right values but _looks_ wrong.   \r\n\r\n@Skybeat  Posts like that long one don't help. As far as anyone here knows, you are the only person  impacted by this.  You say 25 people in your company use `set-content -encoding default.` If you ask them what it does , how many would say selecting a different code page ? Can any of them can give an example of something which will break if they put ASCII or UTF8 . \r\n When you talk \"about millions of data in thousands of companies\" (which assumes that those companies switch from Windows PowerShell to PowerShell core without testing their scripts first) _but_ no-one else has reported the problem, so it reads like the ranting of a crazy person and instead of helping you people ignore a crazy person. You took a dependency on an old mistake and the fix creates extra work for you (like testing), people should be sympathetic but again, ranting crazy people don't get sympathy. \r\n\r\nto the short post. Yes. you can over-ride it with a proxy function. If the version is >5 replace \"default\" with a code page. Done properly it will generate a warning when it does that so you get told where to check your scripts.\r\n",
      "created_at": "2019-10-15T23:49:30Z",
      "updated_at": "2019-10-15T23:49:30Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "@Skybeat I believe I've been more than responsive to you so please respect our Code of Conduct.",
      "created_at": "2019-10-16T00:27:20Z",
      "updated_at": "2019-10-16T00:27:20Z"
    },
    {
      "author": "vipiny35",
      "author_association": "NONE",
      "body": "> @Skybeat You can use ANSI encoding by specifying `-Encoding oem`. It uses [`GetOEMCP`](https://docs.microsoft.com/en-us/windows/win32/api/winnls/nf-winnls-getoemcp) to get the current OEM code page identifier for the OS on windows platform.\r\n\r\nSetting `-Encoding oem` on Windows 10 machine writes file in utf-8 whereas using `-Encoding utf8` itself doesn't work",
      "created_at": "2020-10-18T14:27:50Z",
      "updated_at": "2020-10-18T14:27:50Z"
    }
  ],
  "created_at": "2019-10-01T07:42:08Z",
  "number": 10658,
  "state": "closed",
  "title": "wrong file Encoding ",
  "updated_at": "2020-10-18T14:27:50Z"
}