{
  "_url": "https://github.com/PowerShell/PowerShell/issues/10779",
  "author": "cessor",
  "body": "Today, when I started powershell, it displayed an advertisement for powershell core. This is not ok. My suggestion is that you don't do that. I am tired of your behavior. I am filing this as a bug, because it is definitely **unexpected behavior**, just like this category suggests. \r\n\r\nThe message shown was this:\r\n\r\n```\r\nWindows PowerShell\r\nCopyright (C) Microsoft Corporation. Alle Rechte vorbehalten.\r\n\r\nLernen Sie das neue plattformübergreifende PowerShell kennen – https://aka.ms/pscore6\r\n```\r\n\r\nStop it. \r\n",
  "closed_at": "2019-10-12T15:58:50Z",
  "comments": [
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "@cessor Please share $PSVersionTable as issue template requests.",
      "created_at": "2019-10-12T15:50:00Z",
      "updated_at": "2019-10-12T15:50:00Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "Windows PowerShell is __frozen__. All new features are added to PowerShell Core only. In near future PowerShell Core will replace Windows PowerShell. MSFT informs customers about the fact so that they have a time to adopt their environment, scripts and applications.",
      "created_at": "2019-10-12T15:53:15Z",
      "updated_at": "2019-10-12T15:56:02Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "@cessor This is by design for Windows PowerShell.  You can use `-nologo` if it bothers you, but the feedback if that most of the PowerShell community isn't even aware of PowerShell Core and this has already seemed to help improve Windows adoption of PSCore.",
      "created_at": "2019-10-12T15:58:50Z",
      "updated_at": "2019-10-12T15:58:50Z"
    },
    {
      "author": "cessor",
      "author_association": "NONE",
      "body": "Thank you for your reply. Yet I still don't understand why arbitrary messages in the shell are justified.\r\n\r\n - I don't know what PSCore is and I don't care. I want to get some work done and could do without the distractions. What gives you the right to decide on what I direct my attention to? \r\n - If the adoption of PSCore is low, how is that suddenly my problem?\r\n - If the adoption of PSCore is low, and it is an 100% equivalent update of my powershell, i.e. it does exactly what PS does without me ever knowing, why do you not just update powershell with the next Windows update, so that I don't even notice?\r\n - The big thing with PSCore seem to be that it is \"platform independent\", i.e. it is available for linux and Mac. Why do you push ads to a Windows shell then? Wouldn't it make more sense to ask Canonical to run the add in the Message of the Day (motd) in Ubuntu Terminals? \r\n - As a developer, I am interested and excited about software, and I am really happy for the changes that the Core mentality brings, but why do I have to care about that everywhere? If Adobe were to implement Lightroom to run with magic pixies in the background, I still wouldn't care as long as it would help me archive my pictures. \r\n\r\nAs for your argument that showing links is justified because it worked: I'd like to see some p-value & effect size on that statement. \r\n\r\nAnd Finally: I am not part of a PS Community, I am was unaware of PowerShell Core, but I sure am aware of it now. Also, I will make sure to use something else instead. Past behavior is the best predictor for future behavior, so I am pretty certain that PSCore will not respect my desire to be left alone; or even my privacy. Let me guess, big \"Telemetry\" comming up to help \"improve\" my \"experience\"?\r\n\r\n",
      "created_at": "2019-10-13T07:42:47Z",
      "updated_at": "2019-10-13T07:44:24Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "@cessor The repo is for PowerShell Core development. The repo is not right place for Windows PowerShell feedback. Please use other channels for your feedback.\r\n\r\nIt is impossible replace Windows PowerShell with PowerShell Core transparently - there are breaking changes and MSFT informs users about this in advance so that they have time to study and prepare for migration.\r\n\r\nPowerShell Core has a telemetry documented in public RFC. Users have clear understanding that the telemetry is and clear instructions how turn on and turn off the telemetry.",
      "created_at": "2019-10-13T11:05:27Z",
      "updated_at": "2019-10-13T11:05:27Z"
    },
    {
      "author": "cessor",
      "author_association": "NONE",
      "body": "Thank you for clarifying.",
      "created_at": "2019-10-13T12:27:14Z",
      "updated_at": "2019-10-13T12:27:14Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "@cessor PSCore isn't just about Linux and macOS, it has substantial improvements for Windows users as well.  Even if you never use PSCore on Windows, by growing the PowerShell community you will have more blogs, modules, scripts that will make you more productive even if you just stay on 5.1 forever.",
      "created_at": "2019-10-14T16:31:37Z",
      "updated_at": "2019-10-14T16:31:37Z"
    },
    {
      "author": "cessor",
      "author_association": "NONE",
      "body": "I am not sure what to say at this point or if I should respond at all, as in the posts above I was informed that GH issues are for development issues only and not for general discussions; Yet the fact that you added to the conversation makes it seem like an invitation for me to respond about things like community, blogs, modules and scripts and my productivity. \r\n\r\nWould you like to discuss this some more or would you just like me to be quiet about the things you find uncomfortable, such as privacy, telemetry, product strategy and encroaching behavior by a major tech company? ",
      "created_at": "2019-10-15T15:23:53Z",
      "updated_at": "2019-10-15T15:25:45Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "I would suggest you join our monthly community call which is this Thursday to discuss this further https://aka.ms/pscommunitycall\n\n<blockquote><img src=\"https://avatars0.githubusercontent.com/u/11524380?s=400&v=4\" width=\"48\" align=\"right\"><div><img src=\"https://github.githubassets.com/favicon.ico\" height=\"14\"> GitHub</div><div><strong><a href=\"https://github.com/PowerShell/PowerShell-RFC\">PowerShell/PowerShell-RFC</a></strong></div><div>RFC (Request for Comments) documents for community feedback on design changes and improvements to PowerShell ecosystem - PowerShell/PowerShell-RFC</div></blockquote>",
      "created_at": "2019-10-15T19:04:34Z",
      "updated_at": "2019-10-15T19:04:37Z"
    },
    {
      "author": "Kein",
      "author_association": "NONE",
      "body": "For the record, PSCore does the same",
      "created_at": "2021-01-07T17:15:43Z",
      "updated_at": "2021-01-07T17:15:43Z"
    },
    {
      "author": "6a6f6a6f",
      "author_association": "NONE",
      "body": "Sorry for reviving this thread, but I don't find anything on the current documentation of PSCore, below the result of `$PSVersionTable`, and how I remove this MOTD from the start of PowerShell core in Windows Terminal?\r\n\r\n```\r\n❯ $PSVersionTable\r\n\r\nName                           Value\r\n----                           -----\r\nPSVersion                      7.1.3\r\nPSEdition                      Core\r\nGitCommitId                    7.1.3\r\nOS                             Microsoft Windows 10.0.19041\r\nPlatform                       Win32NT\r\nPSCompatibleVersions           {1.0, 2.0, 3.0, 4.0…}\r\nPSRemotingProtocolVersion      2.3\r\nSerializationVersion           1.1.0.1\r\nWSManStackVersion              3.0\r\n```  \r\n\r\nWindows Terminal profile configuration:\r\n\r\n```json\r\n{\r\n      \"guid\": \"{574e775e-4f2a-5b96-ac1e-a2962a402336}\",\r\n      \"hidden\": false,\r\n      \"name\": \"PowerShell\",\r\n      \"source\": \"Windows.Terminal.PowershellCore\"\r\n}\r\n``` \r\n\r\n",
      "created_at": "2021-03-31T04:33:45Z",
      "updated_at": "2021-03-31T04:33:45Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "@6a6f6a6f You can set POWERSHELL_UPDATECHECK environment variable. Possible values - Off, LTS, Default.\r\n\r\nhttps://docs.microsoft.com/en-us/powershell/module/microsoft.powershell.core/about/about_update_notifications?view=powershell-7.1",
      "created_at": "2021-03-31T05:44:40Z",
      "updated_at": "2021-03-31T05:45:20Z"
    }
  ],
  "created_at": "2019-10-12T14:52:40Z",
  "number": 10779,
  "state": "closed",
  "title": "Please don't display ads in my shell.",
  "updated_at": "2021-03-31T05:45:20Z"
}