{
  "_url": "https://github.com/PowerShell/PowerShell/issues/10857",
  "author": "Jaykul",
  "body": "Summary of the new feature/enhancement\r\n# PSCredential should support casting from NetworkCredential\r\n\r\n```\r\nAs a PowerShell user\r\nI should be able to automatically convert PSCredential parameter objects to NetworkCredential objects for APIs\r\n\r\nAs a C# cmdlet author\r\nI should be able to cast NetworkCredential objects to PowerShell APIs that take PSCredential\r\n```\r\n\r\nWe should never force workarounds like what I just saw in a code review:\r\n\r\n```posh\r\n    $InstanceInfo = Get-ConnectionInfo -Type Authoring\r\n    # PowerShell isn't .NET compatible, so we have to make their special cred type\r\n    $PSCredential = New-Object System.Management.Automation.PSCredential($InstanceInfo.Credential.UserName, $InstanceInfo.Credential.SecurePassword)\r\n```\r\n\r\nSince NetworkCredential is the de-facto credential class in .NET, having a special class in PowerShell is frustrating. Not being able to cast back and forth when the conversion is obvious seems designed to frustrate users. Although there was a reason once, it's purely legacy and security theatre at this point. Remember:\r\n\r\n1. PowerShell ships a format to hide the NetworkCredential Password property\r\n2. The NetworkCredential class now uses a SecureString for storage\r\n3. In .NET Core the SecureString class doesn't really feel that secure anyway\r\n4. PSCredential's only remaining advantage is it's first-class nature in PowerShell (and the implied Credential attribute for parameters)\r\n\r\n\r\n### Is there any other reason we should not be able to cast _back and forth_ from NetworkCredential to PSCredential? \r\n\r\n# Proposed technical implementation details:\r\n\r\n- For C#:\r\n  - PSCredential to implement implicit cast operators for NetworkCredential\r\n- For PowerShell\r\n  - PSCredential to add a constructor that takes a NetworkCredential\r\n  - Identical handling for NetworkCredential parameters as for PSCredential parameters\r\n  - PSTypeConverters for NetworkCredential and PSCredential so both can be converted to each other, and can serialize _safely_\r\n\r\n",
  "closed_at": null,
  "comments": [
    {
      "author": "joeyaiello",
      "author_association": "CONTRIBUTOR",
      "body": "I'll have to defer to security folks on this one, but from a usability standpoint this makes sense to me. \r\n\r\nA mapping of properties and constructors between types would probably be the next step. Giving a cursory look at the docs ([NetworkCredential](https://docs.microsoft.com/en-us/dotnet/api/system.net.networkcredential.domain?view=netcore-3.0) and [PSCredential](https://docs.microsoft.com/en-us/dotnet/api/system.management.automation.pscredential?view=pscore-6.2.0), we have to figure out things like whether to never populate `Password` (vs. `SecurePassword`), what to do with `Domain`, etc.\r\n\r\nAlso wondering aloud if there are any implications with our secrets management work (/cc @SydneyhSmith @PaulHigin)",
      "created_at": "2019-10-22T00:03:24Z",
      "updated_at": "2019-10-22T00:03:24Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "If we support casting from `NetworkCredential`, it should have no impact on the Secrets Management module unless there is a need to support that type natively.  `Domain` is pretty straight forward to figure out and there might be some apis that do that already.  `Password` gets auto-populated by the NetworkCredential constructor even if you pass in a SecureString.",
      "created_at": "2019-10-22T00:18:44Z",
      "updated_at": "2019-10-22T00:18:44Z"
    },
    {
      "author": "PaulHigin",
      "author_association": "COLLABORATOR",
      "body": "At first look, I don't see any security issues with converting between NetworkCredential and PSCredential types.  And I agree that this shouldn't affect SecretsManagement module work.",
      "created_at": "2019-10-22T20:25:12Z",
      "updated_at": "2019-10-22T20:25:12Z"
    }
  ],
  "created_at": "2019-10-21T21:43:29Z",
  "number": 10857,
  "state": "open",
  "title": "Can we add a cast constructor to PSCredential for NetworkCredential?",
  "updated_at": "2019-10-22T20:25:12Z"
}