{
  "_url": "https://github.com/PowerShell/PowerShell/issues/10892",
  "author": "bergmeister",
  "body": "# Summary of the new feature/enhancement\r\n\r\n- As a user of the MSIX package I want to have an easy way of adding the explorer context menu that the MSI currently offers. MSIX does not support custom registry keys, therefore cmdlets seem to be a natural way for this, similar to the `Enable-PSRemoting` cmdlet.\r\n\r\n- As a user of the MSI, I want to remove/add the context menu post-installation dynamically to my liking or cleanup leftover keys from old previews that might have been left-over due to an upgrade.\r\n\r\nI don't have time for this right now but might consider this at some point in the future.\r\n\r\ncc @SteveL-MSFT \r\n\r\n# Technical implementation\r\n\r\n2 cmdlets:\r\n\r\n- `New-PowerShellExplorerContextMenu`\r\n- `Remove-PowerShellExplorerContextMenu`\r\n\r\nThey probably need to have an optional version and preview/rtm parameter in case someone wants to remove/add the context menu for an older version as there have been some issues with past MSI previews upgrades. The MSI should probably start using them as well (depending on how complex custom actions in upgrade or uninstall is)",
  "closed_at": null,
  "comments": [
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "Would we want to generalize this to allow future extensibility?  Perhaps `Get/Set-ShellExtension` (need a better noun as Shell can be confusing, but don't want it specific to Windows either).",
      "created_at": "2019-10-25T17:44:07Z",
      "updated_at": "2019-10-25T17:44:07Z"
    },
    {
      "author": "bergmeister",
      "author_association": "CONTRIBUTOR",
      "body": "If we did a generic one (no strong opinion on pros/cons except that it would result in more maintenance and might become more complex in the future), then Id think the proper place would be a module of its own on the `PSGallery`. In this case, would you be happy to ship such a module by default similar to PSReadline? Why do you don't want it to be specific to Windows, the Windows shell system is pretty unique with no equivalent in other OSs or areas of the OS.",
      "created_at": "2019-10-25T17:52:52Z",
      "updated_at": "2019-10-25T17:56:35Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "@PowerShell/powershell-committee reviewed this, we suggest starting this as a separate module to validate the design and get user feedback",
      "created_at": "2019-12-04T23:30:40Z",
      "updated_at": "2019-12-04T23:30:40Z"
    }
  ],
  "created_at": "2019-10-25T17:26:07Z",
  "labels": [
    "Issue-Enhancement",
    "Committee-Reviewed"
  ],
  "number": 10892,
  "state": "open",
  "title": "Feature Request: Cmdlets to add/remove explorer context menu (MSIX does not support custom registry keys)",
  "updated_at": "2020-12-07T19:08:17Z"
}