{
  "_url": "https://github.com/PowerShell/PowerShell/issues/10958",
  "author": "SteveL-MSFT",
  "body": "# Summary of the new feature/enhancement\r\n\r\nCurrently, the module manifest is strictly validated with exception of the PrivateData section.  This makes potentially adding new capabilities impossible other than stuffing everything into PrivateData.  Proposal is to make it loose validating and ignore anything it doesn't understand in that version.",
  "closed_at": "2019-11-14T00:51:10Z",
  "comments": [
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "If we don't strictly check PrivateData why should we do strong check for other manifest parts?\r\nWe will need to enhance Test-ModuleManifest.",
      "created_at": "2019-11-01T10:44:24Z",
      "updated_at": "2019-11-01T10:44:24Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "The strict validation is something that's always been there to enforce backwards compatibility.  When PrivateData was introduced (as a trapdoor for strict validation), that was special cased for forward compatibility.",
      "created_at": "2019-11-06T18:11:27Z",
      "updated_at": "2019-11-06T18:11:27Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "@PowerShell/powershell-committee reviewed this and believe that PrivateData is sufficient and given the minimal changes in module manifest in the past, it's unlikely we would accept any changes in the future that necessitate loose validation.",
      "created_at": "2019-11-14T00:51:10Z",
      "updated_at": "2019-11-14T00:51:10Z"
    },
    {
      "author": "KirkMunro",
      "author_association": "CONTRIBUTOR",
      "body": "I just saw the notification about the original issue posted here, and came in to say that it's about time, but then I read that it's already been discarded as unnecessary. Ugh.\r\n\r\nGive me a clean, forward thinking break with `psd2` files already and be done with the duck taped `psd1` file format. Plus, hello, `PowerShellVersion` is checked first in recent versions of PS, so this could be moved forward with `psd1` files.\r\n\r\nThe current mandate to leave `psd1` files in legacy mode for backward compatibility and discard any possible enhancements to make them better, with the argument that `psm1` files can be used to deal with the extra stuff is really getting old. `psm1` files should only be necessary for scenarios when a manifest can't describe a module in a declarative way, which they should be able to do for binary modules and modules composed of a bunch of `ps1` files most of the time.",
      "created_at": "2019-11-14T02:51:28Z",
      "updated_at": "2019-11-14T02:51:28Z"
    }
  ],
  "created_at": "2019-10-31T20:33:31Z",
  "labels": [
    "Issue-Enhancement",
    "Resolution-Won't Fix",
    "Committee-Reviewed",
    "WG-Cmdlets-Core"
  ],
  "number": 10958,
  "state": "closed",
  "title": "Make Module Manifest loose validating",
  "updated_at": "2019-11-20T05:12:16Z"
}