{
  "_url": "https://github.com/PowerShell/PowerShell/issues/11107",
  "author": "harshnagarkar",
  "body": "# Summary \r\n\r\nBy this feature, users get to see color in their command outputs such as git init.\r\nA user should be able to set the colors using commands or script theme packs they have written.\r\nAn example can be to let all my file paths be shown with a green color.\r\n\r\n# Proposed technical implementation details (optional)\r\nI don't know much about the implementation, but I know you can color text in PowerShell for output now we have to come up with a user-friendly way to set the commands for certain types. Like 'ls' commands show directories in blue and files in red.\r\n",
  "closed_at": "2019-11-22T05:08:49Z",
  "comments": [
    {
      "author": "rkeithhill",
      "author_association": "COLLABORATOR",
      "body": "Have a look at the `DirColors` module in the PowerShell Gallery.",
      "created_at": "2019-11-18T22:45:00Z",
      "updated_at": "2019-11-18T22:45:00Z"
    },
    {
      "author": "jhoneill",
      "author_association": "NONE",
      "body": "On cmd or wsl git init doesn't output in color . In Powershell Git status (for example) works in colour. \r\n\r\nthere are plenty of ways to add color. Most seem like a good idea only the to people implementing them at the time.  Because the console host does colour with escape sequences redirecting to a file or the clipboard doesn't give \"clean\" output but something \"polluted\" with escape sequences.  So for every person you please by making files a different color you've annoyed 2 others, one who actively wants monochrome (or at least no escape sequences) and one who doesn't mind color in principle but objects to the chosen color scheme. \r\n",
      "created_at": "2019-11-18T23:20:26Z",
      "updated_at": "2019-11-18T23:20:26Z"
    },
    {
      "author": "harshnagarkar",
      "author_association": "NONE",
      "body": "@rkeithhill Got it.\r\n@jhoneill  I get the point you are talking about. \r\nGuys lets say I want to build a color pack(a script people can download and install the theme in Powershell) How can I do so after. I get I have to probably look into modules like DirColors.\r\nWhat all I need to know to make it work?   \r\n",
      "created_at": "2019-11-19T07:00:29Z",
      "updated_at": "2019-11-19T07:00:29Z"
    },
    {
      "author": "jhoneill",
      "author_association": "NONE",
      "body": "@harshnagarkar  - the thing to look at is format.xml files - in Windows PowerShell all the formatting is in those, in PowerShell core they are compiled into DLLs, so it isn't quite so easy to see them, but you can change the format to pretty much anything you want. That means if you have an accessibility issue, you can engineer your own to suit your needs. If you have strong aesthetic tastes you do something which pleases you. \r\nGenerally things should be always be able to be overridden by those files. ",
      "created_at": "2019-11-19T07:56:20Z",
      "updated_at": "2019-11-19T07:56:20Z"
    },
    {
      "author": "harshnagarkar",
      "author_association": "NONE",
      "body": "Got it Will do. If I need help I will reopen this ticket.\r\nThanks, guys. @jhoneill @rkeithhill ",
      "created_at": "2019-11-22T05:08:49Z",
      "updated_at": "2019-11-22T05:08:49Z"
    }
  ],
  "created_at": "2019-11-18T22:40:19Z",
  "number": 11107,
  "state": "closed",
  "title": "Feature Request Make power shell commands colorful",
  "updated_at": "2019-11-22T05:08:50Z"
}