{
  "_url": "https://github.com/PowerShell/PowerShell/issues/11211",
  "author": "mazhar10",
  "body": "I am using PS core SDK 6.2.3.\r\n\r\nI have a PS script that has an \"import-module psmod1.psm1\" statement.\r\n\r\nInside the PS script, I do a get-module and then write the names of all the loaded modules to a text file.\r\n\r\nThe script runs fine when run from pwsh on the CLI, and I see psmod1.psm1 written to the text file\r\n\r\nI am invoking the script from within a .NET CORE C# application. This time the script runs fine but no module names get written to the text file (I am writing some other text to ensure the file itself is being successfully written to etc. and all that works fine).\r\n\r\nSo, since import-module inside the PS script did not appear to be working, I then added loading of the module to the C# code. This was done by using InitialSessionsState.CreateDefault() and then using ImportPSModule.\r\n\r\nI still get the same results, it seems that for PS code invoked from within C# via RunSpaceFactory.CreateRunspace, it is impossible to import modules, either within the PS code file or from within C#. I have tested this on Windows 2008R2 as well as Windows 2012R2.\r\n\r\n",
  "closed_at": "2021-03-01T19:09:21Z",
  "comments": [
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "@mazhar10 To get a help you could create/share a GitHub project.",
      "created_at": "2019-11-28T17:14:15Z",
      "updated_at": "2019-11-28T17:14:15Z"
    },
    {
      "author": "mazhar10",
      "author_association": "NONE",
      "body": "I changed the code in C# to use PowerShell.Create instead of CreatePipeline(), read the PS file into a C# string and fed it to the powershell instance via AddScript, now the import-module statement **inside** the PS code works fine.\r\n\r\nI can live with this though this is a big pain as all the paths etc. are now different and I have to account for that.\r\n\r\nI still have no idea while using PowerShell.Create from C# honors import-module inside of PS while using CreatePipeline() from C# does not honor import-module inside of PS - I mean the import-module is inside the PS code, why would the method of invocation either make it fail silently or succeed?",
      "created_at": "2019-11-28T20:02:41Z",
      "updated_at": "2019-11-28T20:04:48Z"
    },
    {
      "author": "JamesWTruher",
      "author_association": "MEMBER",
      "body": "Please be sure that that the module is either available via full path or ensure that `$env:PSModulePath` includes the directory to your module. The PSModulePath for hosted app is likely different than that of the console app, which can be the cause of this issue. Also check `PowerShell.Streams` properties to retrieve any errors which may occur in the invocation.",
      "created_at": "2021-03-01T19:09:21Z",
      "updated_at": "2021-03-01T19:09:21Z"
    }
  ],
  "created_at": "2019-11-28T16:42:51Z",
  "labels": [
    "Issue-Question",
    "Resolution-Answered",
    "WG-DevEx-SDK"
  ],
  "number": 11211,
  "state": "closed",
  "title": "PS SDK 6.2.3 ImportPSModule does nothing",
  "updated_at": "2021-03-01T19:09:21Z"
}