{
  "_url": "https://github.com/PowerShell/PowerShell/issues/11330",
  "author": "mklement0",
  "body": "Currently, whatever the script block passed to an `ArgumentCompleterAttribute` outputs is placed _as-is, unquoted_ on the command line during tab completion.\r\n\r\nFor simple tokens without embedded whitespace or any other shell metacharacters that works fine, but returning strings such as `` System.Collections.Generic.List`1 `` or `yes & no` results in a malfunctioning or broken command.\r\n\r\nThe returned string should instead be quoted - either with enclosing single quotes \r\n(``'System.Collections.Generic.List`1'`` or `'yes & no'`) or with character-individual escapes\r\n(``` System.Collections.Generic.List``1 ``` or ``yes` `& `no``)\r\n\r\nNote: Technically, this is a breaking change; code may exist  that works around the current problem by using embedded quoting as part of the string returned.\r\n\r\n# Steps to reproduce\r\n\r\n```powershell\r\nfunction foo {\r\n  param(\r\n    [ArgumentCompleter( {\r\n        param($cmd, $param, $wordToComplete)\r\n        'a`b', 'a b' -like \"*$wordToComplete*\"\r\n      })]\r\n    [string] $Bar\r\n  )\r\n}\r\n\r\n# Invoke foo\r\nfoo a<tab>\r\n```\r\n\r\n# Expected behavior\r\n\r\nPressing <kbd>tab</kbd> should cycle through placing ``'a`b'`` and `'a b'`  - note the enclosing quotes - or ```a``b``` and ``a` b`` on the command line.\r\n\r\n# Actual behavior\r\n\r\n_Unquoted_ ``a`b`` and `a b` are placed on the command line, which would break the command on submission.\r\n\r\n# Environment data\r\n\r\n```none\r\nPowerShell Core 7.0.0-preview.6\r\n```\r\n",
  "closed_at": null,
  "comments": [
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "Maybe the completer should care about quoting?",
      "created_at": "2019-12-12T15:00:20Z",
      "updated_at": "2019-12-12T15:00:20Z"
    },
    {
      "author": "mklement0",
      "author_association": "CONTRIBUTOR",
      "body": "That's what you currently have to do, @iSazonov, but the point of the issue is that you shouldn't have to:\r\n\r\nHaving to do so yourself:\r\n\r\n* offers no benefit: there's never a case where you'd want something that is _not_ syntactically valid placed on the command line.\r\n\r\n* is therefore only an unnecessary burden that is easy to forget and get wrong (who knows off the top of their head the complete set of all argument-mode metacharacters?).\r\n\r\n",
      "created_at": "2019-12-12T15:19:00Z",
      "updated_at": "2019-12-12T15:19:00Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "> who knows off the top of their head the complete set of all argument-mode metacharacters?\r\n\r\nI thought this is implied that completer author does quoting if nessesary because the completer returns a _result_, not a _workpiece_.\r\n",
      "created_at": "2019-12-12T16:30:18Z",
      "updated_at": "2019-12-12T16:30:18Z"
    },
    {
      "author": "mklement0",
      "author_association": "CONTRIBUTOR",
      "body": "I don't know that you mean by _workpiece_, but there's only one sensible way to use the result returned by the completer: to use it as a syntactically valid argument on the command line being typed.\r\n\r\nPowerShell knows what constitutes a syntactically valid argument and can easily transform what the completer script block returns into one. \r\n\r\nAs I said, there's zero benefit to putting the burden of satisfying external syntax requirements on the author of the script block. All the script block author should need to think about  is constructing the _verbatim_ value to return, and let PowerShell handle its quoting, if and as necessary.\r\n",
      "created_at": "2019-12-12T16:49:55Z",
      "updated_at": "2019-12-12T16:50:25Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": ">  if and as necessary\r\n\r\nMy concern is just about this - can PowerShell be always so smart? Will the same completer work right for Path and LiteralPath parameters for example?",
      "created_at": "2019-12-12T16:57:02Z",
      "updated_at": "2019-12-12T16:57:02Z"
    },
    {
      "author": "mklement0",
      "author_association": "CONTRIBUTOR",
      "body": "An argument completer is a _resolver_ of sorts: what it returns should always be treated as a _literal_ from a _parsing_ perspective.\r\n\r\nIf someone writes a completer for an argument that requires parameter-specific  _embedded_ escaping - such as the `` ` `` chars. you must _embed_ in wildcard expressions to treat metacharacters such as `[` as literals, for instance, than that is indeed the script-block author's responsibility - but that doesn't conflict with what I'm proposing here.\r\n\r\n",
      "created_at": "2019-12-12T17:10:40Z",
      "updated_at": "2019-12-12T17:11:15Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "Currently you also have to care about if the user provides a partial string that begins with a quotation mark as well.\r\n\r\nIdeally, quoting etc should be completely hidden from a completely; its job is to provide results. It should be the supporting framework making sure that the returned results can actually be used by the command parser.",
      "created_at": "2019-12-12T17:34:37Z",
      "updated_at": "2019-12-12T17:34:37Z"
    },
    {
      "author": "bpayette",
      "author_association": "CONTRIBUTOR",
      "body": "@mklement0 Always quoting the result would mean that the *only* thing you could return is a string. Returning a scriptblock, for example, would not work. Or a cmdlet call e.g. `\"(Get-Date)\". The completer returns text that is *parsed* as arbitrary code by PowerShell. This is very powerful.",
      "created_at": "2019-12-12T18:59:39Z",
      "updated_at": "2019-12-12T18:59:39Z"
    },
    {
      "author": "lzybkr",
      "author_association": "MEMBER",
      "body": "I think it's rare that one wants non-string values when completing parameter values and I think it would be useful to quote automatically.\r\n\r\nI provide a helper in `TabExpansionPlusPlus` for exactly this purpose, see https://github.com/lzybkr/TabExpansionPlusPlus/blob/deea6b96fcfb290f98da44104336f27d0be68fed/TabExpansionPlusPlus.psm1#L64\n\n<blockquote><img src=\"https://avatars3.githubusercontent.com/u/2148248?s=400&v=4\" width=\"48\" align=\"right\"><div><img src=\"https://github.githubassets.com/favicon.ico\" height=\"14\"> GitHub</div><div><strong><a href=\"https://github.com/lzybkr/TabExpansionPlusPlus\">lzybkr/TabExpansionPlusPlus</a></strong></div><div>A V3 PowerShell module to improve tab expansion and Intellisense - lzybkr/TabExpansionPlusPlus</div></blockquote>",
      "created_at": "2019-12-12T19:02:45Z",
      "updated_at": "2019-12-12T19:02:48Z"
    },
    {
      "author": "jhoneill",
      "author_association": "NONE",
      "body": "I having written dozens of completers myself since @lzybkr  provided TabExpansion++ for V3. (later using Register-ArgumentCompleter and then using classes). \r\nBreaking a decade's worth of completers would be a problem, but well written completers DON'T return strings, but `CompletionResult` object and the example relies on a string being converted to one automatically.  \r\nAn **extra constructor** for completion results which took a string and a boolean for \"auto quote\" would make life easier for people writing completers properly, (`[`CompletionResult`]::new($string)` **can't change current behavior**)  but that doesn't solve the specific case here. \r\n\r\nLogic which says when converting from a string (and no other type) AND the string isn't already wrapped in quotes AND it contains a space or  ' ;  # etc it should be wrapped - that would work. I think it is possible to identify classes of strings which would break, and fixing something which pulls up a list of surnames and breaks the command line because author never allowed for O'Neill (to make this personal) might be a good thing. \r\nIt would break completers which use a string to provide a set of value, eg `select` expands to \"First\", \"First, last\" ,\"First, Last, Address\", \"First, Age\" etc   but I don't think that is common.  Completers are sufficiently valuable (in my view) that if a change led to more being written, at the cost of breaking this [mis]use case, that might be acceptable. \r\n",
      "created_at": "2019-12-13T10:24:17Z",
      "updated_at": "2019-12-13T10:24:17Z"
    },
    {
      "author": "mklement0",
      "author_association": "CONTRIBUTOR",
      "body": "Automatic on-demand quoting _unless embedded enclosing quoting is present_ sounds like a good approach to making the behavior useful for the typical use case while breaking only exotic edge cases - which would make this change fall into [bucket 3: Unlikely Grey Area](https://github.com/PowerShell/PowerShell/blob/master/docs/dev-process/breaking-change-contract.md#bucket-3-unlikely-grey-area).\r\n\r\nI think it should similarly be acceptable to change how the  _incoming_ token is passed (which @vexx32 mentioned), so that the user having typed something like `'foo'`, `\"foo\"`, `'foo` or `\"foo` (verbatim) at the time of pressing <kbd>tab</kbd> should be passed as just `foo` to the `$wordToComplete` parameter.\r\n\r\nI don't know enough about the internals, but to accommodate the case where you really want the freedom to receive and return any token _as-is_ (to accommodate @bpayette's example of `(Get-Date)`, for instance), it would make sense to offer a new Boolean _property_, say `Raw`, on the `ArgumentCompleter` class (not as a new constructor parameter for `CompletionResult`), as well as a `-RawProcessing` switch for `Register-ArgumentCompleter`.\r\n",
      "created_at": "2019-12-13T13:47:49Z",
      "updated_at": "2019-12-13T13:47:49Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "I hit this in my [new module](https://github.com/SteveL-MSFT/NetConfiguration/blob/master/NetConfiguration/NetConfiguration.psm1#L29-L45).  Pretty annoying that everyone needs to handle quoting.  We shouldn't break compatibility by doing it automatically, but I think some helper functions would be sufficient.",
      "created_at": "2020-09-26T19:29:33Z",
      "updated_at": "2020-09-26T19:29:33Z"
    },
    {
      "author": "lzybkr",
      "author_association": "MEMBER",
      "body": "@SteveL-MSFT - If a completer returns a `CompletionResult`, I think PowerShell can safely handle quoting automatically because the engine knows the context of the completion, e.g. a parameter value or command name.\r\n\r\nIf it returns a string, then I agree there are corner cases where you could not safely add quotes automatically.",
      "created_at": "2020-09-28T18:21:51Z",
      "updated_at": "2020-09-28T18:21:51Z"
    }
  ],
  "created_at": "2019-12-12T13:20:17Z",
  "number": 11330,
  "state": "open",
  "title": "ArgumentCompleter  script-block output is always placed unquoted on the command line",
  "updated_at": "2020-09-28T18:21:51Z"
}