{
  "_url": "https://github.com/PowerShell/PowerShell/issues/11376",
  "author": "DarwinJS",
  "body": "@TravisEz13 - when I run the 7.0.0-rc.1 MSI manually on a system that contains both 6.2.3 and 7.0 preview, it targets the 7.0 preview folder for upgrade, not the 6 folder.\r\n\r\nThis suggests you want it to stay in the preview distribution channel.\r\n\r\nCan you please clarify which chocolatey packages sequences should have 7.0.0-rc.1 queued up as the next release?\r\n\r\n1. PowerShell-preview (as a visible package since everything in it is of a pre-production nature)\r\n2. PowerShell-Core (as a non-visible, prerelease package - would happen automatically due to \"-rc\" in version number).  Would require \"-pre\" switch to see or install from this feed.\r\n\r\nMy concern about #2 is that it won't actually replace the 6 version, so does not function as a true prerelease.\r\n\r\nAlso would it please be possible to have the production release be \"7.0.1.0\" ?  This clears us of all semantic prerelease / chocolatey version weirdness if it can be done - because in both systems it is greater than all other version numbers that predate it on both the preview and production channel.",
  "closed_at": "2019-12-19T03:07:25Z",
  "comments": [
    {
      "author": "DarwinJS",
      "author_association": "CONTRIBUTOR",
      "body": "Releasing as 7.0.1.0 on Powershell-preview since it upgrades the preview folder.  Will also be visible this way and not require the -pre switch.",
      "created_at": "2019-12-19T03:07:25Z",
      "updated_at": "2019-12-19T03:07:25Z"
    },
    {
      "author": "TravisEz13",
      "author_association": "MEMBER",
      "body": "Darwin, I've been sick.  Everything with a `-` in the version is in the `preview` channel.",
      "created_at": "2020-01-08T00:59:49Z",
      "updated_at": "2020-01-08T00:59:49Z"
    }
  ],
  "created_at": "2019-12-17T11:47:58Z",
  "number": 11376,
  "state": "closed",
  "title": "What is the Target for 7.0.0-rc.1 and final release version number.",
  "updated_at": "2020-01-08T00:59:49Z"
}