{
  "_url": "https://github.com/PowerShell/PowerShell/issues/11374",
  "author": "rhertzog",
  "body": "Someone reported to us (Kali) that Enter-PSSession is not working (see https://bugs.kali.org/view.php?id=5915) but we are only installing the package that you provide. From a quick search it looks like that the Debian package that you build should be modified to \"Depends\" (or \"Recommends\" if you want it optional) on the \"gss-ntlmssp\" package that provides the required NTLM support (through a plugin) to libgssapi-krb5-2 which you are already depending on.\r\n\r\nFWIW, this is related to https://github.com/PowerShell/PowerShell/issues/6647 but I wanted to highlight the fact that the Debian package should be modified, whereas the current solution was to modify the docker image to add the missing package. By adding the dependency on the package itself, it would automatically fix all use cases.",
  "closed_at": "2020-08-20T20:38:20Z",
  "comments": [
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "/cc @TravisEz13 Could you please look the proposal?",
      "created_at": "2019-12-17T16:45:27Z",
      "updated_at": "2019-12-17T16:45:27Z"
    },
    {
      "author": "TravisEz13",
      "author_association": "MEMBER",
      "body": "I would not recommend installing this.  cc @SteveL-MSFT What are your thoughts?",
      "created_at": "2020-01-07T20:23:04Z",
      "updated_at": "2020-01-07T20:23:04Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "My concern is that we don't have test coverage for this and including it implies we've validated it and support it.",
      "created_at": "2020-01-07T20:28:53Z",
      "updated_at": "2020-01-07T20:28:53Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "Maybe add a unsupported note to Linux PowerShell installation docs? It is common for such Linux users to use special configurations.\r\n",
      "created_at": "2020-01-08T07:01:34Z",
      "updated_at": "2020-01-08T07:01:34Z"
    },
    {
      "author": "rhertzog",
      "author_association": "NONE",
      "body": "You do realize that you ship that package in some of the docker images that you provide?\r\n\r\nFor example for centos, this got merged: https://github.com/PowerShell/PowerShell-Docker/pull/125\r\n\r\nIt seems really strange to have different standards for various distributions. Also the lack of test coverage can be tracked in a separate issue/request, it seems weird to require someone to write functional tests to get this one-line patch merged (since adding a dependency is really trivial).",
      "created_at": "2020-01-08T08:12:48Z",
      "updated_at": "2020-01-08T08:12:48Z"
    },
    {
      "author": "TravisEz13",
      "author_association": "MEMBER",
      "body": "Users can manually install the package.  We don't recommend installing NTLM on non-Windows\r\n\r\nThe package being included in docker is an independent decision.",
      "created_at": "2020-08-20T19:25:50Z",
      "updated_at": "2020-08-20T19:25:50Z"
    }
  ],
  "created_at": "2019-12-17T09:17:57Z",
  "number": 11374,
  "state": "closed",
  "title": "Please add gss-ntlmssp as Recommends to the powershell debian package",
  "updated_at": "2020-08-20T20:38:20Z"
}