{
  "_url": "https://github.com/PowerShell/PowerShell/issues/11490",
  "author": "p0W3RH311",
  "body": "static method join have a startIndex and count its possible to have the same in join operator\r\n\r\n\r\n```\r\nPS C:\\> [string]::Join\r\n\r\nOverloadDefinitions                                                                                         \r\n-------------------                                                                                         \r\n              \r\nstatic string Join(string separator, string[] value, int startIndex, int count)      \r\n```                       \r\n\r\nexample\r\n\r\n```\r\n$s = 1..9\r\n$s -join '.',2,5\r\n# 3.4.5.6.7\r\n```",
  "closed_at": null,
  "comments": [
    {
      "author": "bpayette",
      "author_association": "CONTRIBUTOR",
      "body": "Putting extra stuff on the ends of an operation argument is not very intuitive (For example, I know extra options exist for `-match` and `-replace` by I still have to look them up.) Also be aware that `-join` has a unary form that joins all of the arguments to the right\r\n```powershell\r\n-join \"a\",\"b\",\"c\"\r\n```\r\nand actually so does the binary form:\r\n```powershell\r\n $s -join \"a\",\"b\",\"c\"\r\n1a b c2a b c3a b c4a b c5a b c6a b c7a b c8a b c9\r\n```\r\nso this would be a breaking change all up.",
      "created_at": "2020-01-06T19:03:00Z",
      "updated_at": "2020-01-06T19:03:00Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "@bpayette I don't think the binary form allows multiple RHS arguments. What I think you're seeing there is the array `\"a\", \"b\", \"c\"` being joined on `$OFS` (default: space) and used as a string rather than multiple arguments.",
      "created_at": "2020-01-06T21:09:01Z",
      "updated_at": "2020-01-06T21:12:01Z"
    },
    {
      "author": "SeeminglyScience",
      "author_association": "COLLABORATOR",
      "body": "I don't think this makes sense for PowerShell.  The method overload makes sense for optimization, you don't really want create a whole new array just to pass as an argument.  PowerShell generally doesn't care much about that, and if you really need that level of optimization then the method is available to you.\r\n\r\nInstead, this currently works and for the majority of cases would be preferable imo:\r\n\r\n```powershell\r\n$s[2..7] -join '.'\r\n```\r\n\r\nYeah it gets a lot more obtuse when the length is dynamic, but I think it would make more sense to improve that syntax than to add index/length to the operator.  I believe there is an issue/RFC open somewhere about making slicing with the range operator easier.",
      "created_at": "2020-01-07T12:56:39Z",
      "updated_at": "2020-01-07T12:56:39Z"
    },
    {
      "author": "BrucePay",
      "author_association": "COLLABORATOR",
      "body": "@vexx32 \r\n> array \"a\", \"b\", \"c\" being joined on $OFS (default: space) and used as a string rather than multiple arguments.\r\n\r\nThat's how \"multiple\" arguments to a binary operator works.  There is no special syntactic support. The operator just receives left and right operands. It's then up to the operator implementation to interpret those arguments.  For example, the `-replace` operator checks to see if its RHS is a non-string  `IEnumerable` and if it is, parses it as a value + replacement string:\r\n```powershell\r\n{master}PSCore (1:103) >  \"abcd\" -replace \"[ac]\",\"|\"\r\n|b|d\r\n{master}PSCore (1:104) >  $a = \"[ac]\",\"|\"\r\n{master}PSCore (1:105) >   \"abcd\" -replace $a\r\n|b|d\r\n```\r\nGoing back to the issue at hand, `-join` already has defined behaviour if the RHS is an `IEnumerable` so adding any interpretation to those values would be a breaking change.",
      "created_at": "2020-01-07T22:47:42Z",
      "updated_at": "2020-01-07T22:47:42Z"
    }
  ],
  "created_at": "2020-01-04T17:36:28Z",
  "number": 11490,
  "state": "open",
  "title": "join operator with startIndex and count",
  "updated_at": "2020-01-07T22:47:42Z"
}