{
  "_url": "https://github.com/PowerShell/PowerShell/issues/11556",
  "author": "doctordns",
  "body": "In RC1, if you load a module via the compatibility feature (eg ServerManager), then the display XML is not also loaded. That means when objects are returned they are not formatted properly.\r\n\r\nFor example,, if you load the server manager module to get installed features, the output is like this in RC1:\r\n\r\n```powershell\r\nPS C:\\Foo> get-windowsfeature powershell\r\nDisplay Name                                  Name                       Install State\r\n------------                                  ----                       -------------\r\n                                              PowerShell                     Installed\r\n```\r\nIn Windows PowerShell the output looks like this:\r\n\r\n```powershell\r\nPS C:\\Foo> get-windowsfeature powershell\r\nDisplay Name                                  Name                       Install State\r\n------------                                  ----                       -------------\r\n    [X] Windows PowerShell 5.1                PowerShell                     Installed\r\n```\r\n\r\nWhat should be happening is th at the display XML in the module should be imported into the current session.  If you manually update the format data doign the following then output is as expected:\r\n````powershell\r\nUpdate-FormatData -PrependPath C:\\Windows\\system32\\WindowsPowerShell\\v1.0\\Modules\\ServerManager\\Feature.format.ps1xml\r\n````\r\n\r\n# Steps to reproduce\r\n\r\nTo repo - just load non-compatibile module and observe the objects returned as in the case noted abvove. \r\n\r\n# Expected behavior\r\n\r\nI expected output to be consistent with Windows PowerShell 5.1\r\n\r\n# Actual behaviour\r\n\r\nThe objects returned are formatted using default formatting rules not the formatting XML that is included in the module.\r\n\r\n# Environment data\r\n\r\n<!-- provide the output of $PSVersionTable -->\r\n\r\n```none\r\n\r\n```\r\n",
  "closed_at": null,
  "comments": [
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "/cc @anmenaga for information.",
      "created_at": "2020-01-11T16:47:54Z",
      "updated_at": "2020-01-11T16:47:54Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "@anmenaga Is ServerManager compatible with WinPS Compatible feature?",
      "created_at": "2020-02-01T14:00:52Z",
      "updated_at": "2020-02-01T14:00:52Z"
    },
    {
      "author": "doctordns",
      "author_association": "COLLABORATOR",
      "body": "I use Server Manager extensively to install and remove windows feature. The module works just fine in terms of adding, getting, and removing  WIn features. \r\n\r\nWhat does not work is that the display XML is not imported into the parent PS 7 session. I can get around that by manually updating format data and pointing to the display XML file. \r\n\r\nI suggest that if display XML does exist, then when WIncompat loading is done, Import-Module should update the underlying display XML into the PWSH 7 session.",
      "created_at": "2020-02-07T09:58:02Z",
      "updated_at": "2020-02-14T17:29:18Z"
    }
  ],
  "created_at": "2020-01-11T16:34:27Z",
  "labels": [
    "Issue-Question",
    "WG-Engine"
  ],
  "number": 11556,
  "state": "open",
  "title": "FormatXML not loaded when loading Older Modules (Using the compatibility feature)",
  "updated_at": "2020-02-14T17:29:18Z"
}