{
  "_url": "https://github.com/PowerShell/PowerShell/issues/11567",
  "author": "sba923",
  "body": "Typical PowerShell script output (especially when debugging, using the various output streams...) is \"usefully colorized.\"\r\n\r\nAlas, `Start-Transcript` only captures a non-formatted, \"monochrome\" version of the output.\r\n\r\nIt would be great IMVHO to have the option of generating formatted (RTF and/or HTML) output preserving the colors.\r\n\r\nAs an example, [MobaXterm](https://mobaxterm.mobatek.net/) saves terminal output as RTF, preserving the colors of the emulated terminal's output.\r\n",
  "closed_at": null,
  "comments": [
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "I guess the question is whether you actually want to retain color (which would be ANSI escape sequences) or really just want an easier way to view transcripts?  For example, `Get-Content` could have a transcript mode that colorizes strings starting with `DEBUG:`, `VERBOSE:` etc....  Or `ConvertTo-Html` could also have special logic to understand transcripts and output color.\r\n\r\nTranscription currently makes an effort to not preserve color and I'm not sure if preserving the ANSI escape sequences really solves your specific problem as they would only be useful viewed in a terminal that understands ANSI.",
      "created_at": "2020-12-05T00:16:03Z",
      "updated_at": "2020-12-05T00:16:03Z"
    },
    {
      "author": "kilasuit",
      "author_association": "COLLABORATOR",
      "body": "@SteveL-MSFT perhaps it's time to spit out a Markdown file for the transcript instead of plaintext?",
      "created_at": "2021-06-17T22:45:01Z",
      "updated_at": "2021-06-17T22:45:01Z"
    },
    {
      "author": "AlexHimself",
      "author_association": "NONE",
      "body": "Where did this land?",
      "created_at": "2021-12-09T01:53:39Z",
      "updated_at": "2021-12-09T01:53:39Z"
    }
  ],
  "created_at": "2020-01-13T14:40:50Z",
  "number": 11567,
  "state": "open",
  "title": "Start-Transcript should have an option to produce color-preserving output",
  "updated_at": "2021-12-09T01:53:39Z"
}