{
  "_url": "https://github.com/PowerShell/PowerShell/issues/11634",
  "author": "vexx32",
  "body": "<!-- Anything that looks like this is a comment and can't be seen after the Pull Request is created. -->\r\n\r\n# PR Summary\r\n\r\nWhen passing a bigint literal, e.g., `7n`, as a bare string to a parameter of type [string], the parameter binder was incorrectly using the direct ToString() conversion (unlike other numeric literals), which\r\nstore the original TokenText in order to properly retrieve the original string that was entered at the command line.\r\n\r\nFix is to ensure that we're capturing and storing the TokenText value when the value is of type BigInteger (since this type's TypeCode is simply `object` and is not read as being a numeric type by those APIs).\r\n\r\nI also needed to add BigInteger to the array of numeric types stored in LanguagePrimitives in order for the conversion methods to recognise that BigInteger literals need to be converted to string more carefully.\r\n\r\nQuick test case (interactive only):\r\n\r\n```powershell\r\nfunction Test-StringValue([string]$Value) { $value }\r\n\r\nTest-StringValue -Value 11n\r\n\r\n# `11n` should be returned, but you will see `11` returned before these changes\r\n```\r\n\r\n## PR Context\r\n\r\nThis PR resolves #11626 \r\n\r\n/cc @SteveL-MSFT\r\nI know y'all are probably up to your necks with the v7 release -- I'm hoping this can pass under the wire for that; would definitely like to have it fixed for the upcoming release. 🙂 \r\n\r\nI'm not 100% sure the included tests are the _best_ way to test this, but they certainly seem to do the job.\r\n\r\n## PR Checklist\r\n\r\n- [x] [PR has a meaningful title](https://github.com/PowerShell/PowerShell/blob/master/.github/CONTRIBUTING.md#pull-request---submission)\r\n    - Use the present tense and imperative mood when describing your changes\r\n- [x] [Summarized changes](https://github.com/PowerShell/PowerShell/blob/master/.github/CONTRIBUTING.md#pull-request---submission)\r\n- [x] [Make sure all `.h`, `.cpp`, `.cs`, `.ps1` and `.psm1` files have the correct copyright header](https://github.com/PowerShell/PowerShell/blob/master/.github/CONTRIBUTING.md#pull-request---submission)\r\n- [x] This PR is ready to merge and is not [Work in Progress](https://github.com/PowerShell/PowerShell/blob/master/.github/CONTRIBUTING.md#pull-request---work-in-progress).\r\n    - If the PR is work in progress, please add the prefix `WIP:` or `[ WIP ]` to the beginning of the title (the `WIP` bot will keep its status check at `Pending` while the prefix is present) and remove the prefix when the PR is ready.\r\n- **[Breaking changes](https://github.com/PowerShell/PowerShell/blob/master/.github/CONTRIBUTING.md#making-breaking-changes)**\r\n    - [x] None\r\n    - **OR**\r\n    - [ ] [Experimental feature(s) needed](https://github.com/MicrosoftDocs/PowerShell-Docs/blob/staging/reference/6/Microsoft.PowerShell.Core/About/about_Experimental_Features.md)\r\n        - [ ] Experimental feature name(s): <!-- Experimental feature name(s) here -->\r\n- **User-facing changes**\r\n    - [x] Not Applicable\r\n    - **OR**\r\n    - [ ] [Documentation needed](https://github.com/PowerShell/PowerShell/blob/master/.github/CONTRIBUTING.md#pull-request---submission)\r\n        - [ ] Issue filed: <!-- Number/link of that issue here -->\r\n- **Testing - New and feature**\r\n    - [ ] N/A or can only be tested interactively\r\n    - **OR**\r\n    - [x] [Make sure you've added a new test if existing tests do not effectively test the code changed](https://github.com/PowerShell/PowerShell/blob/master/.github/CONTRIBUTING.md#before-submitting)\r\n- **Tooling**\r\n    - [x] I have considered the user experience from a tooling perspective and don't believe tooling will be impacted.\r\n    - **OR**\r\n    - [ ] I have considered the user experience from a tooling perspective and enumerated concerns in the summary. This may include:\r\n        - Impact on [PowerShell Editor Services](https://github.com/PowerShell/PowerShellEditorServices) which is used in the [PowerShell extension](https://github.com/PowerShell/vscode-powershell) for VSCode (which runs in a different PS Host).\r\n        - Impact on Completions (both in the console and in editors) - one of PowerShell's most powerful features.\r\n        - Impact on [PSScriptAnalyzer](https://github.com/PowerShell/PSScriptAnalyzer) (which provides linting & formatting in the editor extensions).\r\n        - Impact on [EditorSyntax](https://github.com/PowerShell/EditorSyntax) (which provides syntax highlighting with in VSCode, GitHub, and many other editors).\r\n",
  "closed_at": "2020-05-12T23:31:38Z",
  "comments": [
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "Makes sense to review all using LanguagePrimitives.IsNumeric() and make the fix more general?",
      "created_at": "2020-01-20T11:02:22Z",
      "updated_at": "2020-01-20T11:02:22Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "EDIT: Apparently I was dreaming or something, I'm not seeing a second overload of IsNumeric() now 😕 \r\n\r\nSo yeah, the long and the short of it is that we can't determine from the type code alone whether it's numeric, we'd need to also pass the actual type into the method.\r\n\r\nGiven that, I think the most elegant solution is to _add_ an overload of `IsNumeric()` which takes a `Type` directly, and it can handle the BigInteger case specifically as well as calling the existing method which operates on type code instead.\r\n\r\nProbably better for a follow up PR than one to take place here though, I wanna get this fixed for the 7.0 release and not hold it up any with extensive changes. 😁 ",
      "created_at": "2020-01-20T16:41:54Z",
      "updated_at": "2020-01-20T17:12:13Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "@iSazonov can you elaborate on what side effects you're seeing? 🙂 ",
      "created_at": "2020-01-20T17:22:36Z",
      "updated_at": "2020-01-20T17:22:36Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "If we'd like to instead do a thorough review of the IsNumeric usages and ensure they all align, we can do that too. I have a second branch live [here](https://github.com/vexx32/PowerShell/tree/NewIsNumeric) with a more complete set of changes. If you'd prefer I can PR that instead; was just trying to keep changes minimal to simplify review. 🙂 ",
      "created_at": "2020-01-20T18:18:17Z",
      "updated_at": "2020-01-20T18:18:17Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "> can you elaborate on what side effects you're seeing?\r\n\r\nI see above 20 references to IsNumeric() and after first look I have questions for every such reference.\r\nIt would be great to create a list of the references and comment every one whether we fix or no and why.\r\nIf there are references where BigInteger is important (but not all) probably we should create IsNumericOrBigInteger() method.",
      "created_at": "2020-01-21T03:58:11Z",
      "updated_at": "2020-01-21T04:00:20Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "@iSazonov I agree we should do something along those lines, but I don't think I'd be the right person for that job. Ideally I'd ask someone on the PS team (possibly multiple people) who is familiar with the code path(s) in question.\r\n\r\nFrom a brief look through, I would guess we shouldn't see any adverse effects from always handling BigInteger the same way as we do other numeric types; from what I can see, handling it in this way doesn't break anything immediately obvious, and it also solves the issue raised in #11628 \r\n\r\nThe other code paths using IsNumeric(), as you'd expect, all deal with handling numeric values in various scenarios (I see formatting code, remoting code, and parameter binding code, among a couple others). At least intuitively, I _think_ we're best off continuing to handle them uniformly, and adding a standard case in for BigInteger, but as I said... I lack the familiarity others may have to really make a solid call on that.\r\n\r\nUltimately, I agree the right solution is to review and handle them all. If we have time to do so prior to 7.0 GA, that'd be my preference. If not, this more minimal change will prevent breaking existing scripts in at least this specific scenario. It mightn't be perfect, but it's a better state than we're sitting in currently. 🙂 ",
      "created_at": "2020-01-21T04:42:52Z",
      "updated_at": "2020-01-21T04:43:22Z"
    },
    {
      "author": "gurnec",
      "author_association": "NONE",
      "body": "I've been looking at @vexx32's two branches to see if I could locate any bugs or departures from PS5/6 behavior, and I've found a couple.\r\n\r\nFirst, for the more extensive branch with the new `IsNumeric` overload, many arithmetic expressions have issues, producing different results compared to PS5/6 (NewIsNumeric output is below):\r\n\r\n```\r\nPS> ([BigInt]7 + [BigInt]7).GetType().Name\r\nInt32\r\n\r\nPS> +[BigInt]3000000000\r\nOperationStopped: Arithmetic operation resulted in an overflow.\r\n\r\nPS> [BigInt]3000000000 -gt 0\r\nOperationStopped: Arithmetic operation resulted in an overflow.\r\n\r\nPS> [BigInt]0 -eq ''\r\nTrue\r\n```\r\n\r\nThese are caused by calling the [new overload from ExtensionMethods.cs](https://github.com/vexx32/PowerShell/commit/5be190d3e15d9c3d8346cccd0952fa02f9e5d5c2#diff-e6dd95b557900027bae9a1bfe53ee220). If that change is reverted, the above is fixed.\r\n\r\nThis next issue exists in both branches:\r\n\r\n```\r\nPS> [string][BigInt]0\r\nInvalidArgument: Cannot convert value \"0\" to type \"System.String\". Error: \"Object must implement IConvertible.\"\r\n\r\nPS> [BigInt]$null\r\nOperationStopped: Invalid cast from 'System.Int32' to 'System.Numerics.BigInteger'.\r\n```\r\n\r\nIn PS5/6, the first cast converts to a string as expected, while the second cast also fails though with a more clear exception. Treating a BigInteger as though it were a Numeric primitive in `LanguagePrimitives.RebuildConversionCache` seems to be the culprit. One way to fix this could be to create a new converter method [such as in this update to the WrapBigintLiterals branch](https://github.com/gurnec/PowerShell/commit/fb567009d8386521d3ce3c0ff4a61cef75fb0836) which treats BigInteger as any other object when converting it to a string (which eventually causes `IFormattable.ToString` to be called), but has the `.TokenText` special case from `ConvertNumericToString`.\r\n\r\nI wish I were qualified to comment on whether or not other issues exist... but I thought I'd at least comment on what I'd found so far.",
      "created_at": "2020-01-24T20:05:59Z",
      "updated_at": "2020-01-24T20:05:59Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "@gurnec very much appreciate the thorough review on all points!\r\n\r\nI'll check out your update there this weekend and see if can get it to break or not :smile: \r\n\r\nI have my doubts any of this will make it in time for v7 but I'll do what I can to get it sorted out properly either way. 💖",
      "created_at": "2020-01-24T22:53:52Z",
      "updated_at": "2020-01-24T22:54:07Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "@vexx32 ping :-)",
      "created_at": "2020-02-01T10:44:36Z",
      "updated_at": "2020-02-01T10:44:36Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "I think I have some idea of what to do here... it'll need some modifications to the type converters for numeric types as well as adding biginteger to the types list. The issues @gurnec is finding probably come about because while we told PS that biginteger is a numeric type, we didn't tell it how to handle it as a numeric type.\r\n\r\nI'm going to tinker a bit in my side branch and when I have everything working I'll merge it back into this branch. Thanks for the ping @iSazonov! 🙂 \r\n\r\nEDIT: Some tinkering later, and I think @gurnec has the right idea; having PS treat BigInteger as a regular number in _all_ circumstances is not the way to go. It doesn't implement some of the interfaces necessary for those conversion paths to work correctly (most notably `IConvertible`). Since most conversions with it are currently behaving OK, we just need to add a few additional ones to iron out the edge cases. That shouldn't be too tricky to do. 🙂 ",
      "created_at": "2020-02-01T16:49:23Z",
      "updated_at": "2020-02-01T19:31:06Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "@gurnec @iSazonov looks like that should sort everything out. \r\n\r\nNote: `[bigint]0 -eq ''` is supposed to return `True`, just like `0 -eq ''` returns true (and similar for other standard numeric types) and will work correctly with the latest commit. It was not doing this previously.\r\n\r\nOther fixed conversions:\r\n\r\n- `[string][bigint]0`\r\n- `[bigint]$null`\r\n- `[bigint]$true`\r\n- `[bigint]$false`\r\n\r\nThe other conversion failures @gurnec noted from the other branch never arose in this branch and will continue to work correctly. 🙂 \r\n\r\nEDIT: Noticed that bool->bigint was failing, pushed a fix and added them to the list.",
      "created_at": "2020-02-01T20:25:05Z",
      "updated_at": "2020-02-01T20:44:05Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "@iSazonov Yeah, I'm not inclined to go fixing too many style issues in these code sections at the moment. They really need a thorough pass in a separate PR and I'd rather not complicate the commits here too much.\r\n\r\nA few things seem to have been caught by my autoformatter, I can remove those if we need to, but I've already got plans to do a good style pass on LanguagePrimitives anyway 🙂 \r\n\r\nI don't think we should incorporate this into `IsNumeric()` directly. The code paths that are calling this seem to pretty commonly assume that a result of `true` from that method means that the type they're asking about implements certain interfaces, which usually includes `IConvertible` -- and BigInteger does not implement this interface. Changing the IsNumeric() method now without thoroughly examining all the code paths using it is asking for a whole heap of exceptions to get thrown all over the place.\r\n\r\nThe changes as they are allow things to keep treating BigInteger as kind of its own thing, which it is, while also adding the necessary conversion paths for it to appear like a more normal number to users and allow it to be used as such.",
      "created_at": "2020-02-04T13:56:36Z",
      "updated_at": "2020-02-04T13:56:36Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "> I don't think we should incorporate this into IsNumeric() directly.\r\n\r\nReally there are some IsNumeric() methods and I guess ignoring its does not fix even parameter bindings.\r\nWe could split this on some PRs but we should have a full view.",
      "created_at": "2020-02-04T15:07:00Z",
      "updated_at": "2020-02-04T15:07:56Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "@iSazonov The current branch here as it is resolves the binding issues with BigInteger values. Reviewing IsNumeric() usages is likely to be a bit of a dead end in my opinion, but might still be valuable to do for some edge cases. \r\n\r\nEDIT: I've rebased and trimmed the changes down to just the necessary ones for this PR. I think I'll do a style pass in this file afterwards, it really needs it 😁 \r\n",
      "created_at": "2020-02-04T16:33:15Z",
      "updated_at": "2020-02-04T23:42:30Z"
    },
    {
      "author": "gurnec",
      "author_association": "NONE",
      "body": "@vexx32 I'm afraid there's a regression in your current patch:\r\n\r\n```\r\nPS> [bigint]'0'\r\nInvalidArgument: Cannot convert value \"0\" to type \"System.Numerics.BigInteger\". Error: \"Object reference not set to an instance of an object.\"\r\n```\r\n\r\n`ConvertStringToInteger()` just can't handle most string to BigInt conversions. I'd suggest that you either remove the line below (and its related changes) to return to the default string-to-object-via-Parse() conversion:\r\n\r\nhttps://github.com/PowerShell/PowerShell/blob/757a07c216786ac3c770640857158060f4651c62/src/System.Management.Automation/engine/LanguagePrimitives.cs#L4529\r\n\r\nor if we want string-to-BigInt conversions to act closer to other string-to-numeric ones, something more complicated will be required like [this commit over here](https://github.com/gurnec/PowerShell/commit/0cbe86f410f97537665b526ff2b83a630649812c).\r\n\r\nThat will fix the immediate issue of `[bigint]'0'` and also permit conversions such as `[bigint]'0.0'`, `[bigint]'0L'`, etc. (which are currently valid for other numeric types, such as `[int]'0L'`), but it still has an issue with `[int]'0N'`.\r\n\r\n[This second commit](https://github.com/gurnec/PowerShell/commit/c4fe0bea32fe0c0cd36aa4860a4c8b0ebe6cd4b1) should fix the latter. Whether it makes sense to start down the road of making BigInts more like the other simple numeric types as opposed to keeping things simpler isn't really my call....",
      "created_at": "2020-02-05T21:56:53Z",
      "updated_at": "2020-02-05T21:56:53Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "Huh, really? That's quite odd. I thought I tested that & had that working. Must've broken it again... ah, yeah, I see what you're saying. I don't think it should require _quite_ that complex of a solution though; you'll note the original `ConvertStringToInteger()` essentially does the same thing, just doesn't support converting to the BigInteger value itself. Shouldn't be too complex to work that in a little more effectively in there.\r\n\r\nEDIT: Yeah the issue is essentially that `GetIntegerSystemConverter()` doesn't have a way to handle BigInteger and just returns `null`, which isn't expected in the method. Added some extra handling for when the target type is BigInteger that sorts it out reasonably neatly. 🙂 ",
      "created_at": "2020-02-06T01:25:03Z",
      "updated_at": "2020-02-06T02:20:54Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "@iSazonov @daxian-dbw is there anything still pending on this one? 💖 ",
      "created_at": "2020-04-24T19:01:27Z",
      "updated_at": "2020-04-24T19:01:27Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "Question to PowerShell Committee is since it is a breaking change can we accept the partial fix or should work on full fix?",
      "created_at": "2020-04-25T06:22:53Z",
      "updated_at": "2020-04-25T06:22:53Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "Is it a breaking change? It just puts the behaviour for bigint literals back to what's expected for every other numeric literal. Not really clear on why that's considered breaking anything.\r\n\r\nI'm also not really sure what more you'd want to do here without redesigning how these code paths work completely. I'm no expert here, but at a glance I doubt we're likely to find a better way to handle it all without a fair bit of work.",
      "created_at": "2020-04-25T06:38:24Z",
      "updated_at": "2020-04-25T06:41:12Z"
    },
    {
      "author": "gurnec",
      "author_association": "NONE",
      "body": "It's breaking in at least one minor way... the proposed commits would change the value of `[bool]0n`.\r\n\r\nOther than that, I see this as fixing a regression in 7.0 in that some arguments formerly interpreted as unquoted expandable-strings are now being interpreted as BigInts. Just my 2¢.",
      "created_at": "2020-04-25T16:12:52Z",
      "updated_at": "2020-04-25T16:12:52Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "Yeap, that's true, I guess! `[bool]0n` does cast to `$false` with this change, where currently that results in `$true`.\r\n\r\nI guess it would be considered a bit of a white lie for `[bool]0n` to be `False` when `[bigint]` is a struct, and just about every other struct will still cast to bool as `$true` even at their default value.\r\nThat said... if we're treating it like a number in PS, we should probably be consistent about it, and have it behave as much like the other numbers as we can manage. It is, after all, much closer to a primitive value than pretty much any other struct that is provided in .NET.\r\n\r\nI think it's likely to be more useful to folks this way in that it avoids hitting an edge case where if you expect a number as input and use `if ($number) { ... }` to determine if it's zero or not (not strictly advisable, but convenient at times) then bigints behave the same as all the other number types we have direct access to in PS.",
      "created_at": "2020-04-25T18:27:09Z",
      "updated_at": "2020-04-28T22:26:36Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "@PowerShell/powershell-committee reviewed this, BigInt should work the same as other numeric suffixes.  This means that [bool]0n should be `$false` like other numbers.  And `[string]1n` should return `1n` instead of just `1`.  It is a breaking change, but we believe it falls into Bucket 3.",
      "created_at": "2020-04-29T22:24:05Z",
      "updated_at": "2020-04-29T22:24:33Z"
    },
    {
      "author": "gurnec",
      "author_association": "NONE",
      "body": "The statement\r\n\r\n> BigInt should work the same as other numeric suffixes. This means that [bool]0n should be `$false` like other numbers.\r\n\r\nwas intended to be narrow in scope, is that correct?\r\n\r\nBecause otherwise, it should be pointed out that BigInts today behave quite differently than other numerics.\r\n\r\nExpression      | $x=65 or type=int64 | $x=65n or type=bigint\r\n--------------- | ------------------- | ---------------------\r\n[char]$x        | 'A'                 | InvalidArgument\r\n[type][char]'A' | 65                  | InvalidArgument\r\n[type]''        | 0L                  | InvalidArgument\r\n[type]'0L'      | 0L                  | InvalidArgument\r\n[type]'0n'      | InvalidArgument     | InvalidArgument\r\n[type]0.9       | 1L                  | 0n\r\n1/[type]2       | 0.5                 | 0n\r\n[type]1/2       | 0.5                 | 0n\r\n\r\n(The patches in the PR don't change any of the above, just the `[bool]0n`.)\r\n\r\nMy apologies for the noise if that statement was indeed intended to be narrow in scope.",
      "created_at": "2020-04-30T00:04:02Z",
      "updated_at": "2020-04-30T00:04:02Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "@gurnec expecting `[bigint]` to behave precisely like `[long]` is problematic. For one, even `[decimal]` doesn't support all the conversions you list.\r\n\r\nSome of those I would _like_ to fix (especially the ones involving rounding to bigint), but they will likely have to be addressed on an individual basis. For instance, I don't think it's a good idea (or really possible) for `bigint` to be falling back to `double` like the lower integer types tend to when you create fractional values via division, since `double`'s range is significantly narrower than `bigint`'s. I do appreciate the concise summary of the differences, though! ",
      "created_at": "2020-04-30T00:13:59Z",
      "updated_at": "2020-04-30T00:13:59Z"
    },
    {
      "author": "gurnec",
      "author_association": "NONE",
      "body": "> For one, even `[decimal]` doesn't support all the conversions you list.\r\n\r\nActually it does, or rather it supports all the conversions that the other real-number type `double` supports. Considering that `decimal` is a .NET built-in numeric type (as opposed to `BigInt`), it makes sense that it's treated as a \"real\" numeric type in PowerShell too.\r\n\r\nI'm not trying to be argumentative though... I completely agree with what you're saying.",
      "created_at": "2020-04-30T01:02:55Z",
      "updated_at": "2020-04-30T01:02:55Z"
    },
    {
      "author": "daxian-dbw",
      "author_association": "MEMBER",
      "body": "> And `[string]1n` should return `1n` instead of just `1`.\r\n\r\nI think this was described incorrectly, `[string]1n` should return `1` just like all other literal numbers.\r\nI believe what the committee meant was `Test-StringValue -Value 11n` in the example should return `11n` instead of `11`.\r\n\r\n> This means that `[bool]0n` should be `$false` like other numbers.\r\n\r\nThe committee commented on this as a reply to the ask, but this particular issue seems to be out of the scope of the initial purpose of this PR.\r\nIt looks to me most of the changes in `LanguagePrimitives.cs` are not needed for the original purpose, but please let me know if I misunderstood the changes.\r\nCan you please separate the extra changes out to a new PR (maybe a new issue first to discuss the issues you are fixing)?\r\n\r\n",
      "created_at": "2020-05-11T18:48:56Z",
      "updated_at": "2020-05-11T18:48:56Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "I'll have to take a thorough look at the diffs. I agree that `[string]1n` should just return `1` (and it does in fact behave that way in this PR currently), I'm sure I just got myself confused with that comment.\r\n\r\nI suppose I can pare that part out if necessary.\r\n\r\n@daxian-dbw see #12623 for the main casting issues that were addressed here in the second commit. If we need to split it out I think I can manage that well enough, just let me know.",
      "created_at": "2020-05-11T18:59:06Z",
      "updated_at": "2020-05-11T19:08:32Z"
    },
    {
      "author": "daxian-dbw",
      "author_association": "MEMBER",
      "body": "Yes please, it could be good to separate that fix to another PR.\r\n\r\nAlso, are the changes in `ConvertStringToInteger` needed for  #12623 or #11626? It seems to me the changes to `ConvertNullToNumeric` and the update to conversion cache for `(BigInt, string)` is all that need in `LanguagePrimitives.cs` for #11626.",
      "created_at": "2020-05-11T20:24:31Z",
      "updated_at": "2020-05-11T20:36:41Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "@daxian-dbw I actually am not entirely sure. I will give it a look without those and get back to you on that this evening. 🙂 ",
      "created_at": "2020-05-11T20:35:04Z",
      "updated_at": "2020-05-11T20:35:04Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "@daxian-dbw yeah so if I take out the changes in the actual `ConvertStringToInteger` method, the following will happen:\r\n\r\n1. The `Assert()` call will fail, because the `TypeCode` for `BigInteger` is the same as the type code for `object`.\r\n2. If we only bypass that, the `Convert.ChangeType()` call can fail since `BigInteger` is not `IConvertible`, so the conversion cannot be handled by that method. This is a fallback method (when the number can't be parsed directly) so I'm not sure how often this path would be hit, but it's still a potential concern.\r\n\r\nLooking at pulling off the latest commit now, might need some parts, will need to verify.",
      "created_at": "2020-05-12T01:18:32Z",
      "updated_at": "2020-05-12T01:18:32Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "@daxian-dbw I've split out the casting-related changes to #12629",
      "created_at": "2020-05-12T02:07:23Z",
      "updated_at": "2020-05-12T03:23:51Z"
    },
    {
      "author": "daxian-dbw",
      "author_association": "MEMBER",
      "body": "@vexx32 Some tab completion tests about `Get-CimInstance` were failing. I restarted the windows CI and SSH CI, but if they fail again, can you please take a look to see if it's related to this change? Also, it would be great if you can address the code factor issue 😄",
      "created_at": "2020-05-12T19:28:08Z",
      "updated_at": "2020-05-12T19:28:08Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "@PoshChan please get failures\r\n\r\n@daxian-dbw not sure how I can address the codefactor issue tbh. The using directive is in the right place. I think it's a false positive from the fact that there are some additional using directives further down behind some compiler flags.",
      "created_at": "2020-05-12T20:04:53Z",
      "updated_at": "2020-05-12T20:09:37Z"
    },
    {
      "author": "daxian-dbw",
      "author_association": "MEMBER",
      "body": "@vexx32 Thanks for the clarification on the code factor issue.\r\nAs for the windows CI failures, they failed in master as well, so it's not related to your changes here.",
      "created_at": "2020-05-12T20:15:51Z",
      "updated_at": "2020-05-12T20:15:51Z"
    },
    {
      "author": "msftbot[bot]",
      "author_association": "NONE",
      "body": ":tada:`v7.1.0-preview.3` has been released which incorporates this pull request.:tada:\n\nHandy links:\n* [Release Notes](https://github.com/PowerShell/PowerShell/releases/tag/v7.1.0-preview.3)\n",
      "created_at": "2020-05-19T18:10:15Z",
      "updated_at": "2020-05-19T18:10:15Z"
    }
  ],
  "created_at": "2020-01-20T06:55:38Z",
  "number": 11634,
  "state": "closed",
  "title": "Fix String Parameter Binding for Biginteger numeric literals",
  "updated_at": "2020-05-19T18:10:16Z"
}