{
  "_url": "https://github.com/PowerShell/PowerShell/issues/11710",
  "author": "JohnLeyva",
  "body": "**Ensure** can be use to indicate a resource exist in an specific state, therefore implies a Test and a series of operations that are might be invoked to get the desired state, for this it will do the best effort.\r\n\r\nAn example is Ensure-DiskAvaialbleSpace 100GB , it will check if the desired space is available and if not it can start executing a series of operations trying to get the desired state.\r\n\r\nPlease let me know if there is a better way to express this with existing or other verbs.\r\n",
  "closed_at": null,
  "comments": [
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "There are other verbs that do come close, but none of the ones I can think of deal with idempotence -- not modifying the resource if it's already in the desired state.\r\n\r\nArguably, some of this is the purview of DSC, but I think we could still use some cmdlets that work in a similar fashion. 👍 ",
      "created_at": "2020-01-28T20:48:38Z",
      "updated_at": "2020-01-28T20:48:38Z"
    },
    {
      "author": "SeeminglyScience",
      "author_association": "COLLABORATOR",
      "body": "How about `Assert`?\r\n\r\n```raw\r\nVerb   AliasPrefix Group     Description\r\n----   ----------- -----     -----------\r\nAssert as          Lifecycle Affirms the state of a resource\r\n```",
      "created_at": "2020-01-28T23:29:03Z",
      "updated_at": "2020-01-28T23:29:03Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "At least from what I've seen, `Assert` typically indicates the cmdlet will throw an error if the resource is not in the desired state, rather than attempting to do anything to fix it, no?",
      "created_at": "2020-01-28T23:32:04Z",
      "updated_at": "2020-01-28T23:32:04Z"
    },
    {
      "author": "JohnLeyva",
      "author_association": "NONE",
      "body": "The few example of cmdlet using assert behaves as  @vexx32  indicates, wondering if there are some examples that can help me to understand other valid uses of assert ",
      "created_at": "2020-01-28T23:38:03Z",
      "updated_at": "2020-01-28T23:38:03Z"
    },
    {
      "author": "SeeminglyScience",
      "author_association": "COLLABORATOR",
      "body": "I've seen that in the context of tests, but not much otherwise.  Afaik there's no official guidance suggesting that *should* be the case, and tbh it kind of seems like a waste of the verb.",
      "created_at": "2020-01-28T23:46:06Z",
      "updated_at": "2020-01-28T23:46:06Z"
    },
    {
      "author": "mklement0",
      "author_association": "CONTRIBUTOR",
      "body": "It is in line with how _assert_ is used in debugging in other languages and in Pester's `Assert-*` commands, but even generally I think the following distinction makes sense:\r\n\r\n* To _assert_ means to assume that a given state is _already in effect_, to make a claim about _what should already be true_, without implying action toward making it so.\r\n   * If the assertion fails (turns out not be true), you want to know about, which in the world of software typically means failing instantly and noisily.\r\n\r\n* To _ensure_ means to _take action if needed_ so that a desired state is reached.\r\n\r\n  * If the desired state is already in effect, no action or notification is needed.\r\n  * If the desired state _cannot be reached_, an error must be reported.\r\n\r\n\r\n",
      "created_at": "2020-01-29T00:56:54Z",
      "updated_at": "2020-01-31T19:28:48Z"
    },
    {
      "author": "SeeminglyScience",
      "author_association": "COLLABORATOR",
      "body": "Yeah I can't really argue with any of that.  I'm just not super excited to see *another* verb added that is only used a handful of times.  The nature of the verb system is that sometimes they don't match up 100%, but keeping the verb pool low means increased discoverability.  `Assert` is close enough imo.",
      "created_at": "2020-01-29T01:13:57Z",
      "updated_at": "2020-01-29T01:13:57Z"
    },
    {
      "author": "mklement0",
      "author_association": "CONTRIBUTOR",
      "body": "Understood re concern about verb proliferation, but I've personally cringed at having to shoehorn _ensure_ functionality into `Assert-`  as a command _author_; as a command _user_ , I find it problematic to be faced with `Assert-Foo` without knowing whether it will abort, if Foo isn't already true, or if it will make it true for me - two very different things.\r\nSure, the help will (hopefully) tell you, but to me the point of a standardized verb is to convey variations of _fundamentally_ the same action, and I don't think that is the case here.\r\n",
      "created_at": "2020-01-29T01:29:45Z",
      "updated_at": "2020-01-29T01:30:10Z"
    },
    {
      "author": "tommeadon",
      "author_association": "NONE",
      "body": "As @vexx32 mentioned, we are getting into DSC territory.  What would be the guidance to authors to help them know when to write an `Ensure-` function or cmdlet instead of a DSC configuration?  I guess for small scenarios that don't warrant the overhead of DSC, but that could get subjective..?",
      "created_at": "2020-01-29T08:21:45Z",
      "updated_at": "2020-01-29T08:21:45Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "@tommeadon I've not seen or heard much guidance in the way of DSC for pwsh at present. Some pieces are in place. But as yet I don't think there's currently a supported way to apply any DSC configuration when using PowerShell 6+, is there?",
      "created_at": "2020-01-29T12:24:09Z",
      "updated_at": "2020-01-29T12:24:09Z"
    },
    {
      "author": "mklement0",
      "author_association": "CONTRIBUTOR",
      "body": "More generally, I think, desired-state logic is useful in _any_ domain, not just in the domain of _computer configuration_ (DSC), so I don't see an either-or there (though it couldn't hurt to mention DSC in the documentation for the new verb).\r\n",
      "created_at": "2020-01-29T12:34:30Z",
      "updated_at": "2020-01-29T12:34:30Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "Ensure-DiskAvaialbleSpace vs Test-DiskAvaialbleSpace - second looks well.",
      "created_at": "2020-01-29T14:22:05Z",
      "updated_at": "2020-01-29T14:22:05Z"
    },
    {
      "author": "mklement0",
      "author_association": "CONTRIBUTOR",
      "body": "I'm afraid I don't understand your comment, @iSazonov; what looks good?\r\n(`Test-DiskSpaceAvailable` would return a  Boolean reflecting whether enough space is available, `Assert-DiskSpaceAvailable` would fail if not enough space is available, and `Ensure-DiskSpaceAvailable` would try to make enough space available automatically.)",
      "created_at": "2020-01-29T14:28:43Z",
      "updated_at": "2020-01-29T14:30:57Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "Original request is to execute a script if a condition is true/false -  `Ensure-DiskAvaialbleSpace 100Gb -ScriptBlock { Clear-OldFiles }`\r\nIt is the same as:\r\n```powershell\r\nif (-not Test-DiskAvaialbleSpace 100Gb)\r\n{\r\n    Clear-OldFiles\r\n}\r\n```\r\n",
      "created_at": "2020-01-29T14:36:13Z",
      "updated_at": "2020-01-29T14:36:13Z"
    },
    {
      "author": "doctordns",
      "author_association": "COLLABORATOR",
      "body": "> At least from what I've seen, `Assert` typically indicates the cmdlet will throw an error if the resource is not in the desired state, rather than attempting to do anything to fix it, no?\r\n\r\nwell yes, Assuming you did Ensure-DiskAvaialbleSpace 100GB - what else would the cmdet do but to throw an error is not enough space were available? Unless that cmdlet is really really smart, it's not likely to make more space available on full drive!",
      "created_at": "2020-01-29T17:04:41Z",
      "updated_at": "2020-01-29T17:04:41Z"
    },
    {
      "author": "JohnLeyva",
      "author_association": "NONE",
      "body": "Ensure-DiskAvaialbleSpace could begin to delete/archive files such as logs, cached files, VHD, videos, etc until it achieves the desired stated without having to wipe everything, so it is not a simple\r\n\r\n if (test) { action }\r\n\r\nAlso the intention is to be reusable, so the it avoids repetition in several Jobs.\r\n\r\nThrowing an exception still a possible result after trying and not achieving the expected state, for example some file types might have be in use or have a minimum retention before it can be moved or deleted..",
      "created_at": "2020-01-29T19:50:29Z",
      "updated_at": "2020-01-29T19:50:29Z"
    },
    {
      "author": "doctordns",
      "author_association": "COLLABORATOR",
      "body": "Yeah. I can see that being really well received. How does this cmdlet even begin to know which log files, are good to remove or which corporate videos get nuked for every organisation. \r\n\r\nI have 2TB collection of Grateful Dead live shows that has taken me over 35 years to accumulate. I would have negative thoughts were a cmdlet to delete that data.  And suppose that there were no 'temp' files to remove - what then? Would you expect the cmdlet to order, install, and provision a new disk, or a new computer with more disks etc etc? I jest of course but there are some real risks here.\r\n\r\nThe question of what constitutes deletable files is going to provide different answers for every customers. An Assert-Freespace might be useful - just leave it to the customer to catch the issue and deal accordingly.\r\n\r\n",
      "created_at": "2020-01-29T19:58:29Z",
      "updated_at": "2020-01-29T19:58:29Z"
    },
    {
      "author": "mklement0",
      "author_association": "CONTRIBUTOR",
      "body": "I think we're getting off topic here: the proposal is to add a new approved verb, `Ensure`, and I think there's consensus on its _general logic_ (though not everyone agrees that we need a new verb). \r\n\r\nI don't think we need to discuss the specifics of a hypothetical command that uses this verb; it's just an example (and @iSazonov even fleshed out a variant that should allay your concerns).",
      "created_at": "2020-01-29T20:19:57Z",
      "updated_at": "2020-01-29T20:19:57Z"
    },
    {
      "author": "doctordns",
      "author_association": "COLLABORATOR",
      "body": "I am unconvinced the new verb is needed. Ensure as a verb suggests that something is done to do the ensuring. Ensure-memory, ensure-filespace, etc - all suggest cmdlets are going to be able to do something to do the ensuring. \r\n\r\n I'd prefer to use Assert, then catch any exception assert raises. That gives responsibility to the user as to what to if the assertion fails.",
      "created_at": "2020-01-29T20:25:52Z",
      "updated_at": "2020-01-29T20:25:52Z"
    },
    {
      "author": "mklement0",
      "author_association": "CONTRIBUTOR",
      "body": "> Ensure as a verb suggests that something is done to do the ensuring.\r\n\r\nIndeed; the distinction between `Assert` and `Ensure` was summarized [above](https://github.com/PowerShell/PowerShell/issues/11710#issuecomment-5795444530).\r\n\r\n@SeeminglyScience's concern is verb proliferation, whereas you seem to think there's no value in implementing commands that do something to ensure a desired state?\r\nI can think of many cases where a desired state can more self-evidently be ensured (think `Ensure-ConnectionInitialized`, `Ensure-ModuleInstalled`, ...), which is a useful technique, so to give it expression via a dedicated verb makes perfect sense to me. Note that we're not necessarily talking about _standard_ cmdlets using the new verb, but (also) about giving users a way to name self-authored commands that exhibit desired-state logic in an expressive manner that is also compliant.",
      "created_at": "2020-01-29T20:46:44Z",
      "updated_at": "2020-01-29T20:46:44Z"
    },
    {
      "author": "JohnLeyva",
      "author_association": "NONE",
      "body": "Here the intention is to allow PSScriptAnalyzer to highlight unwanted verbs, but in this case we haven't found a good alternative to Ensure.\r\n\r\nThrowing exceptions seems to over complicate the code,\r\n\r\nBrowsing I see other examples such as:\r\n\r\nEnsure-IISAppPoolStarted   \r\nEnsure-FileEnconding\r\nEnsure-PSDrive\r\nEnsure-RegistryKey\r\n\r\nWhich helps to make code easier.\r\n\r\nNo sure if there is an alternative in PSScriptAnalyzer to expand the accepted verbs. ",
      "created_at": "2020-01-29T20:55:32Z",
      "updated_at": "2020-01-29T20:55:32Z"
    },
    {
      "author": "doctordns",
      "author_association": "COLLABORATOR",
      "body": "For many/.some of those other verbs work too.\r\n\r\n- Rather than Ensure-IISAppPoolStarted - why not just Start-IISAppPool\r\n- Rather than Ensure-FileEnconding Set-FIleEncoding\r\n- Rather than Ensure-PSDrive  New-PSDrive -EA 0\r\n- Rather than Ensure-RegistryKey - New-RegistryKey -EA-\r\n\r\n0\r\n\r\n",
      "created_at": "2020-01-29T21:07:24Z",
      "updated_at": "2020-01-29T21:07:24Z"
    },
    {
      "author": "mklement0",
      "author_association": "CONTRIBUTOR",
      "body": "Because `-ea 0` (`-ErrorAction SilentlyContinue`) is no substitute for desired-state logic: for instance, if `New-RegistryKey` fails not because the key already exists, but _because you lack permission to create it_, your code will malfunction.\r\n\r\nAlso, a `Start-*` command shouldn't be assumed to be idempotent. ",
      "created_at": "2020-01-29T21:17:50Z",
      "updated_at": "2020-01-29T21:18:18Z"
    },
    {
      "author": "ThomasNieto",
      "author_association": "CONTRIBUTOR",
      "body": "What is the main benefit of adding this verb? In a `Ensure` vs `Set` cmdlet all I see `Ensure` is going to run a `Test` then `Set` if needed. The same logic can performed in whatever script is calling that cmlet like in @iSazonov example.",
      "created_at": "2020-01-29T21:43:08Z",
      "updated_at": "2020-01-29T21:43:08Z"
    },
    {
      "author": "mklement0",
      "author_association": "CONTRIBUTOR",
      "body": "The main benefit is [DRY](https://en.wikipedia.org/wiki/Don%27t_repeat_yourself): you can write _wrapper_ commands you can call from multiple places that ensure that a desired state has been achieved, by wrapping the logic of testing for the state and performing what's necessary to achieve the state only once.\r\n\r\n",
      "created_at": "2020-01-29T21:50:13Z",
      "updated_at": "2020-01-29T21:50:13Z"
    },
    {
      "author": "mklement0",
      "author_association": "CONTRIBUTOR",
      "body": "You could similarly ask what the benefit of DSC is: It is the convenience of being able to ask a command / engine / framework to achieve a desired target state, whether by no-op (if already in the target state) or by whatever operations are necessary, and to only be notified in case of the inability to achieve the target state; even though the syntax wouldn't be declarative (the way it is in DSC), calling an `Ensure-*` command would have the same benefits.",
      "created_at": "2020-01-29T22:08:53Z",
      "updated_at": "2020-01-29T22:08:53Z"
    },
    {
      "author": "JohnLeyva",
      "author_association": "NONE",
      "body": "I'll review current implementation based on @doctordns  suggestions.\r\n\r\nIn general, the pattern is \r\n\r\nfunction Ensure_X {\r\n  if ( test_X ) { return }\r\n   Action_1\r\n....\r\n  if ( test_X ) { return }\r\n  Action_n\r\n  if ( test_X ) { return }\r\n  throw \"Failed to achieve Test_X\"\r\n}\r\n\r\nVerbs such as `Set` and `New` indicates the action is going to be executed without previous validation.\r\n\r\nCertainly the code can be unwind in the caller function, but will make it less clear and reusable\r\n\r\nAnother example I see \r\n\r\nEnsure-File -path $path  -Source @($src1, @src2)  # src can be UNC, http or git.\r\n\r\nCan be argued that `Copy-File` is an option, but it hides the intend of checking first and the do the best effort to try to get the resource from any of the indicated sources \r\n",
      "created_at": "2020-01-29T22:16:28Z",
      "updated_at": "2020-01-29T22:17:28Z"
    },
    {
      "author": "SeeminglyScience",
      "author_association": "COLLABORATOR",
      "body": "I think part of my issue with this verb is that it mainly makes sense to use for internal functions.  This may not be everyone's philosophy, but to me it doesn't matter what you name internal functions, as long as they describe what they do.  The approved verb system is for discoverability, and you aren't discovering internal functions in the same way  you do public functions (even as a new contributor).\r\n\r\nI say it makes sense mainly for internal functions because it doesn't seem productive to export a `Test`, `Set` *and also* an `Ensure` that just wraps the two.  It doesn't feel like saving an `if` statement is enough value to warrant exporting a whole extra command.  If you *really* want to add a \"test and fix\" option, I'd just add a `-Fix` switch to the `Test` command.\r\n\r\nThe verb also makes sense for external \"controller\" scripts, but I feel the same way there.  If the point of the script is to be ran from a scheduled task and not to provide utility to other scripts, there's nothing wrong with `EnsureDiskSpace.ps1`.",
      "created_at": "2020-01-30T14:03:25Z",
      "updated_at": "2020-01-30T14:03:25Z"
    },
    {
      "author": "mklement0",
      "author_association": "CONTRIBUTOR",
      "body": "> it mainly makes sense to use for internal functions.\r\n\r\nI don't disagree about the _mainly_ part; I personally think it can also make sense for _published_ commands, but I don't think we need to discuss this aspect further, at least yet.\r\n\r\nAlso, there are different degrees of \"internality\"; if it's not a published command as such, but something you share with colleagues (whether as function source code for their profiler or as an external script), you'd still want it to be properly named for the sake of _discoverability_.\r\n\r\nThis also applies to your example (`Ensure-DiskSpace` not `EnsureDiskspace` ).\r\n\r\nAs for truly module-/script-internal helper functions/scripts:\r\n\r\n>  This may not be everyone's philosophy, but to me it doesn't matter what you name internal functions, as long as they describe what they do\r\n\r\nI'd say whether to use compliant naming there is a matter of personal preference.\r\n\r\nEspecially If something is a proper advanced function - even if used only internally - I personally prefer compliant names. If you use nonstandard verbs, _PSSA will haunt you_, as @JohnLeyva has stated.\r\n\r\n(There's also the issue of something that may start out internal becoming public later; if you start out with compliant names, no refactoring is needed.)\r\n\r\nThere is currently no good solution:\r\n\r\n* You can either live with the annoyance of PSSA warnings that you know don't apply.\r\n\r\n* Or you can turn PSSA verb warnings off altogether, and lose warnings you may care about.\r\n\r\n(I suppose making the [`UseApprovedVerbs`](https://github.com/PowerShell/PSScriptAnalyzer/blob/master/RuleDocumentation/UseApprovedVerbs.md) PSSA rule configurable with exclusion lists would _technically_ be a solution, but I don't think encouraging \"private sub-languages\" is a good idea; `Ensure` deserves _public_ recognition, for the reasons discussed).\r\n\r\n\r\n\r\n\r\n\r\n",
      "created_at": "2020-01-30T19:04:51Z",
      "updated_at": "2020-01-30T20:10:41Z"
    },
    {
      "author": "SeeminglyScience",
      "author_association": "COLLABORATOR",
      "body": "> Also, there are different degrees of \"internality\"; if it's not a published command as such, but something you share with colleagues (whether as function source code for their profiler or as an external script), you'd still want it to be properly named for the sake of _discoverability_.\r\n\r\nI'm using the term internal similar to the access modifier in C#.  More specifically, when I say internal I'm referring to situations where you would not (easily) be able to retrieve the function via `Get-Command -Verb Ensure`.\r\n\r\n> I'd say whether to use compliant naming there is a matter of personal preference.\r\n> \r\n> Especially If something is a proper advanced function - even if used only internally - I personally prefer compliant names. If you use nonstandard verbs, _PSSA will haunt you_, as @JohnLeyva has stated.\r\n\r\nI definitely agree that it's personal preference whether you'd like to *extend* the compliance guidline to include non-public commands. As for PSSA, yeah it's unfortunate that PSSA can't determine if a command is exported.  Personally I use `VerbNoun` naming in non-public commands mostly so it's easy to tell at a glance what is public and what isn't; not setting off PSSA is a plus as well.\r\n\r\n> (There's also the issue of something that may start out internal becoming public later; if you start out with compliant names, no refactoring is needed.)\r\n\r\nI get what you're saying but no refactoring seems unlikely.  I don't think the majority of folks build out an internal function in the same way they would a public one.  Plus in this scenario, this internal function is internal because you're just wrapping existing `Test` and `Set` commands to keep DRY.\r\n\r\n> There is currently no good solution:\r\n> \r\n> * You can either live with the annoyance of PSSA warnings that you know don't apply.\r\n> * Or you can turn PSSA verb warnings off altogether, and lose warnings you may care about.\r\n\r\nOr use a different naming scheme for non-public commands.  The list of approved verbs is pretty tailored to public API's imo.  I don't think it makes sense to try to shoe horn incredibly specific and narrow functions into the same naming conventions as general use API's, and I don't think it makes sense to expand the pool of verbs approved for public API's to include every verb you might want for internal commands.\r\n\r\n> (I suppose making the [`UseApprovedVerbs`](https://github.com/PowerShell/PSScriptAnalyzer/blob/master/RuleDocumentation/UseApprovedVerbs.md) configurable with exclusion lists would _technically_ be a solution, but I don't think encouraging \"private sub-languages\" is a good idea\r\n\r\nDefinitely agree there.  It would be really cool if PSSA could be expanded to infer what is exported and what isn't, but that's *pretty* difficult statically.\r\n",
      "created_at": "2020-01-30T20:05:10Z",
      "updated_at": "2020-01-30T20:05:10Z"
    },
    {
      "author": "JohnLeyva",
      "author_association": "NONE",
      "body": "Indeed the intention at some point is to make them public, if convenient . \r\n\r\nFor the time being we are going to try to make compromises by changing Ensure to other verbs as it is more important to allow the PSSA to execute all checks.\r\n\r\n\r\n\r\n",
      "created_at": "2020-01-30T23:40:34Z",
      "updated_at": "2020-01-30T23:40:34Z"
    },
    {
      "author": "JohnLeyva",
      "author_association": "NONE",
      "body": "One that  is very often used in Powershell on vscode so devs can quickly ensure are ready to perform operations in azure.\r\n\r\n```\r\nfunction Ensure-AzContext {\r\n    $azSubscription = $deployManifest.Subscription\r\n    $azContext = Get-AzContext\r\n    if (-not $azContext) {\r\n        Connect-AzAccount -Subscription $azSubscription | Out-Null\r\n    }\r\n    else {\r\n        Set-AzContext -Subscription $azSubscription | Out-Null\r\n    }\r\n}\r\n```\r\n\r\n",
      "created_at": "2020-01-31T15:19:02Z",
      "updated_at": "2020-01-31T15:19:02Z"
    },
    {
      "author": "mklement0",
      "author_association": "CONTRIBUTOR",
      "body": "> I'm using the term internal similar to the access modifier in C#. More specifically, when I say internal I'm referring to situations where you would not (easily) be able to retrieve the function via Get-Command -Verb Ensure.\r\n> The list of approved verbs is pretty tailored to public APIs imo. I don't think it makes sense to try to shoe horn incredibly specific and narrow functions into the same naming conventions as general use APIs\r\n\r\nWe can reasonably conceive of _public_ as _used by other people_, so I don't think an approved verb necessarily has to meet the bar of _suitable for built-in cmdlets and similar foundational cmdlets_.\r\n\r\nProviding _higher-level convenience commands_ of general utility to be shared with other is a use case well worth supporting with an approved verb (@JohnLeyva's `Ensure-AzContext` above is an example).\r\n\r\n(And in terms of semantics I think we agree that _ensure_ is a broad, widely applicable concept.)\r\n\r\nIn your own example, having to name your external script `EnsureDiskspace` rather than `Ensure-DiskSpace`, just so you can avoid the presently unapproved to me makes matters worse. (And, if it is placed in `$env:PATH`, you wouldn't be able to find it with `Get-Command -Verb Ensure`.)\r\n\r\n",
      "created_at": "2020-01-31T15:37:42Z",
      "updated_at": "2020-01-31T15:37:42Z"
    },
    {
      "author": "SeeminglyScience",
      "author_association": "COLLABORATOR",
      "body": "> We can reasonably conceive of _public_ as _used by other people_, so I don't think an approved verb necessarily has to meet the bar of _suitable for built-in cmdlets and similar foundational cmdlets_.\r\n\r\nI'm not referring to \"a thing used by the public\" I'm referring to specifically a \"public API\".  If it's not a public API (i.e. is not exported in anyway), the concept of approved verbs is not as important.\r\n\r\n> In your own example, having to name your external script `EnsureDiskspace` rather than `Ensure-DiskSpace`, just so you can avoid the presently unapproved to me makes matters worse.\r\n\r\nThat's not the purpose of it, just a side effect.  Either way, PSSA being unable to determine whether a command is exported is not a good reason to include a verb that is mostly suitable for internal only use.\r\n\r\n> (And, if it is placed in `$env:PATH`, you wouldn't be able to find it with `Get-Command -Verb Ensure`.)\r\n\r\nIf it was in the path, then it would be an exported command and I would instead recommend a module that exports a `Set` and a `Test` version instead.",
      "created_at": "2020-01-31T16:15:17Z",
      "updated_at": "2020-01-31T16:15:17Z"
    },
    {
      "author": "mklement0",
      "author_association": "CONTRIBUTOR",
      "body": "> I'm not referring to \"a thing used by the public\"\r\n\r\nI understand. I'm saying that it is _useful and desirable to apply approved verbs to such things too_.\r\n\r\n> If it was in the path, then it would be an exported command and I would instead recommend a module that exports a Set and a Test version instead\r\n\r\nI think it's reasonable to want to  and desirable to be able to provide used-by-others higher-level convenience `Ensure-` commands - whether they are semi-public (used in a department / company) or even published to the PS gallery.\r\n\r\nIf what such commands do is to _ensure a desired state_, it should be possible to name them that - violating the naming guidelines more fundamentally with something like `EnsureAzContent` just to avoid PSSA warnings, at the expense of discoverability, is undesirable.\r\n\r\nTo be clear: I'm not suggesting we open the floodgates for many new verbs. The benefits of `Ensure` specifically are hopefully evident from the discussion.\r\n\r\nI hope that clarifies the difference in opinion - which comes down to what the scope of approved verbs is -  and I am happy to leave it  that.\r\n\r\n\r\n\r\n\r\n\r\n",
      "created_at": "2020-01-31T16:35:23Z",
      "updated_at": "2020-01-31T16:35:23Z"
    },
    {
      "author": "mklement0",
      "author_association": "CONTRIBUTOR",
      "body": "I hope the following clears up any confusion and presents clear, actionable choices.\r\n\r\n----\r\n\r\nWe've identified three layers of commands by the scope of their audience:\r\n\r\n* (a) _Private_ (internal) commands: module- or script-internal scripts and functions. They can be considered _implementation details_.\r\n\r\n* (b) Non-public _shared commands_: Commands that aren't published publicly (internet-wide) - at least not yet - but are shared by a group of users, such as  shared scripts and functions and commands from self-authored modules used in a given organization; users could be other scripters who build on these commands as well as end users.\r\nSuch commands are likely to include organization-specific wrappers for given commands as well as higher-level convenience commands that wrap multiple other commands.\r\n\r\n* (c) _Public_ (official and quasi-official) commands: Built-in commands, commands from official modules, (exemplary) modules published to public repositories. \r\n\r\nThe **_general_ question** it comes down to:\r\n\r\n* Should the list of approved verbs cover the needs of code in layer (c) exclusively, or should it cover (b) as well, _assuming that verbs of general interest can be identified there_?\r\n\r\n<sup>This is separate from the question whether `Ensure-*` commands have their place in (c) as well - which could be a new discussion if the consensus is that approved verbs should only apply to (c)</sup>\r\n\r\nIf the consensus ends up being that  (b) is in scope as well, the **_specific_ question** is:\r\n\r\n* Does `Ensure` as a verb, as  [described above](https://github.com/PowerShell/PowerShell/issues/11710#issuecomment-579544453), meet the bar of being both expressive and widely applicable?\r\n",
      "created_at": "2020-01-31T19:30:07Z",
      "updated_at": "2020-01-31T19:44:39Z"
    },
    {
      "author": "HumanEquivalentUnit",
      "author_association": "CONTRIBUTOR",
      "body": "> Also, a Start-* command shouldn't be assumed to be idempotent.\r\n\r\nDoes \"idempotent\" as a description usefully apply to commands with side effects? \r\n\r\nIs it your intent that Ensure- commands could be assumed to be \"idempotent\"? And if so, what does that mean? There's several cases mixed up; \"runs once, only if needed. Not more than once\" like start-process where you don't want many of them. \"Runs at least once, as many times as you like, it's safe\", like the Azure Context (`Enter-AzContext`?). \"can run as many times as you like, but preferably none because it's slow\", like the free disk space one. All wrapped in using exceptions for control flow (try to get this state, throw if you can't).\r\n\r\nAnd breaking the Noun part of Verb-Noun; new-process, get-process, start-process, but what does Ensure-Process actually ensure? You have to add a description to the end Ensure-ProcessHasCorrectLogonCredentials, Ensure-ProcessIsRunning, Ensure-ProcessExists. Would the pattern be to make parameters for what you are ensuring?\r\n\r\n> Throwing exceptions seems to over complicate the code,\r\n\r\n@JohnLeyva if there are no exceptions, you could call `Ensure-AzContext` and still have no context afterwards. That seems unhelpful, having an ensure which doesn't.",
      "created_at": "2020-02-14T03:43:42Z",
      "updated_at": "2020-02-14T03:43:42Z"
    },
    {
      "author": "mklement0",
      "author_association": "CONTRIBUTOR",
      "body": "> Does \"idempotent\" as a description usefully apply to commands with side effects?\r\n\r\nYes, with respect to the _end result_.\r\n\r\n>  And if so, what does that mean?\r\n\r\nIt means: ensure the desired state, doing whatever is necessary, if anything; fail only if the desired state cannot be achieved.\r\n\r\n> You have to add a description to the end Ensure-\r\n\r\nYes.\r\n\r\n> Would the pattern be to make parameters for what you are ensuring?\r\n\r\nYes, just as with any command.\r\n\r\n\r\n\r\n\r\n",
      "created_at": "2020-02-14T03:50:19Z",
      "updated_at": "2020-02-14T03:50:19Z"
    },
    {
      "author": "simonsabin",
      "author_association": "NONE",
      "body": "I agree that Ensure is needed and it is to support desired state. Every resource requires different logic to get to the desired state. It might be to delete and recreate, it might be to update it.\r\nHaving Ensure as a Verb allows module authors to create a module that wraps the complexity of getting something into the desired state.\r\n\r\nNew or Set with ignoring errors is a real bad form as it hides other errors that occur. You don't want to ignore all errors, just those due to the resource existing. Having Ensure makes code and intent much more explicit. \r\nNew implies I want a new one, but I don't want a New one if it already exists, I want the existing one. \r\n\r\nEnsure provides that semantics",
      "created_at": "2020-03-06T14:25:17Z",
      "updated_at": "2020-03-06T14:25:17Z"
    },
    {
      "author": "Alex-Yates",
      "author_association": "NONE",
      "body": "+1",
      "created_at": "2020-03-07T08:08:47Z",
      "updated_at": "2020-03-07T08:08:47Z"
    },
    {
      "author": "simonsabin",
      "author_association": "NONE",
      "body": "Wonder how to bump this to get the discussion going, seems to have died off. We still see this as very valuable",
      "created_at": "2020-10-26T09:13:20Z",
      "updated_at": "2020-10-26T09:13:20Z"
    },
    {
      "author": "pierrecoach",
      "author_association": "NONE",
      "body": "I have needed this Ensure verb  quite a lot. I do not need it to support desired system state, but desired execution conditions for the instructions that come just after.\r\nFor example when a connection can be dropped to the database or any other remote thing, instead of writing each time Connect-MyResource xxx -erroraction silentlycontinue or Start-Service yyyy -erroraction silentlycontinue, I would prefer Ensure-MyResourceIs xxx or Ensure-ServiceIsInState yyyy -state running",
      "created_at": "2021-02-01T20:28:45Z",
      "updated_at": "2021-02-01T20:28:45Z"
    },
    {
      "author": "gaelcolas",
      "author_association": "NONE",
      "body": "Although I don't disagree on the use case for an `Ensure` verb, I'm also one thinking \"do we really need this?\".\r\n\r\nI usually implement my `Set-` commands to have a `-Force` parameter, and a set would only set what's needed, unless `-Force` is used in which case I'd Set all properties anyway even if compliant.\r\n\r\nI find that a Class is a better contract than a command to implement Idempotency and the Get/Set/Test approach, and the DSC attributes allow to have greater consistency and checks at no extra costs (minus being ok with the class constructs).\r\nAnyway, from experience (with DSC), it's much better to separate the Get/Set commands in individual functions (if you implement [reasons](https://docs.microsoft.com/en-us/azure/governance/policy/how-to/guest-configuration-create), the test can be just a couple of lines).\r\nOnce I have that solid contract, I could use the `Invoke-DscResource` to Get/Set/Test, but I see how an `Ensure-DscResource` could be appealing.\r\nBut then, if you have written a class resource, the Ensure command would \"just\" call `Invoke-DscResource` for that resource for all three methods, so the `Ensure-YourThingy` command would be a proxy for that `Ensure-DscResource`...\r\n\r\nI think that alone is a good case for the `Ensure` verb.",
      "created_at": "2021-05-21T20:03:44Z",
      "updated_at": "2021-05-21T20:04:44Z"
    },
    {
      "author": "fMichaleczek",
      "author_association": "NONE",
      "body": "+1 I think I already vote on User Voice back in 2009 (private joke)",
      "created_at": "2021-06-08T10:32:58Z",
      "updated_at": "2021-06-08T10:32:58Z"
    },
    {
      "author": "Diom",
      "author_association": "NONE",
      "body": "I see a lot of value in an `Ensure` verb. It covers this pattern:\r\n\r\n~~~powershell\r\nfunction Ensure-X {\r\n  if(-Not (Test-X)){\r\n    Set-X\r\n  }\r\n  if(-Not (Test-X)){\r\n    Set-YAndThenX\r\n  }\r\n  Assert-X\r\n}\r\n~~~\r\n\r\nIf I call it once, actions are taken to give me my desired state. If I call it a second time the desired state is in place and no action needed.\r\n\r\nA solid example? `Ensure-CassandraClientDeployed`\r\n\r\nFor purity I cannot put it in \"New\" because that implies it is \"New\" meaning I now have two clients. I cannot put it in \"Set\" because it seems to suggest I am simply choosing which client is active.\r\n\r\nSo eveyone has to `Test-Pod cassandra-client` and if not `New-CassandraClient`. Can't even use `Deploy` because there is no `Undeploy`. With the advent of declarative approaches I would have liked to see this already added.",
      "created_at": "2022-01-31T22:13:24Z",
      "updated_at": "2022-01-31T22:13:24Z"
    }
  ],
  "created_at": "2020-01-28T20:45:54Z",
  "labels": [
    "Issue-Enhancement",
    "WG-Language",
    "Issue-Discussion"
  ],
  "number": 11710,
  "state": "open",
  "title": "Include the word Ensure as an approved Verb",
  "updated_at": "2022-01-31T22:13:24Z"
}