{
  "_url": "https://github.com/PowerShell/PowerShell/issues/11859",
  "author": "Quaentor",
  "body": "## Enhancement\r\n\r\nMake parameter `ValueFromPipelineByPropertyName` default to `$true`.\r\n\r\nThough, I'm not sure it won't cause hardship in some cases.\r\nAt least it seems rational and compelling.\r\n",
  "closed_at": "2020-02-17T09:18:50Z",
  "comments": [
    {
      "author": "jhoneill",
      "author_association": "NONE",
      "body": "It does seem rational and compelling to begin with. \r\n\r\nHowever. Because you don't know what objects might be piped into a command you don't know what might use a command parameter name as a property name. This would cause some objects to fail while others worked, and command the failure might be very subtle. e.g. I pipe objects which have \"Start\" or \"end\" as a property into a command and the values for \"Start and End\" parameters are now set which they weren't before. \r\n",
      "created_at": "2020-02-15T21:48:46Z",
      "updated_at": "2020-02-15T21:48:46Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "Yep. Typically there are only a few parameters which can be meaningfully used in a pipeline context when handling input.\r\n\r\nThere's a lot more to making a parameter work with the pipeline than _just_ the attribute. You have to code the function or cmdlet in a way that actually works with the pipeline, being sure to use the value in the `process{}` / `ProcessRecord()` areas and not the begin / end areas, where pipeline parameter values are not guaranteed to be defined.\r\n\r\nIt's opt-in because you have to specifically code the function or cmdlet to operate correctly and expect the values to be set at specific points; you can't just add the attribute and expect it to work automatically. As a result, making it opt-out and not opt-in would most likely just break quite a few commands rather than improving things. 🙂 ",
      "created_at": "2020-02-16T00:09:23Z",
      "updated_at": "2020-02-16T00:09:23Z"
    }
  ],
  "created_at": "2020-02-15T16:33:07Z",
  "labels": [
    "Issue-Question",
    "WG-Engine",
    "Resolution-Answered"
  ],
  "number": 11859,
  "state": "closed",
  "title": "Make ValueFromPipelineByPropertyName default to $true",
  "updated_at": "2020-02-17T09:18:50Z"
}