{
  "_url": "https://github.com/PowerShell/PowerShell/issues/11873",
  "author": "Liturgist",
  "body": "# Summary of the new feature/enhancement\r\n\r\nPowerShell has many Install-* commands. Yet, it does not seem that it can, in general, install applications. A recent issue in another project needed to install Microsoft SSMS.\r\n\r\nThere are -many- standards for installing software. NuGet, PyPI, Microsoft Software Center (Systems Center), etc.\r\n\r\nPowerShell should consolidate these.\r\n\r\n# Proposed technical implementation details (optional)\r\n\r\nInstall-Application should be able to run installer programs. (.exe, .msi, etc.)\r\nUninstall-Application should remove them, much like `Settings > Apps & features` does.\r\nYes, it should be cross platform and run on Linux, Mac, and Windows.",
  "closed_at": "2020-06-11T19:00:06Z",
  "comments": [
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "You can already use `Start-Process` or `Invoke-Item` to invoke an installer process.\r\n\r\nWhat more can you add without being yet another package management service?",
      "created_at": "2020-02-18T17:39:56Z",
      "updated_at": "2020-02-18T17:40:09Z"
    },
    {
      "author": "rjmholt",
      "author_association": "COLLABORATOR",
      "body": "> There are -many- standards for installing software. NuGet, PyPI, Microsoft Software Center (Systems Center), etc.\r\n> \r\n> PowerShell should consolidate these.\r\n\r\nI suspect that will [just create a new competing standard](https://xkcd.com/927/).\r\n\r\nI think the core points here are:\r\n\r\n- Something like this doesn't belong in the PowerShell engine, but would be better off as a module separate from PowerShell\r\n- Building and maintaining a package manager is a lot of work, and most of the work involves the ongoing maintenance of dependency conflicts rather than solving a one-off engineering problem\r\n  - And different packages and package managers have different ideas around packages and versions, so consolidating them is either going to be a leaky abstraction or of limited use\r\n- This has [already been attempted](https://github.com/OneGet/oneget)\r\n- PowerShell, being a shell, allows you to use your package manager of choice, and already installs through `brew`/`yum`/`dnf`/`apt` (i.e. the dominant package managers on macOS and Linux). There's also an MSIX package for installing through the Windows Store (and the [appx module](https://docs.microsoft.com/en-us/powershell/module/appx/?view=win10-ps))\r\n\r\n>  Uninstall-Application should remove them, much like Settings > Apps & features does.\r\n\r\nThis (something to manage applications registered in the Apps & Features panel) seems like a reasonable idea for a module as well. I don't know if one already exists, but I wouldn't be surprised.",
      "created_at": "2020-02-18T18:31:01Z",
      "updated_at": "2020-02-18T18:31:01Z"
    },
    {
      "author": "Liturgist",
      "author_association": "NONE",
      "body": "If OneGet was an attempt, in what ways did it fail?\r\n\r\nI thought that the intent of PowerShell was to be able to manage systems. Package management is a large part of system management.\r\n\r\nIf package management should not be in PowerShell, are there plans to split off things like Install-Module and Unisnstall-Module?",
      "created_at": "2020-02-19T16:21:03Z",
      "updated_at": "2020-02-19T16:21:03Z"
    },
    {
      "author": "rjmholt",
      "author_association": "COLLABORATOR",
      "body": "> If package management should not be in PowerShell, are there plans to split off things like Install-Module and Unisnstall-Module?\r\n\r\n`Install-Module`, `Uninstall-Module` and several other commands have never been part of the PowerShell engine, but are instead part of the [PowerShellGet module](https://github.com/PowerShell/PowerShellGet), which is shipped with standard PowerShell installations. There are no plans to change that, and in fact [there are big improvements planned for PowerShellGet](https://github.com/PowerShell/PowerShell-RFC/pull/237).\r\n",
      "created_at": "2020-02-19T16:36:11Z",
      "updated_at": "2020-02-19T16:36:11Z"
    },
    {
      "author": "SeeminglyScience",
      "author_association": "COLLABORATOR",
      "body": "> Install-Application should be able to run installer programs. (.exe, .msi, etc.)\r\n\r\nI'm not sure if you're actually talking about package management here (if you were, you can ignore this).\r\n\r\nTaking this at face value to mean you're asking for a cmdlet that you can point to a setup executable and have it figure out how to silently install it. That is unfortunately not feasible.  There are *many* different setup creation suites that all act pretty differently from each other.  Even if you can figure out which framework was used, there's still a few issues:\r\n\r\n1. If the framework includes global silent parameters, the setup creator can simply ignore them\r\n1. The setup could require additional product specific parameters that are often impossible to detect reliably\r\n1. If the setup creator added extra GUI steps to the install wizard, they often appear event with silent install parameters specified\r\n\r\nThat even applies to MSI installers.  I've had MSI's with `CustomAction`'s that show an unskippable GUI, or that require a public property to be set.\r\n\r\nOn top of that there are plenty of setup executables that are entirely custom, some that just don't have silent install parameters, and some that purposefully make it difficult to deploy.\r\n\r\nYou may think \"well yeah it won't work with badly made installers\" but it's a much bigger percentage than you'd think.  Plus even just the \"simple\" version of figuring out which framework was used and what it's silent install parameters are would be a monumental undertaking.\r\n\r\nAt the end of the day, *someone* has to figure out how to make the thing install, usually through either reading documentation or trial and error (and why package management is more or less the answer).",
      "created_at": "2020-02-19T19:22:56Z",
      "updated_at": "2020-02-19T19:22:56Z"
    },
    {
      "author": "kilasuit",
      "author_association": "COLLABORATOR",
      "body": "Whilst I don't like the newly announced winget (see https://github.com/microsoft/winget-cli) you can however make use of Chocolatey (https://chocolatey.org/) for what you want using either the chocolatey executable or this PowerShell Module (https://github.com/chocolatey-community/Chocolatey) do so the same.\r\n\r\nAlso as @SeeminglyScience this just isn't currently possible due to all the different packaging tools available\r\n\r\nand this ask \r\n> Yes, it should be cross platform and run on Linux, Mac, and Windows.\r\n\r\nis in my mind actually unfeasible and on Mac/Linux you should just use their tooling options available.\r\n\r\nCould you create a wrapper cmdlet for each of the packaging solutions and call it Install-Application - not without a serious amount of work that I'm not sure would provide all that much benefit overall \n\n<blockquote><img src=\"https://avatars2.githubusercontent.com/u/6154722?s=400&v=4\" width=\"48\" align=\"right\"><div><img src=\"https://github.githubassets.com/favicons/favicon.svg\" height=\"14\"> GitHub</div><div><strong><a href=\"https://github.com/microsoft/winget-cli\">microsoft/winget-cli</a></strong></div><div>Windows Package Manager CLI (aka winget). Contribute to microsoft/winget-cli development by creating an account on GitHub.</div></blockquote>\n<blockquote><img src=\"https://chocolatey.org/content/images/icon_slogan.png\" width=\"48\" align=\"right\"><div>Chocolatey</div><div><strong><a href=\"https://chocolatey.org/\">Chocolatey - The package manager for Windows</a></strong></div><div>Chocolatey is software management automation for Windows that wraps installers, executables, zips, and scripts into compiled packages. Chocolatey integrates w/SCCM, Puppet, Chef, etc. Chocolatey is trusted by businesses to manage software deployments.</div></blockquote>\n<blockquote><img src=\"https://avatars1.githubusercontent.com/u/49724500?s=400&v=4\" width=\"48\" align=\"right\"><div><img src=\"https://github.githubassets.com/favicons/favicon.svg\" height=\"14\"> GitHub</div><div><strong><a href=\"https://github.com/chocolatey-community/Chocolatey\">chocolatey-community/Chocolatey</a></strong></div><div>PowerShell Module and DSC Resource for Chocolatey Software - chocolatey-community/Chocolatey</div></blockquote>",
      "created_at": "2020-05-24T00:13:56Z",
      "updated_at": "2020-05-24T00:13:58Z"
    },
    {
      "author": "kilasuit",
      "author_association": "COLLABORATOR",
      "body": "The Issue title should really be edited to show what the Feature Request was as opposed to being just feature request",
      "created_at": "2020-05-24T00:14:50Z",
      "updated_at": "2020-05-24T00:14:50Z"
    },
    {
      "author": "msftbot[bot]",
      "author_association": "NONE",
      "body": "This issue has been marked as external and has not had any activity for **1 day**. It has been be closed for housekeeping purposes.",
      "created_at": "2020-06-11T19:00:05Z",
      "updated_at": "2020-06-11T19:00:05Z"
    }
  ],
  "created_at": "2020-02-18T17:14:08Z",
  "labels": [
    "Issue-Enhancement",
    "Resolution-Answered",
    "Resolution-External"
  ],
  "number": 11873,
  "state": "closed",
  "title": "Feature Request - (un)install-application",
  "updated_at": "2020-06-11T19:00:06Z"
}