{
  "_url": "https://github.com/PowerShell/PowerShell/issues/1189",
  "author": "mirichmo",
  "body": "# Overview\r\n\r\nIt is desirable to have each instance of PowerShell log ETW events to its own instance-specific event log rather than re-using the existing inbox PowerShell event log. To do this, each instance of PowerShell must register its event manifest with ETW and carry its own copy of PSEvents.dll (assuming it differs from the inbox version of the file).\r\n# Changes Required\r\n1. Port PSEvents.dll to GitHub. The big step here is to create PSEvents.dll from the manifest\r\n2. Generate a unique GUID and name for the event provider during each major or minor release. These values must be saved in Microsoft-Windows-PowerShell-Instrumentation.man.\r\n3. Create a post-install script or cmdlet to register the event provider with ETW using wevtutil.exe\r\n# Open Issues:\r\n1. wevtutil.exe should be supported on all Windows OSs, but it might now work on Nano Server. How do we support event registration in that case?\r\n2. More investigation is required to determine the process for generating PSEvents.dll in GitHub. SD produces it automatically for us based on a macro.\r\n3. A non-Windows eventing or logging solution should be researched as well.\r\n",
  "closed_at": "2019-07-25T16:56:12Z",
  "comments": [
    {
      "author": "dantraMSFT",
      "author_association": "CONTRIBUTOR",
      "body": "@mirichmo I don't think it's viable to change the provider guid every minor and/or major release.  Monitoring teams will be reluctant to have to keep rev'ing.\r\nAs far as PSEvents generation; we did this DSC; I'll dig out the necessary build pieces.",
      "created_at": "2017-10-19T23:57:22Z",
      "updated_at": "2017-10-19T23:57:22Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "@SteveL-MSFT  It seems we could close the issue.",
      "created_at": "2019-07-11T13:00:25Z",
      "updated_at": "2019-07-11T13:00:25Z"
    }
  ],
  "created_at": "2016-06-23T22:17:15Z",
  "labels": [
    "Issue-Enhancement",
    "Area-SideBySide",
    "Resolution-Answered"
  ],
  "number": 1189,
  "state": "closed",
  "title": "Eventing Support for PowerShell (PSEvents.dll)",
  "updated_at": "2019-07-25T16:56:26Z"
}