{
  "_url": "https://github.com/PowerShell/PowerShell/issues/11908",
  "author": "jomonson",
  "body": "# Summary of the new feature/enhancement\r\n\r\nThe ability to provide an InitialSessionState along with WSManConnectionInfo when creating RunspacePool.\r\n\r\nI need this in order to share methods/code (not data) across **remote sessions**. \r\nToday I pre-run every generated PowerShell.Create() session with an initialization script to define the methods, and that takes a while for every session created. \r\nIs there a way to statically load this code on future generated sessions?\r\n\r\nThe only reference I found for the issue is this from 2014:\r\nhttps://stackoverflow.com/questions/26275700/why-there-is-no-way-to-pass-initialsessionstate-for-a-remote-runspacepool#_=_",
  "closed_at": "2020-04-30T03:45:57Z",
  "comments": [
    {
      "author": "jomonson",
      "author_association": "NONE",
      "body": "@iSazonov Am I misusing the API or is this a real gap in the existing API?",
      "created_at": "2020-03-03T09:15:31Z",
      "updated_at": "2020-03-03T09:15:31Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "@PaulHigin Could you please comment? Is this by-design limitation?",
      "created_at": "2020-03-03T12:41:22Z",
      "updated_at": "2020-03-03T12:42:04Z"
    },
    {
      "author": "PaulHigin",
      "author_association": "COLLABORATOR",
      "body": "The way PowerShell remoting handles session state configuration is through remoting endpoint configuration.  You use the `New-PSSessionConfigurationFile` cmdlet to define the initial session state and then `Register-PSSessionConfiguration` to create the endpoint on the target machine.  Then `New-PSSession -ConfigurationName` to connect to the configured endpoint.  This way the initial state information is defined once on each target machine, rather than being transferred from client to target for each remote session instance.\r\n\r\nIf you want to create custom state on a per session instance basis, you currently need to do that manually by running script after connecting to the target (as you are now doing).  But that is not creating an initial state, and instead is updating it after the session is created.\r\n\r\nWe can think about a new feature that passes initial state configuration data during remote session creation, but that would entail a protocol change.",
      "created_at": "2020-03-03T16:37:51Z",
      "updated_at": "2020-03-03T16:37:51Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": ">  that would entail a protocol change.\r\n\r\n@jomonson It is unreal. This is a long process and it violates backward compatibility. \r\n",
      "created_at": "2020-03-03T16:58:54Z",
      "updated_at": "2020-03-03T16:58:54Z"
    },
    {
      "author": "jomonson",
      "author_association": "NONE",
      "body": "@PaulHigin thanks for the detailed response. Sometimes it is not possible to position a file within a remote machine. Or there is not guarantee that this file will stay. That is the main issue with the pssessionconfiguration file. Can I leverage this feature without transferring files to the remote machine? For example can I invoke an initialization script block (startup script) without passing it as a ps1 file to be held in the remote machine? I saw that I can Set-PSSessionConfiguration but it expects a file path and not a blob of text. ",
      "created_at": "2020-03-03T21:55:46Z",
      "updated_at": "2020-03-03T21:55:46Z"
    },
    {
      "author": "PaulHigin",
      "author_association": "COLLABORATOR",
      "body": "Well, remoting endpoints require prior access to the target machine, and you run `Register-PSSessionConfiguration` there.  It creates a (*.pssc) configuration file in the %windir%\\System32\\WindowsPowerShell\\v1.0\\SessionConfig directory, and that needs to persist in order for the endpoint to work.\r\n\r\nBut as I mentioned, it would be possible to send the configuration data (what is now contained in the *.ppsc file) over the wire during a connection request, and so no prior access to the target is required, and no file is stored on the target.\r\n\r\nI think this is a reasonable feature request, and I'll tag it for committee review.  It is not trivial and requires a change to the protocol.  Also it only affects PowerShell session configuration, and not anything related to the WinRM host (like alternate accounts such as virtual or GMSA).  One thing I like about it is that it is transport agnostic and can be used for SSH based remoting as well as WinRM remoting.",
      "created_at": "2020-03-03T22:48:22Z",
      "updated_at": "2020-03-03T22:48:22Z"
    },
    {
      "author": "JamesWTruher",
      "author_association": "MEMBER",
      "body": "Can we get an example of what the user experience is?",
      "created_at": "2020-03-25T21:59:38Z",
      "updated_at": "2020-03-25T21:59:38Z"
    },
    {
      "author": "PaulHigin",
      "author_association": "COLLABORATOR",
      "body": "Something like:\r\n\r\n```powershell\r\n$iss = [initialsessionstate]::CreateFromSessionConfigurationFile(c:\\mySessionConfig.pssc)\r\n$rs = [runspacefactory]::CreateRunspace($connectionInfo, $iss)\r\n$rs.Open()\r\n$ps = [powershell]::Create($rs).AddScript($script).Invoke()\r\n```\r\n\r\nOr:\r\n```powershell\r\n$session = New-PSSession -ConfigurationFile c:\\MySessionConfig.pssc\r\nInvoke-Command -Script { ... } -cn <targetName> -ConfigurationFile c:\\MySessionConfig.pssc\r\n```",
      "created_at": "2020-03-26T15:19:05Z",
      "updated_at": "2020-03-26T15:19:05Z"
    },
    {
      "author": "joeyaiello",
      "author_association": "CONTRIBUTOR",
      "body": "@jomonson saw that you were MSFT internal, and I wanted to reach out offline to understand your scenario better, but I couldn't find you. Is it possible you can explain at a higher level what you're trying to accomplish with this? ",
      "created_at": "2020-04-17T18:55:01Z",
      "updated_at": "2020-04-17T18:55:01Z"
    },
    {
      "author": "jomonson",
      "author_association": "NONE",
      "body": "Hey @joeyaiello, \r\n\r\nI left Microsoft not long ago, so if you can't find me it means they've done something right on that part 💯 \r\n\r\nI'm trying to manage remote machines via WinRM using custom PowerShell code I've written. I wish to pre-load this code to these machines so that when I connect to them (using a RunspacePool) I can immediately invoke the relevant functions. \r\n\r\nI don't want to explicitly pass-over files (configuration files or others) that contain this code directly to these machines, because that would require me to manage and 'baby sit' these files. Moreover these files might be meddled with by other users of these machines. Lastly it's yet another footprint on the remote machines that I'd like to avoid.\r\nLooking into @PaulHigin's example, today I need to transfer the `mySessionConfig.pssc` on the source machine to all other remote machines to `c:\\mySessionConfig.pssc`, or otherwise move it directly to `%windir%\\System32\\WindowsPowerShell\\v1.0\\SessionConfig` but that seems like an implementation detail of PowerShell that I should not be aware of. It also might be a source of issues for when I'm dealing with varying PowerShell versions and operating systems.\r\n\r\nToday I find myself idem-potentically redefining these functions on every connection I make to the remote machines and that decreases performance. In addition, checking whether these functions already exist is sometimes a redundant IO procedure with some latency.\r\n\r\nI liked @PaulHigin's idea by which the InitialState information/custom code is auto-magically passed over to the remote machine and persisted to the right location, without me needing to worry about creating the file in advance in the remote machine. By the way, it seems like this feature is already working when dealing with PowerShell session in the local machine - the interface allows specifying InitialState information when not using WSManConnectionInfo.\r\n\r\nI hoped I could explain my motivation better. If not I'm glad to talk about it more.",
      "created_at": "2020-04-17T21:04:58Z",
      "updated_at": "2020-04-17T21:07:59Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "@PowerShell/powershell-committee reviewed this, such a change would require a protocol change and we are not contemplating any protocol changes.",
      "created_at": "2020-04-29T22:46:11Z",
      "updated_at": "2020-04-29T22:46:11Z"
    }
  ],
  "created_at": "2020-02-20T22:10:56Z",
  "number": 11908,
  "state": "closed",
  "title": "REQ: Ability to provide initial session configuration with New-PSSession",
  "updated_at": "2020-04-30T03:45:57Z"
}