{
  "_url": "https://github.com/PowerShell/PowerShell/issues/11932",
  "author": "doctordns",
  "body": "# Summary of the enhancement\r\n\r\nWith RC3 comes the compatibility deny list to stop modules we know can't work in PWSH7 from being loaded. There are currently three modules in the deny list. I believe this is a great feature that stops the user from seeing things they can't fix. \r\n\r\nI would like to suggest adding **AzureAD** and **ExchangeOnline** modules to the deny list. \r\n\r\nAs noted in #11903, the AzureAD module results in errors when used. It is better to just not load them than to expose the user to the results of incompatibility.  The Exchange Online module also fails in the same way. If you add this module, then adding the MSOnline module too. While MSOnline is 'old'. it is I am sure in use.  \r\n\r\nNot allowing modules we know do not work seems a safer approach.\r\n\r\n# Proposed technical implementation details (optional)\r\n\r\nAdd ExchangeOnline, AzureAD modules to the deny list.\r\nConsider adding MSOnline\r\n",
  "closed_at": null,
  "comments": [
    {
      "author": "alexandair",
      "author_association": "CONTRIBUTOR",
      "body": "Both, AzureAD and ExchangeOnlineManagement modules work in PowerShell 7 RC3 (see attached images).\r\n<img width=\"554\" alt=\"AzureAD\" src=\"https://user-images.githubusercontent.com/3135708/75112568-65ddfa80-5645-11ea-9a6a-bfe610bbb6b6.png\">\r\n<img width=\"623\" alt=\"ExchangeOnlineManagement\" src=\"https://user-images.githubusercontent.com/3135708/75112576-6c6c7200-5645-11ea-8ebb-da7962dc794a.png\">\r\n",
      "created_at": "2020-02-23T13:05:10Z",
      "updated_at": "2020-02-23T13:05:10Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "/cc @anmenaga for information",
      "created_at": "2021-01-16T05:13:00Z",
      "updated_at": "2021-01-16T05:13:00Z"
    },
    {
      "author": "sassdawe",
      "author_association": "NONE",
      "body": "I've just ran into this.\r\n\r\nThe `AzureAD` module was imported fine without `-UseWindowsPowerShell`, but then I got a cryptic `could not load type` error when I tried `Connect-AzureAD`... Google led me here, so I tried again using `-UseWindowsPowerShell`, and it worked \\o/\r\n\r\nNaturally, after successfully connecting to AzureAD I wanted to use a method which was left off thanks to the deserialization.\r\n\r\nI get that these modules are _importable_ by PowerShell but **I agree with the idea** to put them on the Deny list, and that's what I'm going to do on the machines I manage, because deserialization breaks all my scripts. \r\n ",
      "created_at": "2021-05-10T07:14:07Z",
      "updated_at": "2021-05-10T07:14:07Z"
    },
    {
      "author": "JAK1047",
      "author_association": "NONE",
      "body": "From my company's internal contact with Microsoft we have been instructed that there are no current intentions to make the AzureAD module core compatible as the current goal is a replacement by the MS.Graph module. As for ExchangeOnline that has of course already been replaced by the EXO V2 module of ExchangeOnlineManagement which is already core compatible.\r\n\r\nBoth work when imported using compatibility to load them in Windows Powershell, but just wanted to share that information in case anyone else stumbles across this thread since the future compatibility of the AzureAD module seems to be a popular subject.",
      "created_at": "2021-05-11T00:45:17Z",
      "updated_at": "2021-05-11T00:45:17Z"
    },
    {
      "author": "kilasuit",
      "author_association": "COLLABORATOR",
      "body": "Instead of adding them to a deny list we could improve potentially the logic in Import-Module to auto import them using the `-UseWindowsPowerShell` parameter & mitigate the user having to call that themselves.\r\nPossibly not the cleanest way to do it but resolves users needing to remember to do so but would make the user journey more consistent with original designs that it will do what it can to make users lifes easier ",
      "created_at": "2021-11-17T20:31:47Z",
      "updated_at": "2021-11-17T20:31:47Z"
    },
    {
      "author": "sassdawe",
      "author_association": "NONE",
      "body": "> Instead of adding them to a deny list we could improve potentially the logic in Import-Module to auto import them using the `-UseWindowsPowerShell` parameter & mitigate the user having to call that themselves. \r\n\r\nSome of object which are being returned by **AzureAD** could be impacted by the deserialization which makes their usage less than idea, l so I stopped using it with PowerShell 7. This could be on thing to consider. \r\n",
      "created_at": "2021-11-17T20:55:19Z",
      "updated_at": "2021-11-17T20:55:19Z"
    },
    {
      "author": "doctordns",
      "author_association": "COLLABORATOR",
      "body": "I have elsewhere suggested that the startup JSON have a section listing modules we KNOW have to be loaded using compatibilty mode.  This would look much like the current DENY list, but listing modules which Import-Module will by default load using compatibility mode.\r\n\r\nThere are regular issues in this repo raised when modules don't load normally, but work fine if you use `-UseWindowsPowerShell` - It would be nice to get a more elegant solution. ",
      "created_at": "2021-11-18T16:21:40Z",
      "updated_at": "2021-11-18T16:21:40Z"
    }
  ],
  "created_at": "2020-02-23T12:38:00Z",
  "number": 11932,
  "state": "open",
  "title": "Add ExchangeOnline and AzureAD modules to Compatibility Deny list",
  "updated_at": "2021-11-18T16:21:40Z"
}