{
  "_url": "https://github.com/PowerShell/PowerShell/issues/1195",
  "author": "mirichmo",
  "body": "# Overview\n\nThis is a work-in-progress list of features that have been investigated and determined to not require modification for side-by-side scenarios. I am creating this issue to document the list and reasoning behind the decisions.\n# Pwrshsip.dll\n\nThis is the Crypto Subject Interface Package (SIP) provider for handling Authenticode signature verification for all signed files PowerShell supports (psd1, psm1, etc.). The provider is loaded by the Authenticode verification system and only one instance should exist in Windows. It is installed via manifest on all Windows SKUs where PowerShell ships inbox. If we need to add additional file types for Authenticode signature verification, we can create a new SIP provider and install it side-by-side with the existing one. The new provider will only support the new file types.\n",
  "closed_at": "2017-06-07T20:55:41Z",
  "comments": [
    {
      "author": "ferventcoder",
      "author_association": "NONE",
      "body": "@mirichmo just discovered what may be a known issue in PowerShell for checking the authenticode signature if the file has Unix line endings (`LF`) - https://github.com/PowerShell/PowerShell/issues/3361",
      "created_at": "2017-03-17T20:20:28Z",
      "updated_at": "2017-03-17T20:20:28Z"
    },
    {
      "author": "joeyaiello",
      "author_association": "CONTRIBUTOR",
      "body": "@mirichmo is this still needed? If not, I'm assigning to you to close. ",
      "created_at": "2017-05-22T23:20:37Z",
      "updated_at": "2017-05-22T23:20:37Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "Closing this.  If there are specific issues with authenticode, please open separate issues.",
      "created_at": "2017-06-07T20:55:41Z",
      "updated_at": "2017-06-07T20:55:41Z"
    }
  ],
  "created_at": "2016-06-23T23:33:56Z",
  "number": 1195,
  "state": "closed",
  "title": "Features that Do Not Require Modification",
  "updated_at": "2017-06-07T20:55:41Z"
}