{
  "_url": "https://github.com/PowerShell/PowerShell/issues/12065",
  "author": "ohlssrog",
  "body": "# Summary of the new feature/enhancement\r\nWhere is the ActiveDirectory modules for Linux PS and does PS 7 support Windows Admin Center?\r\n\r\n<!-- \r\nA clear and concise description of what the problem is that the new feature would solve.\r\nTry formulating it in user story style (if applicable):\r\n'As a user I want X so that Y.' with X being the being the action and Y being the value of the action.\r\n-->\r\n\r\n# Proposed technical implementation details (optional)\r\n\r\n<!-- \r\nA clear and concise description of what you want to happen.\r\nConsider providing an example PowerShell experience with expected result.\r\n-->\r\n",
  "closed_at": "2020-03-14T17:32:54Z",
  "comments": [
    {
      "author": "doctordns",
      "author_association": "COLLABORATOR",
      "body": "My understanding is that the AD cmdlets do not run natively on non-Windows platforms. And if this is to happen, it is the AD Team that, probably, would need to do the work.\r\n\r\nThe workaround is to use remoting and execute the cmdlets on a DC.",
      "created_at": "2020-03-07T11:54:09Z",
      "updated_at": "2020-03-07T11:54:39Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "Yep, the APIs used by the ActiveDirectory module do not function under Linux and likely never will, unless someone wants to add similar capabilities into the Linux operating systems and/or kernel itself.\r\n\r\nAt least, that's my understanding. The ActiveDirectory team(s) may have some ideas how that could be worked around. One possible idea is to rewrite the module to work with PSRemoting to the DC instead of using platform-specific protocols to communicate with the DC, but that is at best a blind guess. I've not had the chance to really look through the source code, and I'm not sure we ever will (I don't think it's been published anywhere, least not that I've been able to find up till now).\r\n\r\nAs a result, this discussion is kind of moot and entirely reliant on the ActiveDirectory team to figure something out, as it were. 🙂 \r\n\r\nI hope that answers some of your questions, but the PowerShell team themselves don't maintain or probably even have access to this module's source code, so all they can do is poke the AD team(s) and ask them to Git Gud(tm). 😄 ",
      "created_at": "2020-03-08T01:25:45Z",
      "updated_at": "2020-03-08T01:26:09Z"
    }
  ],
  "created_at": "2020-03-07T10:33:42Z",
  "number": 12065,
  "state": "closed",
  "title": "Where is the AD modules an AdminCenter",
  "updated_at": "2020-03-14T17:32:54Z"
}