{
  "_url": "https://github.com/PowerShell/PowerShell/issues/12142",
  "author": "vurso",
  "body": "Operating system:  Windows 10 Professional (latest updates)\r\n\r\nDefault PowerShell version 5.x already installed (works fine)\r\nPowerShell 7 latest release (has issues)\r\n\r\nWhen attempting to run the following command in PowerShell 7 terminal (admin mode) the terminal just hangs waiting for a response which I believe is a popup modal to sign into Azure - this works fine with the current PowerShell version (5.x) i.e. the modal appears (see attached screenshot) but the same does not happen with PowerShell 7.\r\n\r\n![image](https://user-images.githubusercontent.com/997532/76855447-11dfc380-6849-11ea-9952-82c69bd45462.png)\r\n",
  "closed_at": "2020-03-24T07:00:14Z",
  "comments": [
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "This is an issue with the module itself and the API it's trying to use, which is simply not available on all platforms, and it appears it's not available or at least functional in .NET Core at all. As a result, it's not going to be properly compatible with pwsh. If the API is not available in .NET Core, they'll need to find an alternative way to handle that authentication method.\r\n\r\nI'm not entirely sure which command you're using, it's obscured in the screenshot, but you'll need to file this issue on [the module's repo](https://github.com/Azure/azure-powershell); there's nothing PowerShell itself can do about the .NET APIs that a module chooses to use.",
      "created_at": "2020-03-17T12:59:33Z",
      "updated_at": "2020-03-17T13:00:14Z"
    },
    {
      "author": "msftbot[bot]",
      "author_association": "NONE",
      "body": "This issue has been marked as external and has not had any activity for **1 day**. It has been be closed for housekeeping purposes.",
      "created_at": "2020-03-24T07:00:12Z",
      "updated_at": "2020-03-24T07:00:12Z"
    }
  ],
  "created_at": "2020-03-17T12:16:07Z",
  "number": 12142,
  "state": "closed",
  "title": "Connect to Azure cmdlet doesn't work",
  "updated_at": "2020-03-24T07:00:14Z"
}