{
  "_url": "https://github.com/PowerShell/PowerShell/issues/12196",
  "author": "Kriegel",
  "body": "The .NET build in Hash Algorithms are not the fastest.\r\nIn Times where Datasize is rising we need VERY fast Hash Algorithms.\r\n\r\nThere are many .NET libraries out there which creating Hash Algorithms  Classe which are following the .NET interface Standards.\r\n\r\nSo it can be easy to feed in a HashAlgorithm Object to the Get-FileHash cmdlet.\r\n\r\n\r\nFor Example I am using the very fast xxHash from this Repository:\r\nhttps://github.com/brandondahler/Data.HashFunction\r\nPseudo example code ahead!\r\n\r\n```powershell\r\n# adding .NET core type for the xxHash algorithm\r\nAdd-Type -Path 'A:\\PowerShell-Code\\HashFunction\\Data.HashFunction\\netstandard1.1\\OpenSource.Data.HashFunction.xxHash.dll'\r\n\r\n# creating xxHash instance\r\n$xxHash = [OpenSource.Data.HashFunction.xxHash.xxHashFactory]::Instance.Create()\r\n\r\n# using Get-Filehash wit xxHash algorithm instance\r\nGet-FileHash -Path C:\\temp\\testfile.txt -InputHash $xxHash\r\n```\r\n\r\n\r\n\r\n  ",
  "closed_at": "2020-03-26T12:00:10Z",
  "comments": [
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": ".Net Runtime exposes _cryptography strong implementation_. PowerShell uses the implementation so that users can trust it in any scenario. Any performance issues with the implementation should be discussed and addressed in .Net Runtime repo.\r\n\r\nIf users have scenarios where they do not need cryptography strong implementation but higher performance they can install and use other libraries.\r\n\r\nPowerShell could get benefits from such library including it in engine only if there is _real and important business scenario_.\r\n",
      "created_at": "2020-03-24T16:50:00Z",
      "updated_at": "2020-03-24T16:50:00Z"
    },
    {
      "author": "Kriegel",
      "author_association": "NONE",
      "body": "To compare backed up files, source and destination, or  to find duplicates there is no need for cryptographic strong algorithms.\r\nBecause they are cryptographic strong they are slower than the non cryptographic strong algorithms.\r\n\r\nMy .NET skills are not so good ...\r\nSo I currently write an PowerShell Module to implement these non cryptographic strong algorithms.\r\n\r\nI Like the idea to widen the usecase of an cmdlet with objects wich support the standard interface\r\nin addition to extend PowerShell with Modules so we can extend it with standardized Objects.\r\n",
      "created_at": "2020-03-24T17:10:37Z",
      "updated_at": "2020-03-24T17:11:31Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "> So I currently write an PowerShell Module to implement these non cryptographic strong algorithms.\r\n\r\nCurrent workflow for extending PowerShell is to publish new module to PowerShellGet site and look uses. If there will be popular scenario the module or cmdlet can be included in the repo.\r\n\r\n> I Like the idea to widen the usecase of an cmdlet with objects wich support the standard interface\r\nin addition to extend PowerShell with Modules so we can extend it with standardized Objects.\r\n\r\nI have a concern that we can not dynamically load non-trusted third-party library in core cmdlets.\r\n\r\n> To compare backed up files, source and destination, or to find duplicates there is no need for cryptographic strong algorithms.\r\n\r\nHere is two scenario. (1) We could discuss this in another issue. We have an issue Copy-Item to get robocopy features. In the case we have no need to have many hash algorithms - just one. (2) Compare files. Again another issue. We could discuss Compare-File, as raw byte by byte, as text, as hash. (3) We could discuss in another issue enhancement of Get-Item to add a hash property in FileInfo.",
      "created_at": "2020-03-24T17:35:37Z",
      "updated_at": "2020-03-24T17:35:37Z"
    },
    {
      "author": "Kriegel",
      "author_association": "NONE",
      "body": "To use Copy-Item to compare or Hash files, follows not the monadology.\r\nA seperate cmdlet is needed here.\r\n\r\nWith support of only cryptography strong algorithms I think the use cases of Get-FileHash are intended to only support a 1 main usecase.\r\nChecking against malicious changes.\r\nData Integrity is only a byproduct. \r\n\r\nWith support for non cryptography strong algorithms Get-FileHash can be used for that in a faster manner.\r\n\r\n> I have a concern that we can not dynamically load non-trusted third-party library in core cmdlets.\r\nI see that point. But cannot see any security issue, compared to loading and usinf any other .NET dll in PowerShell.  \r\n\r\n@iSazonov I appreciate your inputs. Thank you. *hug*\r\nPlease let this issue hang around a while to catch other voices.",
      "created_at": "2020-03-24T18:18:16Z",
      "updated_at": "2020-03-24T18:18:16Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "> To use Copy-Item to compare or Hash files, follows not the monadology.\r\nA seperate cmdlet is needed here.\r\n\r\nWe could optimize `Copy-Item -ToSession` scenario to avoid coping files to remote system.\r\nYou can open new issue to discuss this.\r\n\r\nRoboCopy tracking issue #2581\r\n\r\n> With support of only cryptography strong algorithms I think the use cases of Get-FileHash are intended to only support a 1 main usecase.\r\nChecking against malicious changes.\r\nData Integrity is only a byproduct.\r\n\r\nNo. It is addressed _all_ scenarios in way which users can trust to.\r\nSpecific scenarios could be optimized for performance. Such scenarios need to be clearly identified and tested to avoid functional and security issues.\r\n\r\n> Please let this issue hang around a while to catch other voices.\r\n\r\nIf you want a progress don't think only about Get-FileHash - think about _specific scenarios_ like I mentioned (and others) and open tracking issues to discuss possible solutions in which you are interested. World wide issue makes no sense (You can see a lot of such ones in the repo without any progress).\r\n",
      "created_at": "2020-03-25T04:11:14Z",
      "updated_at": "2020-03-25T04:13:08Z"
    },
    {
      "author": "msftbot[bot]",
      "author_association": "NONE",
      "body": "This issue has been marked as answered and has not had any activity for **1 day**. It has been closed for housekeeping purposes.",
      "created_at": "2020-03-26T12:00:09Z",
      "updated_at": "2020-03-26T12:00:09Z"
    }
  ],
  "created_at": "2020-03-24T16:10:54Z",
  "number": 12196,
  "state": "closed",
  "title": "Get-FileHash add parameter to feed in an HashAlgorithm Object",
  "updated_at": "2020-03-26T12:00:10Z"
}