{
  "_url": "https://github.com/PowerShell/PowerShell/issues/12482",
  "author": "vexx32",
  "body": "# Code\r\n\r\nhttps://github.com/PowerShell/PowerShell/blob/b7cb335f03fe2992d0cbd61699de9d9aafa1d7c1/src/Microsoft.PowerShell.Commands.Management/commands/management/ComputerUnix.cs#L1-L159\r\n\r\nI have several questions on these cmdlets... Below is a summarised list of issues with the current code.\r\n\r\n## 1. There is no null check for `_process.Dispose()` in the cmdlets' `Dispose()` methods\r\n\r\n... despite the fact that the test hook quite clearly prevents `_process` from ever being set if it's enabled. I'm almost as confused by this as I am by the fact that this doesn't make tests fail -- I suspect it's simply taking long enough to call its Dispose() method that the test it was executing inside of has already completed and the error goes unnoticed.\r\n\r\n## 2. The internal `RunCommand()` method has multiple design issues\r\n\r\nThe parameters it exposes are _never used_, and it uses hardcoded values instead.As a result, the different parameters provided by `Stop-Computer` and `Restart-Computer` are completely ignored, and thus the two commands do the exact same thing.\r\n\r\n## 3. The testing method.\r\n\r\nI acknowledge that it is rather difficult to test stopping/restarting a computer without causing interruptions in the test pipeline, but the current state of tests simply don't test _anything_ apart from basic parameter binding, since all other functionality in the cmdlet is completely skipped when the test hook is enabled.\r\n\r\nWe need a more robust way of testing these cmdlets; I think the lack of adequate tests is part of the reason the issues in these cmdlets went unnoticed.\r\n\r\n## 4. `IDisposable` is not implemented properly\r\n\r\nAccording to the documented [recommended pattern](https://docs.microsoft.com/en-us/dotnet/standard/garbage-collection/implementing-dispose) there are two additional members that should be implemented as part of the IDisposable pattern, so that multiple calls to Dispose() effectively no-op after the first call.\r\n\r\n# Related Issues/PRs\r\n\r\n#5448 and #11151\r\n\r\n---\r\n\r\nThis code is still present in the current master branch of the repo and was included in 7.1-preview1, but it's still very much unfinished. Are there plans to finish it, at least to a minimum viable product?",
  "closed_at": null,
  "comments": [],
  "created_at": "2020-04-24T19:34:41Z",
  "number": 12482,
  "state": "open",
  "title": "Design Issues in Unix versions of Stop/Restart-Computer cmdlets",
  "updated_at": "2021-01-16T10:45:15Z"
}