{
  "_url": "https://github.com/PowerShell/PowerShell/issues/12488",
  "author": "jhoneill",
  "body": "# Summary of the new feature/enhancement\r\n\r\nMy exact use case is:\r\nI have a series of commands in my history which I want to run one after another for example\r\n```\r\nstop-x\r\ncopy-xlog\r\ndelete-xlog\r\nstart-x\r\n```\r\nThese might be 101,102,103,104 in the history \r\n\r\none might expect to be able to run either \r\n`101..104 | invoke-history`\r\nor \r\nIhy 101,102,103,104\r\n\r\nThe former causes an error\r\n`Invoke-History: The input object cannot be bound to any parameters for the command either because the command does not take pipeline input `\r\nand then invokes the previous command\r\n\r\nThe latter causes an error `Invoke-History: Cannot convert 'System.Object[]' to the type 'System.String'`\r\n\r\nIdeally any cmdlet should support its \"target\" * coming from the pipeline and support a comma-separated list of targets.  A few which could, don't, without an obvious reason to be an exception.  This is a proposal to fix one of those.\r\n \r\n\\* Target being the parameter telling the command what to work **on**, where other parameters  the command **how** the work should be done",
  "closed_at": null,
  "comments": [
    {
      "author": "p0W3RH311",
      "author_association": "NONE",
      "body": "So. You know that thing in PowerShell where you have small composable cmdlets ? And you put two or more together to get the result you want.  It's value is absolutely tiny \r\n\r\n`10,11,15  | % {Invoke-History -Id $_ }`",
      "created_at": "2020-04-25T11:57:40Z",
      "updated_at": "2020-04-25T11:57:40Z"
    },
    {
      "author": "jhoneill",
      "author_association": "NONE",
      "body": "> So. You know that thing in PowerShell where you have small composable cmdlets ? And you put two or more together to get the result you want. It's value is absolutely tiny\r\n> \r\n> `10,11,15 | % {Invoke-History -Id $_ }`\r\n\r\nThat's what I did, obviously. \r\n\r\n `$list | foreach {  Do-something -target  $_ }  `   is a work round for a poorly designed command i.e. one that does not support the pipeline when it _could_, and is not, itself, composable.   \r\nThere is nothing wrong with code which says \r\n```\r\n$x = Command1\r\nCommand2 -Target $x \r\n```\r\nBut one should be able to write `Command1 | command2`  that's  one of the founding principles of the language. Similarly there is nothing wrong with \r\n```\r\nCommand -Target item1\r\nCommand -Target item2\r\nCommand -Target item3\r\n```\r\nif that is how one chooses to write it. But `Command -Target item1, item2, item3 ` should be supported. Commands which don't work that way are the aberrations: that shouldn't need explaining. \r\n\r\nSimilarly the principle is not to build sorting or formatting or exporting into commands which are part of the language. Especially when they are simple to add as a functions being `X  <params> | Y <params> ` ",
      "created_at": "2020-04-25T14:56:53Z",
      "updated_at": "2020-04-25T14:56:53Z"
    },
    {
      "author": "p0W3RH311",
      "author_association": "NONE",
      "body": " _one should be able to write Command1 | command2 that's one of the founding principles of the language_\r\n\r\nput two or more cmdlet together to get the result you want..its thee principle of this language\r\n\r\n_Especially when they are simple to add as a functions being X <params> | Y <params>_\r\n\r\nyes i am with you  but  with _invoke-history_  It's value is absolutely tiny",
      "created_at": "2020-04-25T15:31:55Z",
      "updated_at": "2020-04-25T15:32:24Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "Let's not get off topic and bring other discussions that aren't really related to the issue at hand, please. :blush: \r\n\r\nI don't see any reason that Invoke-History _shouldn't_ take pipeline input. It's a fairly straightforward thing to add in the design of a command, and while it might be used by everyone, it does make the command more versatile for a wider variety of use cases.\r\n\r\nI'm gonna mark this up for grabs for now, it's not a massive or breaking change. :+1: ",
      "created_at": "2020-04-25T16:02:27Z",
      "updated_at": "2020-04-25T16:02:27Z"
    },
    {
      "author": "jhoneill",
      "author_association": "NONE",
      "body": "\r\n> yes i am with you but with _invoke-history_ It's value is absolutely tiny\r\n\r\nActually I agree. In another thread I've just been saying \"we've got this far without this\".\r\nIt's one of a small number which have this failing. (Start is another). It's like the door that has squeaked for years and no one oils it, and everyone accepts it. And the harm / value from fixing it is tiny. But eventually someone needs to say \"For pity's sake someone oil that door\". \r\n    \r\n ",
      "created_at": "2020-04-25T16:02:35Z",
      "updated_at": "2020-04-25T16:02:35Z"
    },
    {
      "author": "fMichaleczek",
      "author_association": "NONE",
      "body": "@vexx32 \r\n\r\n> I don't see any reason that Invoke-History shouldn't take pipeline input.\r\n\r\nIf you read the examples below, you will see that was intentional at design time.\r\nMaybe add a _confirm_ parameter if there is more than two to invoke, will be more secure.\r\n\r\n```\r\nPS > Get-History -Id 1,2,3 | Invoke-History\r\nInvoke-History: Cannot process multiple history commands. You can only run a single command by using Invoke-History.\r\n\r\nPS > Invoke-History -Id 1,2\r\nInvoke-History: Cannot convert 'System.Object[]' to the type 'System.String' required by parameter 'Id'. Specified method is not supported.\r\n```",
      "created_at": "2020-04-25T21:37:01Z",
      "updated_at": "2020-04-25T21:37:01Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "The latter is just a binding exception; you'll get similar results if you provide an array for any string parameter.\r\n\r\nAs for the former, sure, it may have been intentional. Without having spoken to the designer of the original command, I can't speak to their intent, though. As has already been mentioned in this issue, you can work around this with a simple `ForEach-Object`, so I'm not sure it makes a lot of sense in terms of its efficacy.",
      "created_at": "2020-04-25T21:40:31Z",
      "updated_at": "2020-04-25T21:40:40Z"
    },
    {
      "author": "fMichaleczek",
      "author_association": "NONE",
      "body": "There is also weird behaviour with the pipeline :\r\n```\r\nPS C:\\Users\\Flavien> \"foo\"\r\nfoo\r\nPS C:\\Users\\Flavien> 1 | Invoke-History\r\nInvoke-History: The input object cannot be bound to any parameters for the command either because the command does not take pipeline input or the input and its properties do not match any of the parameters that take pipeline input.\r\n\"foo\"\r\nfoo\r\n```",
      "created_at": "2020-04-25T21:41:33Z",
      "updated_at": "2020-04-25T21:41:33Z"
    },
    {
      "author": "bpayette",
      "author_association": "CONTRIBUTOR",
      "body": "FYI - The history command was very minimally designed and implemented in version 1. Basically we wanted to at least be able to do `r N` to  rerun command N. This was inspired by the ksh functionality that we were used to and we (I) figured we'd add more functionality to the commands over time. In fact that didn't happen and most of the work went into interactive editing (PSReadLine).  So there's a ton of [functionality](https://www.digitalocean.com/community/tutorials/how-to-use-bash-history-commands-and-expansions-on-a-linux-vps)  that could be added if people are interested. And, given that this is a user-productivity thing, I don't think the usual minimalism principles necessarily apply. ",
      "created_at": "2020-04-26T20:17:57Z",
      "updated_at": "2020-04-26T20:17:57Z"
    },
    {
      "author": "bpayette",
      "author_association": "CONTRIBUTOR",
      "body": "Further on the minimalism thing. Functionality should be designed as a set of composable commands but once that's done, you can selectively add \"accelerators\" for high-use (typically interactive) cases. This includes things like command and parameter aliases, type accelerator and extra options on cmdlets for scenarios that are used a lot (e.g. the `-file` and `-directory` parameters on `Get-ChildItem`.) Does that make sense?",
      "created_at": "2020-04-28T20:33:18Z",
      "updated_at": "2020-04-28T20:33:18Z"
    },
    {
      "author": "jhoneill",
      "author_association": "NONE",
      "body": "@BrucePay  - yes, it's a very good way of putting what I think I knew. ",
      "created_at": "2020-04-29T13:12:49Z",
      "updated_at": "2020-04-29T13:12:49Z"
    }
  ],
  "created_at": "2020-04-25T11:02:37Z",
  "number": 12488,
  "state": "open",
  "title": "Invoke-History should be able to invoke more than one command",
  "updated_at": "2020-04-29T13:12:49Z"
}