{
  "_url": "https://github.com/PowerShell/PowerShell/issues/12515",
  "author": "MarkPflug",
  "body": "# Summary of the new feature/enhancement\r\n\r\nUsing powershell in a build script (called from MSBuild) I have run into issues several times where failures in the script aren't propagated out of the Exec task. Powershell returns exit code 0, even when the script encountered problems. This is reasonable behavior in many common use cases. However, in a build script, one typically wants the build to \"fail fast\" when an issue is encountered.\r\n\r\nIn my particular case, I \"fixed\" the issue by adding:\r\n\r\n$ErrorActionPreference = 'Stop'\r\n\r\n... do the stuff\r\n\r\ntrap {\r\n\t\"Build failed: $_\"\r\n\texit -1\r\n}\r\n\r\nThis works, but isn't an ideal solution either, because this script will exit powershell if run interactively and an error is encountered. There is probably a way to make this behave more sanely in an interactive session, but it feels clumsy to have to specially craft any ps1 script that is intended to be used in a build.\r\n\r\nMy proposal is to add a new command line switch to pwsh.exe, that will cause it to exit with a non-zero exit code on the first failure, rather than the default behavior of continuing and exiting with 0. This would make it *much* easier to use from in a build script scenario where any unhandled failure should be considered critical.\r\n\r\n# Proposed technical implementation details (optional)\r\n\r\nadd a cmdline switch such as:\r\n`pwsh.exe -ExitOnError`\r\n\r\nIn the presence of this error scripts run as if $ErrorActionPreference = 'stop' is set and will return a non-zero exit code when the first error is encountered.",
  "closed_at": "2020-04-30T21:20:27Z",
  "comments": [
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "There is no standard for exit status.  https://en.wikipedia.org/wiki/Exit_status\r\nYou should return codes expected by specific parent process.\r\nSo you workaround is right way.\r\n",
      "created_at": "2020-04-30T15:31:02Z",
      "updated_at": "2020-04-30T15:31:02Z"
    }
  ],
  "created_at": "2020-04-28T21:51:10Z",
  "number": 12515,
  "state": "closed",
  "title": "Error mode command line argument",
  "updated_at": "2020-04-30T21:20:27Z"
}