{
  "_url": "https://github.com/PowerShell/PowerShell/issues/12517",
  "author": "bluikko",
  "body": "# Steps to reproduce\r\n\r\n```powershell\r\n# not working\r\nclass TestClass {\r\n    [ValidateScript({ $_ -le 10 })]\r\n    [Int]$ClassVar\r\n}\r\n```\r\nOutput:\r\n```\r\nParserError: \r\nLine |\r\n   2 |      [ValidateScript({ $_ -le 10 })]\r\n     |                      ~~~~~~~~~~~~~\r\n     | At line:2 char:21 +     [ValidateScript({ $_ -le 10 })] +                     ~~~~~~~~~~~~~\r\nAttribute argument must be a\r\n     | constant.\r\n```\r\n```powershell\r\n# working\r\nclass TestClass {\r\n    [ValidateRange(0,10)]\r\n    [Int]$ClassVar\r\n}\r\n$cl = [TestClass]::new()\r\n$cl.ClassVar = 10\r\n$cl.ClassVar\r\n```\r\nOutput:\r\n```\r\n10\r\n```\r\n\r\n# Expected behavior\r\nIt should be possible to use ValidateScript in classes the same way as for function parameters.\r\n\r\nIf there is a technical limitation why the behavior is expected then it should be documented somewhere - I could not find anything in documentation about this.\r\n\r\n# Actual behavior\r\nAll validations except ValidateScript work as expected in classes.\r\n\r\n# Environment data\r\n\r\n<!-- provide the output of $PSVersionTable -->\r\n\r\n```none\r\nName                           Value\r\n----                           -----\r\nPSVersion                      7.0.0\r\nPSEdition                      Core\r\nGitCommitId                    7.0.0\r\nOS                             Microsoft Windows 10.0.18363\r\nPlatform                       Win32NT\r\nPSCompatibleVersions           {1.0, 2.0, 3.0, 4.0…}\r\nPSRemotingProtocolVersion      2.3\r\nSerializationVersion           1.1.0.1\r\nWSManStackVersion              3.0\r\n```\r\n```none\r\nName                           Value\r\n----                           -----\r\nPSVersion                      5.1.18362.752\r\nPSEdition                      Desktop\r\nPSCompatibleVersions           {1.0, 2.0, 3.0, 4.0...}\r\nBuildVersion                   10.0.18362.752\r\nCLRVersion                     4.0.30319.42000\r\nWSManStackVersion              3.0\r\nPSRemotingProtocolVersion      2.3\r\nSerializationVersion           1.1.0.1\r\n```",
  "closed_at": null,
  "comments": [
    {
      "author": "p0W3RH311",
      "author_association": "NONE",
      "body": "perhaps class is by design static scoping  and scriptblock with validateScript  is interpreted dynamically...maybe you can create your own attribute with class [System.Management.Automation.ValidateArgumentsAttribute] ",
      "created_at": "2020-04-29T13:21:09Z",
      "updated_at": "2020-04-29T13:21:09Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "In this specific case you could use `[ValidateRange(0, 10)]` or `[ValidateRange([int]::MinValue, 10)]` depending on your needs.\r\n\r\nBut yeah, classes are handled at parse time, so attributes have some extra restrictions. I'm not sure there's a way around that? Might be, but I would _guess_ there probably isn't much that's really doable there.",
      "created_at": "2020-04-29T14:42:25Z",
      "updated_at": "2020-04-29T14:42:25Z"
    },
    {
      "author": "bluikko",
      "author_association": "NONE",
      "body": "@vexx32 The simple example is just that - a simple example. My need for ValidateScript is obviously much more complex.\r\n\r\nCould you point me to the documentation where this is listed as expected behavior since you are not surprised about this behavior?\r\n\r\nI could not find many relevant matches doing a web search about validatescript and class but several did have other people wondering about ValidateScript and this problem. So it would not seem to be very well documented.\r\n\r\nIt is disappointing. If class methods are not static like this then I might be able to figure out an ugly workaround if I have to.",
      "created_at": "2020-04-30T01:43:48Z",
      "updated_at": "2020-04-30T01:43:48Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "I'm mainly not surprised because I've seen it before, both in PS and (more importantly) in C# itself. In compiled code you can't have non-constant/non-primitive values for attributes. It's actually part of the [attribute language specification](https://docs.microsoft.com/en-us/dotnet/csharp/language-reference/language-specification/attributes#attribute-parameter-types) which states:\r\n\r\n> The types of positional and named parameters for an attribute class are limited to the attribute parameter types, which are:\r\n>\r\n> - One of the following types: `bool`, `byte`, `char`, `double`, `float`, `int`, `long`, `sbyte`, `short`, `string`, `uint`, `ulong`, `ushort`.\r\n> - The `type` object.\r\n> - The type `System.Type`.\r\n> - An `enum type`, provided it has public accessibility and the types in which it is nested (if any) also have public accessibility (Attribute specification).\r\n> - Single-dimensional arrays of the above types.\r\n>\r\n> A constructor argument or public field which does not have one of these types, cannot be used as a positional or named parameter in an attribute specification.\r\n\r\nI think there are _similar_ underlying requirements for dynamically compiled assemblies, and .NET in the more general case as well. I'm pretty sure the only reason `[ValidateScript()]` is even a thing is because PowerShell script can do more or less whatever it want, as long as it's willing to handle things on its own. `[ValidateScript()]` is possible in PS probably because PS isn't directly compiling functions, it's doing it piecemeal and can handle attributes however differently it wants, more or less. Attribute classes are free to have whatever properties they want, but they can only use the above types in their constructor parameters when they're decorating a class and need to be resolved at compile time.\r\n\r\nClasses in PS are a different story entirely, and have to be compiled as-is at parse time, meaning there's no deferred compilation or special handling of attributes for the most part, they just behave very much like C# / .NET attributes.\r\n\r\nAs far as documenting it in PowerShell, I'd tend to agree that it should be mentioned somewhere in the classes documentation.",
      "created_at": "2020-04-30T02:22:36Z",
      "updated_at": "2020-04-30T02:24:50Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "/cc @rjmholt ",
      "created_at": "2020-04-30T15:01:09Z",
      "updated_at": "2020-04-30T15:01:09Z"
    },
    {
      "author": "rjmholt",
      "author_association": "COLLABORATOR",
      "body": "Yeah @vexx32 has hit it on the head. It looks like we should handle this more gracefully.\r\n\r\nI imagine that this is \"expected if you think about the implementation and extrapolate\", but has not been anticipated by the existing implementation.\r\n\r\nCurrently classes are compiled into dynamic .NET assemblies, and won't tolerate attributes that do something that .NET doesn't like, namely use values that can't be embedded into .NET static metadata.\r\n\r\nI don't see `ValidateScript` ever working as an attribute for classes, but I also don't see that as a big issue since classes don't need to do parameter binding. Instead the validation can be done in the method body (similar to how it would be done for a C# method).\r\n\r\nI think we should:\r\n\r\n- Emit a parse-time semantic error when this attribute is used on a class method\r\n- Update documentation to explicitly document how attributes work with classes",
      "created_at": "2020-04-30T19:15:32Z",
      "updated_at": "2020-04-30T19:16:15Z"
    },
    {
      "author": "sdwheeler",
      "author_association": "COLLABORATOR",
      "body": "@rjmholt Are there any other Validation attributes that don't work with classes?\r\n\r\nI am guessing that ValidateDrive and ValidateUserDrive might be a problem. Can you confirm?",
      "created_at": "2020-06-24T23:57:15Z",
      "updated_at": "2020-06-24T23:57:15Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "Those should work, I think the main issue with ValidateScript is that it has to take a non-constant value (a scriptblock) to do its job.\r\n\r\nAt least, \"work\" in the sense that the attribute can be applied to the class property. Whether the PS engine will recognise them on a class member or not... is another matter entirely. Not sure there, tbh.",
      "created_at": "2020-06-25T00:35:37Z",
      "updated_at": "2020-06-25T00:35:37Z"
    },
    {
      "author": "bluikko",
      "author_association": "NONE",
      "body": "Interesting discussion. I would still like to see this limitation documented since my original research turned up several other similar questions.\r\n\r\nAfter the explanation above it is obvious why such a limitation exists but many users out there, like me, do not have as deep understanding of PowerShell as you do.\r\n\r\nMy original planned use case for this was doing data binding or simple manual storage&validation of data from a GUI. It is my first attempt at doing more advanced GUI things so it may have been a bad/impossible idea in any case even if the ValidateScript would have worked. It looked like an elegant way to do validation to the untrained eye...",
      "created_at": "2020-06-27T01:55:48Z",
      "updated_at": "2020-06-27T01:58:48Z"
    },
    {
      "author": "bluikko",
      "author_association": "NONE",
      "body": "> @rjmholt Are there any other Validation attributes that don't work with classes?\r\n> \r\n> I am guessing that ValidateDrive and ValidateUserDrive might be a problem. Can you confirm?\r\n\r\nSeem to work just fine.",
      "created_at": "2020-06-27T02:09:40Z",
      "updated_at": "2020-06-27T02:09:40Z"
    },
    {
      "author": "jantari",
      "author_association": "NONE",
      "body": "I just ran across this when trying to disallow negative `[TimeSpan]` properties. Neither of these work:\r\n\r\n```powershell\r\nclass Repro {\r\n\t[ValidateRange([TimeSpan]::Zero, [TimeSpan]::MaxValue)]\r\n\t[TimeSpan]$SomeDuration\r\n}\r\n\r\nclass Repro {\r\n\t[ValidateScript({ $_ -ge [TimeSpan]::Zero })]\r\n\t[TimeSpan]$SomeDuration\r\n}\r\n```\r\n\r\nwhich is kind of annoying. Both error with `Attribute argument must be a constant.` even though they are constants.\r\n\r\nWould it be possible to extend ValidateRange support to TimeSpan as well?",
      "created_at": "2022-10-03T17:27:38Z",
      "updated_at": "2022-10-03T17:52:39Z"
    },
    {
      "author": "SeeminglyScience",
      "author_association": "COLLABORATOR",
      "body": "@jantari The term `constant` in this context means it can be embedded as a raw value in a binary file. That is only supported by [the CLR](https://learn.microsoft.com/en-us/dotnet/standard/clr) for primitives and a handful of special cased types (like `Type`). Structs like `TimeSpan` cannot be as their raw value is an implementation detail subject to change, even if they happen to be a thin wrapper around a primitive like `TimeSpan` is.\r\n\r\nThat said, naturally PowerShell somewhat makes its own rules in this area, and might be able to fake it *outside* of classes. Inside classes would be a lot harder though since at the end of the day it needs to be encoded into metadata (even if only in memory). I'd recommend opening a different issue for the subject of allowing `[TimeSpan]::Zero|MaxValue` in `ValidateRange`",
      "created_at": "2022-10-03T19:23:02Z",
      "updated_at": "2022-10-03T19:23:02Z"
    }
  ],
  "created_at": "2020-04-29T07:17:09Z",
  "labels": [
    "Issue-Bug",
    "WG-Engine",
    "Documentation Needed"
  ],
  "number": 12517,
  "state": "open",
  "title": "ValidateScript does not work for class properties",
  "updated_at": "2022-10-03T19:23:02Z"
}