{
  "_url": "https://github.com/PowerShell/PowerShell/issues/12566",
  "author": "SirHodlington",
  "body": "This is a small but powerful improvement for PowerShell. I regularly use PowerShell to run commands for my programming work like starting builds, deploying cloud functions, running scripts etc.. \r\n\r\nThe press arrow up feature to get the previous command is very helpful, but cumbersome to use when repeating the same command often.\r\n\r\nWhen developing, I often have to run the same commands a lot of times in a row. \r\nExample:\r\n1.) start server command\r\n2.) change code -> run script command\r\n3.) change code -> run script command \r\n.....\r\n50.)  change code -> run script command\r\n*ends coding session*\r\n\r\nNow here is the issue. The next time I start the terminal I would like to select the start server command again by pressing arrow up button. The problem is though, that I have to press is like 50 times before it shows that command. I'm assuming that there is some kind of list that is iterated through 1 row each time the arrow up button is pressed. \r\n\r\nIt would be extremely helpful, if the \"press arrow up\"-function would not repeat the same command, but always show the next different command. (increase i until next command is different then currently show command). (same goes for arrow down)\r\nIn my example that would mean: When I start the terminal and press arrow up once it shows the  \"run script command\" and when pressing it the second time it shows the \" start server command\"\r\n\r\nMaybe you can make that change? I would SO MUCH appreciate it!",
  "closed_at": "2020-05-06T12:00:14Z",
  "comments": [
    {
      "author": "DHowett-MSFT",
      "author_association": "NONE",
      "body": "You can do this with PSReadline (which is the line editor and history management module that ships with powershell, and which you’re already using) today with...\r\n\r\n```\r\nSet-PSReadLineOption -HistoryNoDuplicates\r\n```\r\n\r\nIf you put that into your profile, you won’t see duplicates in your history file or your up-arrow history recall.",
      "created_at": "2020-05-04T05:08:04Z",
      "updated_at": "2020-05-04T05:19:09Z"
    },
    {
      "author": "DHowett-MSFT",
      "author_association": "NONE",
      "body": "(As an aside, you can actually search your history interactively with <kbd>Ctrl+R</kbd>! If you press ^R and then part of the command that starts the server, it’ll automatically jump to that command so you can run it again.)",
      "created_at": "2020-05-04T05:16:39Z",
      "updated_at": "2020-05-04T05:16:39Z"
    },
    {
      "author": "SirHodlington",
      "author_association": "NONE",
      "body": "You Sir, deserve more than the one upvote I can give.",
      "created_at": "2020-05-04T05:18:25Z",
      "updated_at": "2020-05-04T05:18:25Z"
    },
    {
      "author": "SirHodlington",
      "author_association": "NONE",
      "body": "imho this should be the default setting",
      "created_at": "2020-05-04T05:42:17Z",
      "updated_at": "2020-05-04T05:42:17Z"
    },
    {
      "author": "rkeithhill",
      "author_association": "COLLABORATOR",
      "body": "An even more straightforward way to search is to type in the first part of the command e.g. `start` and then press the UpArrow key.   IIRC you need this bit of configuration to make that work:\r\n```\r\nSet-PSReadlineKeyHandler -Chord UpArrow   -Function HistorySearchBackward\r\nSet-PSReadlineKeyHandler -Chord DownArrow -Function HistorySearchForward\r\n```\r\nFinally, give the new PSRL 2.1.0 Beta a try.  It provides completion prediction functionality (I typed in only `dot` below - the rest is the prediction) e.g.:\r\n![image](https://user-images.githubusercontent.com/5177512/80992200-67226500-8df6-11ea-9f8e-5432f23d5d44.png)\r\n\r\nSee this PSReadLine issue for more details: https://github.com/PowerShell/PSReadLine/issues/687\r\n",
      "created_at": "2020-05-04T17:10:49Z",
      "updated_at": "2020-05-04T17:10:49Z"
    },
    {
      "author": "SirHodlington",
      "author_association": "NONE",
      "body": "I wish I could preset these somehow. Having to enter them at the beginning each time is really slowing me down :/",
      "created_at": "2020-05-04T17:58:09Z",
      "updated_at": "2020-05-04T17:58:09Z"
    },
    {
      "author": "DHowett-MSFT",
      "author_association": "NONE",
      "body": "So that's what I was alluding to when I mentioned [your profile](https://docs.microsoft.com/en-us/powershell/module/microsoft.powershell.core/about/about_profiles?view=powershell-7). You can have a script that runs automatically every time you open PowerShell to set your customizations up exactly as you want them.",
      "created_at": "2020-05-04T17:59:17Z",
      "updated_at": "2020-05-04T17:59:17Z"
    },
    {
      "author": "SirHodlington",
      "author_association": "NONE",
      "body": "Ok I will try that. Thanks!",
      "created_at": "2020-05-04T18:00:29Z",
      "updated_at": "2020-05-04T18:00:29Z"
    },
    {
      "author": "msftbot[bot]",
      "author_association": "NONE",
      "body": "This issue has been marked as answered and has not had any activity for **1 day**. It has been closed for housekeeping purposes.",
      "created_at": "2020-05-06T12:00:12Z",
      "updated_at": "2020-05-06T12:00:12Z"
    }
  ],
  "created_at": "2020-05-04T04:12:13Z",
  "labels": [
    "Issue-Question",
    "Resolution-Answered"
  ],
  "number": 12566,
  "state": "closed",
  "title": "[Feature Request] Press arrow up going through previous commands: show previous *different* command instead of repeating same command",
  "updated_at": "2020-05-06T12:00:14Z"
}