{
  "_url": "https://github.com/PowerShell/PowerShell/issues/12737",
  "author": "softlion",
  "body": "# Summary of the new feature/enhancement\r\n\r\nWith powershell 7 we lost the ability to Set-Location to a file path. Set-Location supports only a folder path.\r\n\r\nThis PS6 feature was a really good productivity feature.\r\n\r\nIt would be nice to add it again.\r\n",
  "closed_at": "2020-06-30T15:19:19Z",
  "comments": [
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "Can you share the use case for having the current location set to a file?\r\n\r\nI'd consider that a bug if that were allowed, and without hunting down the original issue, that's probably how it was triaged.",
      "created_at": "2020-05-20T12:38:42Z",
      "updated_at": "2020-05-20T12:38:42Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "PowerShell 5.1 does not allows this too.",
      "created_at": "2020-05-20T14:17:11Z",
      "updated_at": "2020-05-20T14:17:11Z"
    },
    {
      "author": "softlion",
      "author_association": "NONE",
      "body": "Yes maybe it was in powershell 3 not 5, but it used to work in Powershell ISE.\r\n\r\nA use case: you copy the path of a file into the clipboard, then open a command line and try to change the current directory to the folder containing this file. You have to manually delete the file part of the path to be able to change it.\r\n\r\nIt was a nice uncommon feature that helps make powershell unique, without any side effect.",
      "created_at": "2020-05-20T14:56:11Z",
      "updated_at": "2020-05-20T14:56:11Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "You can use Split-Path to strip off the leaf fragment of the path:\n\n```ps1\n$filepath | Split-Path | Set-Location\n```",
      "created_at": "2020-05-20T16:24:40Z",
      "updated_at": "2020-05-20T16:24:40Z"
    },
    {
      "author": "jhoneill",
      "author_association": "NONE",
      "body": "I have shared \"cd as function\" in place of the alias, and it has extra argument completers and transformers to allow things like cd ... (for ..\\..). It would be trivial to add one removal of any file part to leave the path. I think this is better left as a user customization than changing the behavior of Set-Location. (but having done the customization, I would think that!)\r\n",
      "created_at": "2020-05-21T15:56:58Z",
      "updated_at": "2020-05-21T15:56:58Z"
    },
    {
      "author": "softlion",
      "author_association": "NONE",
      "body": "Well Set-Location really used to select the folder part of the path it gets in previous versions of powershell and it won't break anything. Why won't you put that as a new good and practical feature, making gain lots of time, instead of simply closing it without  any comment ? You are too conservative guys. Be a little open minded.",
      "created_at": "2020-06-30T17:27:42Z",
      "updated_at": "2020-06-30T17:27:42Z"
    },
    {
      "author": "softlion",
      "author_association": "NONE",
      "body": "> You can use Split-Path to strip off the leaf fragment of the path:\r\n> \r\n> ```powershell\r\n> $filepath | Split-Path | Set-Location\r\n> ```\r\n\r\nOf course i can also write binary code to do the same. The idea is to gain time. Time is money. Time is electrical power. Gaining time is green energy. Think about that.",
      "created_at": "2020-06-30T17:29:37Z",
      "updated_at": "2020-06-30T17:29:37Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "@softlion If the community votes for the enhancement, then it will certainly be realized. \r\n",
      "created_at": "2020-06-30T17:56:15Z",
      "updated_at": "2020-06-30T17:56:15Z"
    }
  ],
  "created_at": "2020-05-20T12:30:06Z",
  "number": 12737,
  "state": "closed",
  "title": "Set-Location to file path, like in powershell 6 and lower",
  "updated_at": "2020-06-30T17:56:15Z"
}