{
  "_url": "https://github.com/PowerShell/PowerShell/issues/12839",
  "author": "alexbuzzbee",
  "body": "In some places, the PowerShell SDK documentation, and possibly other documentation, though I haven't checked thoroughly, still refers to \"Monad\" or \"MSH,\" PowerShell's previous names during its original development. This has the potential to confuse programmers who are not aware of PowerShell's history.\r\n\r\nAs particular examples, this can be seen in [Cmdlet](https://docs.microsoft.com/en-us/dotnet/api/system.management.automation.cmdlet)'s and [RuntimeException](https://docs.microsoft.com/en-us/dotnet/api/system.management.automation.runtimeexception)'s SDK documentation, but it also occurs in many other documents.\r\n\r\nAs a documentation problem, this issue was originally opened as MicrosoftDocs/PowerShell-Docs#6043, but it was closed and reopened here because the documentation in question is generated from `///` doc-comments in the PowerShell codebase itself.",
  "closed_at": "2022-11-08T03:27:54Z",
  "comments": [
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "There are quite a few internal code comments that use the Monad / MSH / Monad Shell moniker as well. Some of the internal class files / classes themselves also bear that name, `MshObject` is one example.\r\n\r\nProbably worth going through and renaming a fair few things to align with the current name sooner or later... there will be a fair bit though, I'd imagine.",
      "created_at": "2020-05-29T18:13:11Z",
      "updated_at": "2020-05-29T18:13:11Z"
    },
    {
      "author": "alexbuzzbee",
      "author_association": "NONE",
      "body": "@vexx32 Certainly not a high-priority issue, but something to take care of eventually.",
      "created_at": "2020-05-29T18:26:47Z",
      "updated_at": "2020-05-29T18:26:47Z"
    },
    {
      "author": "KevinMarquette",
      "author_association": "CONTRIBUTOR",
      "body": "Sounds like a good October fest ticket.",
      "created_at": "2020-05-29T18:53:55Z",
      "updated_at": "2020-05-29T18:53:55Z"
    },
    {
      "author": "bpayette",
      "author_association": "CONTRIBUTOR",
      "body": "Way back in version 1.0, just before releasing, we made a pass through all of the code and docs renaming everything Monad/msh that was public. Clearly we missed a few in the docs that should just be fixed. However all of the internal members were (obviously) not renamed.. We reviewed the code again prior to going open source, and again saw no compelling need to churn the code for trivial reasons.  This has been the status quo for over 13 years. What compelling reason is there to change this now?",
      "created_at": "2020-06-01T18:55:14Z",
      "updated_at": "2020-06-01T18:55:14Z"
    },
    {
      "author": "SeeminglyScience",
      "author_association": "COLLABORATOR",
      "body": "I'd like to see the file that contains `PSObject` renamed from `MshObject.cs` because that's super confusing (same with `MshCmdlet.cs`).  I don't really see a reason to change the class name of `MshCommandRuntime` for instance though.  As long as their internal, it's probably not worth renaming any actual classes.",
      "created_at": "2020-06-02T14:40:12Z",
      "updated_at": "2020-06-02T14:40:53Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "There's a good number of cases, but I'll spend time tomorrow cleaning this up for comments that get turned into docs",
      "created_at": "2022-11-07T01:58:57Z",
      "updated_at": "2022-11-07T01:58:57Z"
    }
  ],
  "created_at": "2020-05-29T17:48:41Z",
  "labels": [
    "Area-Maintainers-Documentation",
    "Issue-Code Cleanup",
    "In-PR"
  ],
  "number": 12839,
  "state": "closed",
  "title": "PowerShell is still sometimes called \"Monad\" or \"MSH\" in documentation",
  "updated_at": "2022-11-08T18:21:06Z"
}