{
  "_url": "https://github.com/PowerShell/PowerShell/issues/12852",
  "author": "veleek",
  "body": "SYMPTOMS\r\nAfter successfully configuring OpenSSH as a server on Windows, confirming that access with ssh.exe or putty.exe works as expected, when connecting with pwsh's Enter-PSSession or Invoke-Command, it fails with an error message: \"There is an error processing data from the background process. Error reported: ...\" When you delete, rename or move your PowerShell profile script(s) at that OpenSSH server, the error message disappears and pwsh remoting works as expected.\r\n\r\nCAUSE\r\nYou have 1) a profile script at the OpenSSH server, 2) that profile script prints or displays output when run, and 3) you have changed the default OpenSSH server's command shell from CMD to either Windows PowerShell or PowerShell Core. The output of the profile script is disrupting the launch of pwsh as an OpenSSH \"subsystem\" despite the fact that the sshd_config file is correctly configured with the \"..\\pwsh.exe -sshs -nologo -noprofile\" line.\r\n\r\nREPRODUCE\r\nInstall PowerShell Core 7 preview 5 on a Windows Server 2019 system.\r\n\r\nDelete, rename or move all PowerShell profile scripts on that server.\r\n\r\nInstall the OpenSSH 8.0.beta sshd.exe service from GitHub on that Windows Server into $env:ProgramFiles\\OpenSSH as recommended, and configure the \"Subsystem\" line in it's sshd_config file (https://docs.microsoft.com/en-us/powershell/scripting/learn/remoting/ssh-remoting-in-powershell-core?view=powershell-6).\r\n\r\nConfirm that the OpenSSH server is working with both ssh.exe and pwsh's \"Enter-PSSession -HostName server.\"\r\n\r\nChange the OpenSSH default command shell to either powershell.exe or pwsh.exe (https://github.com/PowerShell/Win32-OpenSSH/wiki/DefaultShell).\r\n\r\nConfirm with ssh.exe and \"Enter-PSSession -HostName server\" that OpenSSH is still accessible and that ssh.exe gets the new default shell as expected (powershell.exe or pwsh.exe, not CMD).\r\n\r\nAdd a profile script for powershell.exe or pwsh.exe, whichever one you want, and add a command to that script which produces output, e.g., a line like \"XXXXXXX\".\r\n\r\nConfirm with ssh.exe that OpenSSH is still accessible and that the profile script runs as expected, e.g., it prints \"XXXXXXX.\"\r\n\r\nAttempt to connect with pwsh's \"Enter-PSSession -HostName server\" as before. Note that it now fails with an error message: \"There is an error processing data from the background process. Error reported: XXXXXXX.\"\r\n\r\nComment out the line from the profile script which produces the output. Add other commands to the profile script which do not produce output, e.g., create a function. Attempt to connect again with pwsh's \"Enter-PSSession -HostName server\" and note that it succeeds.\r\n\r\nUncomment the line from the profile script which produces the output and causes pwsh's Enter-PSSession to fail.\r\n\r\nChange the default OpenSSH command shell back to CMD again.\r\n\r\nAttempt to connect again with pwsh's \"Enter-PSSession -HostName server\" and note that it succeeds.\r\n\r\nNOTES\r\nSet the default OpenSSH command shell back to CMD. Use Process Explorer or a similar tool to watch the sshd.exe service as a pwsh client connects with \"Enter-PSSession -HostName server\". The parent sshd.exe spawns a child sshd.exe, which runs \"cmd.exe /c\" to launch \"pwsh.exe -sshs -nologo -noprofile\". It works.\r\n\r\nBut when 1) the default OpenSSH shell is changed to either powershell.exe or pwsh.exe and 2) there is a profile script that produces output, then the parent sshd.exe runs either \"powershell.exe -c\" or \"pwsh.exe -c\" (whichever you chose) in order to launch \"pwsh.exe -sshs -nologo -noprofile\". The profile script of powershell.exe/pwsh.exe is disrupting the launch of the last pwsh.exe in the chain of process launches.\r\n\r\nThe \"-c\" argument to powershell.exe/pwsh.exe seems to be hard-coded into sshd.exe. Following the above instructions for changing the default OpenSSH command shell, if you configure the DefaultShellCommandOption registry value, this value appears to be ignored by sshd.exe when launching pwsh as a subsystem. (See https://github.com/PowerShell/Win32-OpenSSH/wiki/DefaultShell.) Setting the DefaultShellCommandOption value to something like \"-noprofile -command\" does not work.\r\n\r\nThis issue has not been tested on a Linux SSH server.\r\n\r\nThis issue has not been tested on any earlier versions of pwsh or OpenSSH for Windows.\r\n\r\nEXPECTED BEHAVIOR\r\nWhen the default OpenSSH command shell is changed from CMD to either powershell.exe or pwsh.exe on a Windows server, and the SSH user has a profile script on that server, then that profile script should not be run when the user connects with \"Enter-PSSession -HostName server\" using pwsh.\r\n\r\nMITIGATION\r\nEither 1) change the default OpenSSH command shell back to CMD on the target server, or 2) edit your profile script on the server so that it produces no output when it runs. The profile script can create functions, change the Prompt function, change colors, etc., just so long as it produces no output which confuses sshd.exe.\r\n\r\nNOTE: This is a re-creation of https://github.com/PowerShell/Win32-OpenSSH/issues/1498 created at the direction of @bagajjal and originally created by @JasonFossen.",
  "closed_at": null,
  "comments": [
    {
      "author": "yobyot",
      "author_association": "NONE",
      "body": "Sheesh...entering a simple `$PSVersionTable` in `$Profile` to make sure one knows which version of PowerShell is being invoked breaks `New-PsSession`. And, as usual, _it's not doc'd anywhere_. Without @veleek 's detailed problem statement, I'd be flinging insults (again) at ssh on Windows.",
      "created_at": "2020-09-10T19:14:38Z",
      "updated_at": "2020-09-10T19:14:38Z"
    },
    {
      "author": "Nuevo009",
      "author_association": "NONE",
      "body": "Well...I had this issue using  pwsh 7 on win11 to pwsh 7 on win11, but it's not caused by some prints or displays output in the profile script. \r\n\r\nFor some reason I changed my system default code page to utf-8 (chcp 65001). And every time I open my profile like `code $profile` , it will print `Active code page: 65001`, even if I do not have a profile script. \r\n\r\nAnd when I use `New-PsSession` to connect  , it fails with an error message: `There is an error processing data from the background process. Error reported: Active code page: 65001.` But ssh.exe is ok. \r\n\r\nSo\r\n> that profile script prints or displays output when run\r\n\r\nis not just some output in script , but some output when running / loading profile script.\r\n\r\nAdditionally, It happens while I do not change the default OpenSSH server's command shell.\r\n\r\n**edit:** Now I change the OpenSSH server's default shell to pwsh and connect with ssh.exe . It works well.\r\n\r\nThanks @veleek  and people in #https://github.com/PowerShell/Win32-OpenSSH/issues/1498 , for letting me know how it is caused.",
      "created_at": "2021-10-27T14:23:00Z",
      "updated_at": "2021-11-02T05:30:07Z"
    }
  ],
  "created_at": "2020-05-31T05:16:50Z",
  "labels": [
    "Issue-Question",
    "WG-Remoting"
  ],
  "number": 12852,
  "state": "open",
  "title": "Enter-PSSession Error processing data from the background process",
  "updated_at": "2021-11-02T05:30:07Z"
}