{
  "_url": "https://github.com/PowerShell/PowerShell/issues/12860",
  "author": "GFoxHub",
  "body": "I was load testing some PowerShell code that uses a background runspace to ship all the errors that have been written to $Error. I ran into the 256 item limit. I struggled to figure out why the $MaximumErrorCount variable mentioned in several articles wasn't working until I tried going back to PowerShell 5.1. After realizing it was just broken after Powershell 5.1 I adjusted my web search and found this thread.\r\n\r\nPaul clearly calls out the issue of backward compatibility and avoiding an unnecessary limitation. Instead a decision was made based on a faulty argument that removing functionality isn't an issue of backward compatibility and also on not \"seeing folks using it\".\r\n\r\nRegarding this change being made three years ago, I would suggest that people aren't noticing until now because their migration to .Net-Core-Based PowerShell has been delayed potentially due to issues like this.\r\n\r\nPlease reinstate the ability to increase the MaximumErrorCount because people need it, it had already been implemented practically, and there cases when it is preferable to using -ErrorVariable or clearing the $Error variable as it fills up.\r\n\r\nSee previous thread:\r\nhttps://github.com/PowerShell/PowerShell/pull/2363\r\n\r\n# Steps to reproduce\r\n\r\n```\r\n$MaximumErrorCount = 10000\r\n\r\nfor ($item = 0; $item -lt 1000; $item++)\r\n{\r\n    1/0\r\n}\r\n\r\n$error.count\r\n\r\n```\r\n\r\n# Expected behavior\r\n\r\n```\r\nOutput: 1000\r\n```\r\n\r\n# Actual behavior\r\n\r\n```\r\nOutput: 256\r\n\r\n```\r\n\r\n# Environment data\r\n\r\n```\r\nName                           Value\r\n----                           -----\r\nPSVersion                      7.0.1\r\nPSEdition                      Core\r\nGitCommitId                    7.0.1\r\nOS                             Microsoft Windows 10.0.18362\r\nPlatform                       Win32NT\r\nPSCompatibleVersions           {1.0, 2.0, 3.0, 4.0…}\r\nPSRemotingProtocolVersion      2.3\r\nSerializationVersion           1.1.0.1\r\nWSManStackVersion              3.0\r\n\r\n```\r\n",
  "closed_at": null,
  "comments": [
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "Config variables are hard to find. I believe it is better to add new config option in powershell.config.json.",
      "created_at": "2021-01-16T17:17:02Z",
      "updated_at": "2021-01-16T17:17:02Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "@PowerShell/powershell-committee reviewed this, it appears that this was originally removed intentionally as a search of scripts using this variable didn't turn up results.  However, we understand this is likely only used for debugging in an interactive session so such a search wouldn't show results.  We agreed that this specific variable could be brought back, but not a priority so leaving it as up-for-grabs.",
      "created_at": "2021-01-20T23:43:23Z",
      "updated_at": "2021-01-20T23:43:52Z"
    }
  ],
  "created_at": "2020-06-01T06:34:28Z",
  "labels": [
    "Issue-Enhancement",
    "WG-Engine",
    "Up-for-Grabs",
    "Committee-Reviewed"
  ],
  "number": 12860,
  "state": "open",
  "title": "$MaximumErrorCount or equivalent mechanism needed.",
  "updated_at": "2021-01-20T23:43:52Z"
}