{
  "_url": "https://github.com/PowerShell/PowerShell/issues/12872",
  "author": "nawfalhasan",
  "body": "# Summary of the new feature/enhancement\r\n\r\nAs a user, it confuses me to see multiple versions of PowerShell in my machine (Windows 10). I want to get rid of old PowerShell (5/6/core/x86/x64/whatever) from Windows 10 and have only PowerShell 7.\r\n\r\nIf it's not possible, I want to set PowerShell 7 as the default shell. E.g. When I shift right click in File Explorer and clicks on \"Open PowerShell window here\" in the context menu, I want PowerShell 7 to come up.\r\n\r\n\r\n",
  "closed_at": "2020-06-04T12:00:10Z",
  "comments": [
    {
      "author": "jhoneill",
      "author_association": "NONE",
      "body": "There are likely to be things which use powershell.exe and rely on it being on the path, so you would need to replace PowerShell with pwsh in those cases. A small number of things will only run in Windows PowerShell. And Microsoft aren't very keen on switching the version from [win] + x to the download from the in-box version.  \"PowerShell here\" on the file menu in explorer is, I think. hard-coded. Anything can add to the context menu is via the registry registry hack. \r\n",
      "created_at": "2020-06-02T15:00:50Z",
      "updated_at": "2020-06-02T15:00:50Z"
    },
    {
      "author": "nawfalhasan",
      "author_association": "NONE",
      "body": "Hmm, I think this ticket should be raised against Windows than PowerShell, then :) \r\n\r\nJust wondering if PowerShell team can pull this off. There should be something they can do to set it as default at least.",
      "created_at": "2020-06-02T16:12:28Z",
      "updated_at": "2020-06-02T16:12:28Z"
    },
    {
      "author": "thlac",
      "author_association": "CONTRIBUTOR",
      "body": "So there's a bunch of pretty long and convoluted reasons as to why this isn't the case for right now, but to keep a long story short, all of this is definitely on the radar but requires a bunch of collaboration between the .Net/PowerShell/Windows(/Windows Terminal) teams.\r\n\r\n1. `pwsh` was decided back in like the original 6.0 beta days, so you probably won't see it changed to `powershell` ever, this is, among other things, to maintain compatibility with software relying on Windows PowerShell.\r\n2. PowerShell has been based on .Net core, hence why it was previously known as PowerShell Core, this allowed it to be cross-platform, but at cost of compatibility and shorter support cadences. Powershell 7 already has pretty high compatibility, but is still limited by .Net Core 3.1 support cadences, .Net 5 will be the one singular .Net going forward, and therefor be supported for the lifetime of a given Windows release, which is crucial to potentially bundle PowerShell with Windows.\r\n3. Changing the Win-X menu to allow different shells and/or consoles is also a discussion the Windows Terminal team is familiar with, again it requires OS support from the Windows team, but the same applies for PowerShell\r\n\r\nAnyway PowerShell 7.1 should be releasing on .Net 5, so hopefully we'll learn more soon, but bear in mind I don't work for Microsoft or on any of the teams mentioned, so don't take it as me saying it's coming with PowerShell 7.1 because I rightly don't know.",
      "created_at": "2020-06-02T19:12:09Z",
      "updated_at": "2020-06-02T19:12:09Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "The request is for Windows.",
      "created_at": "2020-06-03T09:42:07Z",
      "updated_at": "2020-06-03T09:42:07Z"
    },
    {
      "author": "msftbot[bot]",
      "author_association": "NONE",
      "body": "This issue has been marked as answered and has not had any activity for **1 day**. It has been closed for housekeeping purposes.",
      "created_at": "2020-06-04T12:00:08Z",
      "updated_at": "2020-06-04T12:00:08Z"
    },
    {
      "author": "promisepreston",
      "author_association": "NONE",
      "body": "I had this same concern when working with Azure Powershell. My machine was running Powershell 4, and I wanted to upgrade it to Powershell 7. I installed Powershell 7, but it felt like a different application from Powershell 4, as I had 2 Powershell programs on my machine. I only wanted to upgrade Powershell 4 to Powershell 7.\r\n\r\nFigured out later, that Powershell 4 and Powershell 7, act like 2 different programs with different application directories. All I had to do was to install Powershell 5.1 using this link [Microsoft Download Center](https://www.microsoft.com/download/details.aspx?id=54616). Powershell 5.1 replaced Powershell 4, and then I uninstalled Powershell 7, since Powershell 5.1 was okay for me to run Azure Powershell cmdlets.\r\n\r\nI hope this helps.",
      "created_at": "2021-03-27T14:32:43Z",
      "updated_at": "2021-03-27T14:32:43Z"
    }
  ],
  "created_at": "2020-06-02T13:50:34Z",
  "labels": [
    "Issue-Enhancement",
    "Resolution-Answered"
  ],
  "number": 12872,
  "state": "closed",
  "title": "How to set PowerShell 7 as the default PowerShell?",
  "updated_at": "2021-03-27T14:32:43Z"
}