{
  "_url": "https://github.com/PowerShell/PowerShell/issues/12893",
  "author": "TobiasPSP",
  "body": "## Argument Autocompletion for user input\r\nUntil now, argument completion is defined by engind or code author, not the user. That’s why there is no arg completion for parameters like -Computername and -Credential which would be very helpful to have.\r\nCan you add attributes to the engine that can be used to decorate parameters and cache all user input plus use the cached data to provide completion, similar to this proof of concept: https://powershell.one/code/14.html\r\n\r\nThis should go well together with the new Powershell prediction feature: can you consider taking parameter values from command history and use them to provide automatic argument completion for any parameter that has no completer?\r\n\r\n## Proposed technical implementation details (optional)\r\n\r\nHere is fully working sample code:\r\n\r\nhttps://powershell.one/code/14.html\r\n\r\nNote that this example is deriving from a transformation and from a completion attribute to enable caching and completion. This could and should of course combined in one new attribute.\r\n",
  "closed_at": null,
  "comments": [
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "@daxian-dbw Where could the idea be implemented in PowerShell or in PSReadline?",
      "created_at": "2020-06-04T11:19:57Z",
      "updated_at": "2020-06-04T11:19:57Z"
    },
    {
      "author": "SeeminglyScience",
      "author_association": "COLLABORATOR",
      "body": "It would need to be in PowerShell.  PSReadLine gets all of it's tab completion from `CommandCompletion.CompleteInput`.",
      "created_at": "2020-06-04T12:37:50Z",
      "updated_at": "2020-06-04T12:37:50Z"
    },
    {
      "author": "jhoneill",
      "author_association": "NONE",
      "body": "I think this suggestion has a more generic form. \r\nParameter attribute classes should be able to support multiple methods so that one attribute declaration can specify a completion action and a transformation/validation action.  Code I'm working on at the moment needs to specify completer and either transformer or validator. It's possible to do it as it stands, but it is harder than it needs to be and makes for uglier code. \r\n\r\nIn this case the idea is the function author gets to say \"cache values for this attribute\", and there was an implied question about whether PSReadline should be doing this - the latter gives more space for the user to determine what is and isn't cached, and doesn't need functions to be updated. How to choose what to cache (which implies ignoring default completer values) would need to be worked out.... \r\n\r\nThere are other things which should be looked at. It would help writers or transformers if they had a better view of other parameters which have been given (this value is only OK if that parameter is one of these values) , and at present a validationSet gets used in preference to a completer and enums fields in preference to either, so it's possible to say \"Only these values from the enum are allowed here\" or \"These values are preferred , and those are also allowed\". And various other things to do with behaviour of classes from modules - I'd like to load a module from @TobiasPSP  with this in, and use it in my functions but there many traps on the way to doing that. \r\n\r\n\r\n\r\n",
      "created_at": "2020-06-04T18:13:40Z",
      "updated_at": "2020-06-04T18:13:40Z"
    }
  ],
  "created_at": "2020-06-04T04:51:33Z",
  "labels": [
    "Issue-Enhancement",
    "WG-Interactive-IntelliSense"
  ],
  "number": 12893,
  "state": "open",
  "title": "Argument Autocompletion for user input",
  "updated_at": "2020-06-04T18:13:41Z"
}