{
  "_url": "https://github.com/PowerShell/PowerShell/issues/1306",
  "author": "raghushantha",
  "body": "On Windows, the PATH environment variable is updated upon Script installation using PowerShellGet.\n\nWe need to ensure this happens consistently on all *nix platforms also\n",
  "closed_at": "2016-10-17T16:04:13Z",
  "comments": [
    {
      "author": "andschwa",
      "author_association": "MEMBER",
      "body": "@raghushantha you don't normally edit a user (or the system's) path variable on *nix platforms, you either inform the user that they need to do it, or link the executables into a well-known binary location (e.g. `/usr/bin`).\n\nWhat is the nature of PowerShellGet Scripts? (Self-contained exectuables, PowerShell scripts with a shebang, etc.)\n",
      "created_at": "2016-07-07T17:12:12Z",
      "updated_at": "2016-07-07T17:12:12Z"
    },
    {
      "author": "raghushantha",
      "author_association": "MEMBER",
      "body": "Ref @bmanikm - owner of PowerShellGet\n\nHere is the scenario:\n\n```\nPS C:\\WINDOWS\\system32> Find-Script Test-Credential | Install-Script\n\nPATH Environment Variable Change\nYour system has not been configured with a default script installation path yet, which means you can only run a script\nby specifying the full path to the script file. This action places the script into the folder 'C:\\Program\nFiles\\WindowsPowerShell\\Scripts', and adds that folder to your PATH environment variable. Do you want to add the script\n installation path 'C:\\Program Files\\WindowsPowerShell\\Scripts' to the PATH environment variable?\n[Y] Yes  [N] No  [S] Suspend  [?] Help (default is \"Y\"): y\n\nUntrusted repository\nYou are installing the scripts from an untrusted repository. If you trust this repository, change its\nInstallationPolicy value by running the Set-PSRepository cmdlet. Are you sure you want to install the scripts from\n'https://www.powershellgallery.com/api/v2/'?\n[Y] Yes  [A] Yes to All  [N] No  [L] No to All  [S] Suspend  [?] Help (default is \"N\"): y\nPS C:\\WINDOWS\\system32>\n\n\n```\n",
      "created_at": "2016-07-07T17:16:49Z",
      "updated_at": "2016-07-07T17:16:49Z"
    },
    {
      "author": "andschwa",
      "author_association": "MEMBER",
      "body": "Ah sweet. So as long as it's done interactively like this, it can happen. On *nix, if they say yes, you append a line to the end of their .bashrc with `PATH=\"$PATH:<additional path>\"`. The message will want to be updated so it explicitly asks something along the lines of \"Do you want installation path '...' added to your PATH in your ~/.bashrc file?\" Since the user could very well be using another shell (Zsh, PowerShell, etc.) and would need to update a different profile. This is very commonly done.\n\nOn that note, perhaps we should offer to add it to their PowerShell profile off the bat. We need to know our *nix customers' user of these scripts. Are they expecting self-contained executables runnable from within their Bash/Zsh shells, (in which case the scripts themselves will likely need to be modified; I suspect they're lacking `chmod +x` and `#!/usr/bin/env powershell`), or just scripts invokable from their PowerShell session?\n",
      "created_at": "2016-07-07T17:44:57Z",
      "updated_at": "2016-07-07T17:44:57Z"
    },
    {
      "author": "raghushantha",
      "author_association": "MEMBER",
      "body": "Prompting work is not complete yet. Hence reactivating\n",
      "created_at": "2016-07-19T17:55:18Z",
      "updated_at": "2016-07-19T17:55:30Z"
    },
    {
      "author": "raghushantha",
      "author_association": "MEMBER",
      "body": "@bmanikm Moving this to Alpha 10 - since the change is significant - support has to be added for multiple shells to update the PATH env variable.\n\nThe workaround for now is to invoke the script using full path or use the downloaded location\n",
      "created_at": "2016-08-10T20:56:14Z",
      "updated_at": "2016-08-10T20:56:14Z"
    },
    {
      "author": "Jaykul",
      "author_association": "CONTRIBUTOR",
      "body": "Why bother updating profiles for other shells? The scripts aren't going to work there anyway (at least, not yet, and probably not at ever, unless PowerShell is registered as a shell interpreter, **and** we convince the whole PowerShell community to put shebang lines in anything that works on Core...\n\nJust (offer to) update PowerShell's profile, let them know about it, and move on?\n",
      "created_at": "2016-08-21T19:35:01Z",
      "updated_at": "2016-08-21T19:35:01Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "This issue was moved to PowerShell/PowerShellGet#29\n",
      "created_at": "2016-10-17T16:04:13Z",
      "updated_at": "2016-10-17T16:04:13Z"
    }
  ],
  "created_at": "2016-07-07T16:55:45Z",
  "number": 1306,
  "state": "closed",
  "title": "Ensure system PATH Environment variable is updated correctly on all *nix platforms for PowerShellGet Scripts",
  "updated_at": "2016-10-17T16:04:13Z"
}