{
  "_url": "https://github.com/PowerShell/PowerShell/issues/13210",
  "author": "scotthardwick",
  "body": "I believe I read an issue or posting about this at some point, but I can't find it, so I wanted to ask.  What is the PowerShell team's stance on adding in additional perhaps out of scope cmdlets?  I know that in some cases, various cmdlets are seen as the property of other Microsoft Teams and left to them to create.  I also believe I read somewhere that there was hope that some of these kind of external cmdlets would be primarily community driven.\r\n\r\nI specifically find that I keep needing to use SMTP, SFTP, and JSON Web Tokens (JWT) and there is not an in-built method to do these items. (Well there was for Send-MailMessage but it seems to be deprecated at this time).\r\n\r\nI have found myself falling back to using a DLL by a company called Chilkat for SMTP, SFTP, JWT, but my preference would be to use 100% Microsoft code if possible.\r\n\r\nBefore I write out lengthy feature requests, I wanted to see if this was even potentially something PowerShell team would take on.\r\n\r\n",
  "closed_at": "2020-07-21T12:00:14Z",
  "comments": [
    {
      "author": "SeeminglyScience",
      "author_association": "COLLABORATOR",
      "body": "> Before I write out lengthy feature requests, I wanted to see if this was even potentially something PowerShell team would take on.\r\n\r\nUnless there is a large undeniable demand, it's not likely.  Generally the route they prefer is for the community to implement a module and publish it to the gallery.  Once the module is published, if it sees widespread usage you can file a request to have the module bundled into PowerShell.  That said, I don't think there are any community modules that have met this bar yet (though I don't recall any that have asked either).",
      "created_at": "2020-07-19T11:59:00Z",
      "updated_at": "2020-07-19T11:59:00Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "Since MSFT team is small and has limited resources they prefer to say about community modules.\r\n\r\nYou are a free to open new feature requests. It seems we already have ones for SMTP and SFTP.",
      "created_at": "2020-07-20T09:38:46Z",
      "updated_at": "2020-07-20T09:38:46Z"
    },
    {
      "author": "msftbot[bot]",
      "author_association": "NONE",
      "body": "This issue has been marked as answered and has not had any activity for **1 day**. It has been closed for housekeeping purposes.",
      "created_at": "2020-07-21T12:00:12Z",
      "updated_at": "2020-07-21T12:00:12Z"
    }
  ],
  "created_at": "2020-07-19T00:16:52Z",
  "labels": [
    "Issue-Enhancement",
    "Resolution-Answered"
  ],
  "number": 13210,
  "state": "closed",
  "title": "Question about SMTP, SFTP, JWT",
  "updated_at": "2020-07-21T12:00:14Z"
}