{
  "_url": "https://github.com/PowerShell/PowerShell/issues/13213",
  "author": "arunswarnam",
  "body": "<!--\r\n\r\nFor Windows PowerShell 5.1 issues, suggestions, or feature requests please use the following link instead:\r\nWindows PowerShell [UserVoice](https://windowsserver.uservoice.com/forums/301869-powershell)\r\n\r\nThis repository is **ONLY** for PowerShell Core 6 and PowerShell 7+ issues.\r\n\r\n- Make sure you are able to repro it on the [latest released version](https://github.com/PowerShell/PowerShell/releases)\r\n- Search the existing issues.\r\n- Refer to the [FAQ](https://github.com/PowerShell/PowerShell/blob/master/docs/FAQ.md).\r\n- Refer to the [known issues](https://docs.microsoft.com/powershell/scripting/whats-new/known-issues-ps6).\r\n\r\n-->\r\nWe are working on developing few binary Cmdlet modules targeting PWSH Version 6 and above. we are trying to answer some questions (related to a common dependent module) that possible end users of our modules could face when they try out the Cmdlet modules we will be publishing to PSGallery. It would be great if you could advise us. For this example let us assume there are two modules Module A, Module B that provides different functionality but both Module A and Module B depends on some boiler plate code added in Module C (Common module). We can also assume that all Modules (Module A and Modules B) with version 0.1.0 will depend on Module C (Common Module) with the same version (0.1.0). We also intend to do periodic releases of all the modules. Now if an end user wants to do the following:\r\n1) Use Module A - 0.1.0 (depends on Module C - 0.1.0) and Module B 0.2.0 (depends on Module C 0.2.0) in the same Powershell session. If the user imports Module A in the session and then tries to import Module B. Pwsh complains \"assembly with the same name is already loaded\".   What can we possibly do let the user use different versions of Module A and module B in the same session?\r\n\r\n2. This question is not a real problem (as we could open a new PWSH session) but still we are trying to understand why it is happening. We also notice that if we do `Import-Module ModuleA -RequiredVersion 0.1.0` and `Remove-Module ModuleA` and later do  `Import-Module ModuleA -RequiredVersion 0.2.0`. Pwsh complains  the same error telling assemblies with the same name is already loaded. Is this because `Remove-Module` does not remove the loaded assemblies?  Is there a work around to load the latest version of the module in the same PWSH session after doing a `Remove-Module`? \r\n\r\n```\r\nModuleA.psd1 contents for version 0.X.0:\r\n\r\nRootModule = 'assemblies/ModuleA.dll'\r\n\r\n# Version number of this module.\r\nModuleVersion = '0.X.0'\r\n\r\nRequiredModules = @(@{ModuleName = ‘ModuleC’; GUID = ‘xyz’; RequiredVersion = '0.X.0'; })\r\n\r\n# Assemblies that must be loaded prior to importing this module\r\nRequiredAssemblies = 'assemblies/AnotherDependencyForModuleA.dll'\r\n```\r\n```\r\nModuleC.psd1 contents for version 0.X.0:\r\n# Script module or binary module file associated with this manifest.\r\nRootModule = 'assemblies/ModuleC.dll'\r\n\r\n# Version number of this module.\r\nModuleVersion = ‘0.X.0’\r\n\r\n# Modules that must be imported into the global environment prior to importing this module\r\n# RequiredModules = @()\r\n\r\nRequiredAssemblies = 'assemblies/NLog.dll', \r\n               'assemblies/retrier.dll'\r\n\r\n```\r\n## Steps to reproduce\r\n\r\n```powershell\r\n\r\n```\r\n\r\n## Expected behavior\r\n\r\n```none\r\n\r\n```\r\n\r\n## Actual behavior\r\n\r\n```none\r\n\r\n```\r\n\r\n## Environment data\r\n\r\n<!-- provide the output of $PSVersionTable -->\r\n\r\n```none\r\n\r\n```\r\n",
  "closed_at": "2020-07-22T00:00:13Z",
  "comments": [
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "It happens because the two modules of a different version try to load the same dependency with a different version (and public token). .NET doesn't really allow this without a good amount of finagling. \r\n\r\n/cc @daxian-dbw @rjmholt this is one scenario that would be made possible if PowerShell had some support for separating AssemblyLoadContexts between modules.",
      "created_at": "2020-07-19T21:48:07Z",
      "updated_at": "2020-07-19T21:48:07Z"
    },
    {
      "author": "SeeminglyScience",
      "author_association": "COLLABORATOR",
      "body": "Related issue that @vexx32 is referring to: #12920",
      "created_at": "2020-07-20T01:35:35Z",
      "updated_at": "2020-07-20T01:35:35Z"
    },
    {
      "author": "viralmodi",
      "author_association": "NONE",
      "body": "@vexx32 How about the scenario 2 above? Why is that not possible? Why do we force users to open a new powershell session when all they intend to do is upgrade to a latest version of a loaded assembly?",
      "created_at": "2020-07-20T02:36:07Z",
      "updated_at": "2020-07-20T19:05:37Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "@viralmodi I'm not clear on the precise specifics, but in general terms .NET isn't great at removing binary modules from memory. I know there were _some_ improvements made to that end in .NET Core 3, but to my knowledge it's not something PowerShell has been coded to work with yet. I'm sure there are limitations even so, but it's a bit beyond my ken.",
      "created_at": "2020-07-20T02:38:34Z",
      "updated_at": "2020-07-20T02:38:34Z"
    },
    {
      "author": "SeeminglyScience",
      "author_association": "COLLABORATOR",
      "body": "> I know there were _some_ improvements made to that end in .NET Core 3\r\n\r\nafaik that only applies to assembly load contexts, you still can't unload an assembly loaded into the default ALC (except for dynamic assemblies marked as collectible).  And even then it's mostly impossible in PowerShell due to caching (can't unload an assembly if it's being referenced).\r\n",
      "created_at": "2020-07-20T03:27:50Z",
      "updated_at": "2020-07-20T03:29:01Z"
    },
    {
      "author": "viralmodi",
      "author_association": "NONE",
      "body": "@vexx32 @SeeminglyScience thanks for your responses. Our team is a relatively new to PowerShell. Perhaps, it would be great help if you can point to some documentation which addresses typical usage of PowerShell for the use cases mentioned above? i.e. as a PowerShell user, if I have an installed and imported module in a PowerShell session and I need to upgrade its version, is the only option to close this shell window and open a new one? How do veteran PowerShell users deal with use cases 1 and 2 mentioned above? (Would they already know to close the PowerShell session and open new PowerShell to deal with these use cases because this is considered \"normal behavior\" in PowerShell world?) I, specifically, want to ensure that we (my team) understand/s this part better to be able to explain our Product's Module users in future, if and when, they report issues related to this behavior. \r\nAgain, thanks for your quick responses and help.",
      "created_at": "2020-07-20T07:19:14Z",
      "updated_at": "2020-07-20T19:06:02Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "@viralmodi There is no solution for the cases mentioned above. #12920 is for discussion this.\r\n\r\nYour team could create a temporary solution for your modules using ALCs as @rjmholt described in blog post (see the reference in #12920).\r\n\r\nBut it is much better to contribute in PowerShell if your team have resources. Resolving dependency conflicts, module isolation and module unloading is a related and complex problems and it's worth it to resolve them.",
      "created_at": "2020-07-20T09:59:27Z",
      "updated_at": "2020-07-20T10:00:13Z"
    },
    {
      "author": "SeeminglyScience",
      "author_association": "COLLABORATOR",
      "body": "> i.e. as a PowerShell user, if I have an installed and imported module in a PowerShell session and I need to upgrade its version, is the only option to close this shell window and open a new one?\r\n\r\nYeah more or less.  You can also install side by side, but you'll still need to open a new session before you can actually import the new version.\r\n\r\n> How do veteran PowerShell users deal with use cases #1\r\n\r\nFor dependencies, you have these options for the most part:\r\n\r\n1. Target and bundle the lowest version you can for each module.  When one module needs to target a later version, target it in all modules.  This only really works if you control the dependency and every dependent module\r\n1. Don't bundle the dependency with each module, put the dependency in it's own module, and require PowerShell to load the installed module instead of .NET.  Not a lot of folks do this one because PowerShellGet doesn't handle it well currently\r\n1. Put each module in it's own ALC, then it can load whatever it wants. Only choose this one if you fully understand how ALC's work.  They make it incredibly challenging for external binary modules to interact with your module\r\n\r\nHonestly most of us just don't take/make dependencies.\r\n\r\n> and #2 mentioned above? (Would they already know to close the PowerShell session and open new PowerShell to deal with these use cases because this is considered \"normal behavior\" in PowerShell world?)\r\n\r\nYeah it's pretty commonly hit limitation.  Most veteran users will already have ran into it.  Those that don't, just let them know they need to update prior to importing.",
      "created_at": "2020-07-20T14:24:13Z",
      "updated_at": "2020-07-20T14:24:13Z"
    },
    {
      "author": "arunswarnam",
      "author_association": "NONE",
      "body": "> It happens because the two modules of a different version try to load the same dependency with a different version (and public token). .NET doesn't really allow this without a good amount of finagling.\r\n> \r\n> /cc @daxian-dbw @rjmholt this is one scenario that would be made possible if PowerShell had some support for separating AssemblyLoadContexts between modules.\r\nI understood that it is because of a dependent assembly but what I am not sure of is this https://devblogs.microsoft.com/powershell/resolving-powershell-module-assembly-dependency-conflicts/#comment-398\r\n\r\n<blockquote><img src=\"https://camo.githubusercontent.com/f17d35e8f68b08827695727f7eb8d0a599ec43cb/68747470733a2f2f646576626c6f67732e6d6963726f736f66742e636f6d2f706f7765727368656c6c2f77702d636f6e74656e742f75706c6f6164732f73697465732f33302f323032302f30362f6d6f64756c65636f6e666c6963742e706e67\" width=\"48\" align=\"right\"><div><img src=\"https://devblogs.microsoft.com/powershell/wp-content/uploads/sites/30/2019/02/Powershell_2561.png\" height=\"14\"> PowerShell</div><div><strong><a href=\"https://devblogs.microsoft.com/powershell/resolving-powershell-module-assembly-dependency-conflicts/\">Resolving PowerShell Module Assembly Dependency Conflicts | PowerShell</a></strong></div><div>When writing a PowerShell module, especially a binary module (i.e. one written in a language like C# and loaded into PowerShell as an assembly/DLL), it’s natural to take dependencies on other packages or libraries to provide functionality. Taking dependencies on other libraries is usually desirable for code reuse.</div></blockquote>\r\n\r\nWhy PWSH allows older version of the same module to be loaded into the same ALC (PWSH default ALC) even though it has a newer version of the same module already loaded but not vice-versa?",
      "created_at": "2020-07-20T15:03:26Z",
      "updated_at": "2020-07-20T15:07:54Z"
    },
    {
      "author": "SeeminglyScience",
      "author_association": "COLLABORATOR",
      "body": "> Why PWSH allows older version of the same module to be loaded into the same ALC (PWSH default ALC) even though it has a newer version of the same module already loaded but not vice-versa?\r\n\r\nIt doesn't, but if you reference version `0.1.0` of an assembly and you have `0.2.0` loaded, assembly resolution sees that and says \"probably works\".  Most assemblies are backwards compatible, the problem is when you have already loaded `0.1.0` but specifically reference `0.2.0`, because then there is probably an API that you need that isn't there.\r\n\r\nNote that none of this really has much to do with PowerShell specifically, these are .NET rules.  You're just less likely to run into the same problems outside of PowerShell because most C# projects get their own process.  As a module in PowerShell, all of these different projects share the same process/appdomain/ALC.",
      "created_at": "2020-07-20T15:27:34Z",
      "updated_at": "2020-07-20T15:27:34Z"
    },
    {
      "author": "arunswarnam",
      "author_association": "NONE",
      "body": "> > Why PWSH allows older version of the same module to be loaded into the same ALC (PWSH default ALC) even though it has a newer version of the same module already loaded but not vice-versa?\r\n> \r\n> It doesn't, but if you reference version `0.1.0` of an assembly and you have `0.2.0` loaded, assembly resolution sees that and says \"probably works\". Most assemblies are backwards compatible, the problem is when you have already loaded `0.1.0` but specifically reference `0.2.0`, because then there is probably an API that you need that isn't there.\r\n> \r\n> Note that none of this really has much to do with PowerShell specifically, these are .NET rules. You're just less likely to run into the same problems outside of PowerShell because most C# projects get their own process. As a module in PowerShell, all of these different projects share the same process/appdomain/ALC.\r\n\r\nOh! So PWSH doesn't actually load the older version of the assembly and just relies on the backward compatibility of the assembly to work correctly? \r\nLooking at all the answers loading dependent assemblies into an isolated ALC seems to be next step forward for our use case. ",
      "created_at": "2020-07-20T15:35:02Z",
      "updated_at": "2020-07-20T15:35:02Z"
    },
    {
      "author": "SeeminglyScience",
      "author_association": "COLLABORATOR",
      "body": "> Oh! So PWSH doesn't actually load the older version of the assembly and just relies on the backward compatibility of the assembly to work correctly?\r\n\r\nYeah, more specifically that's how .NET's assembly resolution works.  PowerShell doesn't really have a hand in it afaik.\r\n\r\nIt's not perfect, it's possible for minor versions to have breaking changes like changing a method overload or something.  In those cases it'll throw a JIT time exception which is very hard for the consumer to pin down. So if you own the dependency, try very hard to keep binary compatibility.\r\n\r\n> Looking at all the answers loading dependent assemblies into an isolated ALC seems to be next step forward for our use case.\r\n\r\nMake sure to read through the linked issues and be sure that you understand the challenges it presents.  Once you have it up and running make sure any type you return is either from the global ALC, or is not accepted by any other API.  For example don't isolate newtsonsoft and then emit a `JObject` to the pipeline because it's type identity will not match the type identity that other assemblies expect.\r\n\r\nRight now the only time I would personally recommend this approach is if your module is intended to be loaded into an environment where it's presence should be mostly invisible.  For example, the module that the `vscode-powershell` extension loads must have as little impact on the process as possible or it's value diminishes (like if a script breaks purely because of the editor you're testing it in, that's problematic).  That's significantly less true for most projects.\r\n",
      "created_at": "2020-07-20T15:56:03Z",
      "updated_at": "2020-07-20T15:57:14Z"
    },
    {
      "author": "msftbot[bot]",
      "author_association": "NONE",
      "body": "This issue has been marked as answered and has not had any activity for **1 day**. It has been closed for housekeeping purposes.",
      "created_at": "2020-07-22T00:00:10Z",
      "updated_at": "2020-07-22T00:00:10Z"
    }
  ],
  "created_at": "2020-07-19T19:48:27Z",
  "labels": [
    "Issue-Question",
    "Resolution-Answered"
  ],
  "number": 13213,
  "state": "closed",
  "title": "Question on common dependency binary cmdlet module ",
  "updated_at": "2020-07-22T00:00:13Z"
}