{
  "_url": "https://github.com/PowerShell/PowerShell/issues/13581",
  "author": "asears",
  "body": "## Summary of the new feature/enhancement\r\n\r\nBy default, a script which only contains functions with their help does not display any output when using \r\n\r\n```powershell\r\nGet-Help .\\myscript.ps1\r\n```\r\nThis behavior also happens if the parameters or syntax of the synopsis is incorrect.  \r\n\r\n<!-- \r\nA clear and concise description of what the problem is that the new feature would solve.\r\nTry formulating it in user story style (if applicable):\r\n'As a user I want X so that Y.' with X being the being the action and Y being the value of the action.\r\n-->\r\n\r\n## Proposed technical implementation details (optional)\r\n\r\nDisplay the list of functions within the script with their help, or some meaningful information from the script, instead of empty result.\r\n\r\nAn option to validate the synopsis of the script and each function's synopsis, or warn on synopsis errors would be helpful.\r\n\r\n<!-- \r\nA clear and concise description of what you want to happen.\r\nConsider providing an example PowerShell experience with expected result.\r\n-->\r\n",
  "closed_at": "2020-09-11T02:16:34Z",
  "comments": [
    {
      "author": "kvprasoon",
      "author_association": "CONTRIBUTOR",
      "body": "Not sure, Get-Help is intended to show help for PowerShell concepts and commands, including cmdlets, functions, CIM\r\ncommands, workflows, providers, aliases and scripts. It accepts one item and AFAIK, doesn't expect passing a library of functions defined in a file.",
      "created_at": "2020-09-06T16:14:37Z",
      "updated_at": "2020-09-06T16:14:37Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "Generally speaking, if you want help included with the script, you'd need to add a comment-based help block to the script itself. So this is to some extent already doable. Part of the reason perhaps that PS doesn't scan entire scripts for _function_ help blocks is that the function itself doesn't exist in the PS session unless you dot source the script.\r\n\r\nIt won't do that automatically, because there's no way to tell if running that script in order to import the functions may have side effects.\r\n\r\nI get the impression that if you need the help data to be available in the PS session, you should probably be packaging the script as or with a module containing those functions. A script that has some functions _and_ also does some other things creates a bit of a catch-22, where the user and the PS engine can't really query the functions directly without also invoking the rest of the code in the script. And you can't really use the AST to find the function blocks and parse their help individually either; comments don't exist in the AST, they only exist as tokens.\r\n\r\nMy general feeling is that this use case is uncommon and would be much easier to manage as a module, and help would \"just work\" if that were the case.",
      "created_at": "2020-09-06T21:37:10Z",
      "updated_at": "2020-09-06T21:37:37Z"
    },
    {
      "author": "asears",
      "author_association": "NONE",
      "body": "That makes sense to me, thanks.  I wonder if get-help could just stupidly parse the text of the file as a fallback?  Probably internal issue there.\r\n\r\nIt would help to have some synopsis validation tool though, rather than silent failure.\r\n\r\nAn example here would be\r\n\r\n```powershell\r\n<# \r\n.SYNOPSIS \r\nmy script\r\n.PARAMETER\r\ndoes not work\r\n#>\r\n[CmdletBinding()]\r\nparam()\r\n#>\r\n```\r\nI have synopsis, so I would expect it would pick that up then throw warning or exception about syntax, rather than ignore this case altogether.\r\n\r\nI found that PlatyPS picked up this particular issue for me using New-MarkdownHelp - with another unhelpful error.\r\nWill close this issue and leave the rest up to using templates for help.",
      "created_at": "2020-09-11T02:16:34Z",
      "updated_at": "2020-09-11T02:16:34Z"
    }
  ],
  "created_at": "2020-09-05T06:04:59Z",
  "number": 13581,
  "state": "closed",
  "title": "Get-Help with function script should return help of all functions in the script",
  "updated_at": "2020-09-11T02:16:35Z"
}