{
  "_url": "https://github.com/PowerShell/PowerShell/issues/13617",
  "author": "bagajjal",
  "body": "Enter-PSSession is doing something wrong with IO redirection.\r\n\r\nHere is my setup,\r\nI have 3 machines (2 Ubuntu VMs, 1 Windows VM).\r\nFrom one of the Ubuntu VM, do Enter-PSSession to Windows VM and then do SSH to another Ubuntu VM.\r\nUbuntuVM_1 ----(Enter-PSSession)----> windows m/c -------(SSH)----->UbuntuVM_2.\r\n\r\nSSH connection get's stuck. I tried to print the ssh client logs to console but it fails.\r\n\r\nI tried to use SSH instead of Enter-PSSession. It works flawless.\r\nUbuntuVM_1 ----(SSH)----> windows m/c -------(SSH)----->UbuntuVM_2.\r\n\r\nHere are the screenshots for both the scenarios,\r\n\r\nAfter Enter-PSSession, tried to ssh with Win32OpensSH Client, Windows GIT SSH Client. \r\nWith win32OpenSSH client, control doesn't return and it's stuck.\r\nWith Windows GIT SSH client, control returns but the SSH connection is closed i.e., no interactive SSH session.\r\n![image](https://user-images.githubusercontent.com/23668037/92844026-410b6380-f39a-11ea-8db4-1aadb9513597.png)\r\n\r\nWith SSH (everywhere) it works fine.\r\n![image](https://user-images.githubusercontent.com/23668037/92841576-5df26780-f397-11ea-9002-05b407abbcba.png)\r\n",
  "closed_at": "2021-01-18T06:05:32Z",
  "comments": [
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "@SteveL-MSFT @PaulHigin Maybe MSFT team creates a Design document to define which remote scenarios should be/are supported?",
      "created_at": "2020-09-11T03:48:42Z",
      "updated_at": "2020-09-11T03:48:42Z"
    },
    {
      "author": "PaulHigin",
      "author_association": "COLLABORATOR",
      "body": "This is not supported.  You cannot run an SSH client from within a PowerShell SSH remoting session because the StdIn/StdOut pipes are redirected to pass the remoting protocol messages.",
      "created_at": "2020-09-11T15:21:36Z",
      "updated_at": "2020-09-11T15:21:36Z"
    },
    {
      "author": "bagajjal",
      "author_association": "NONE",
      "body": "@PaulHigin - Not sure why it is not doable when nested interactive SSH sessions are possible.\r\n\r\nWhen Enter-PSSession is using SSH as a transport, I expect the traffic should flow through a named pipe (between powershell, ssh client on the same machine) which is not STDIN/STDOUT pipes. If not then changing this will solve the problem?",
      "created_at": "2020-09-11T17:46:28Z",
      "updated_at": "2020-09-11T17:46:28Z"
    },
    {
      "author": "jborean93",
      "author_association": "COLLABORATOR",
      "body": "@PaulHigin can correct me if I'm wrong here but as I understand it the issue with PSRemoting, what `Enter-PSSession` uses, is it uses an SSH subsystem that exchange bytes back and forth between the client and server. This subsystem is started based on the command specified in your `sshd_config`\r\n\r\n> Subsystem powershell c:/progra~1/powershell/7/pwsh.exe -sshs -NoLogo\r\n\r\nBasically when sshd gets a request to connect to the `powershell` subsystem it will start a new process based on that config entry and use the stdio pipes for that ssh connection as the new process' SSH pipes. That means your ssh session's stdout is the same pipe that is attached to `pwsh.exe -sshd -NoLogo`. From there any data sent from the PowerShell client is sent over the stdin pipe to pwsh and any data received is from the pwsh stdout pipe. This data is encapsulated in a simple XML message like\r\n\r\n```xml\r\n<Data Stream='Default' PSGuid='00000000-0000-0000-0000-000000000000'>PSRP fragment(s)</Data>\r\n```\r\n\r\nAny messages exchanged between the client and the server are all in these XML messages, that's unlike a normal ssh session where you've simply reading and writing to the stdout/stdin like a normal process. So if you tried to nest an SSH connection that had interactive input then PowerShell would need a way to read and write to those new pipes in a way that didn't affect the PSRP data exchanges.",
      "created_at": "2020-09-11T19:11:11Z",
      "updated_at": "2020-09-11T19:11:11Z"
    }
  ],
  "created_at": "2020-09-11T02:20:19Z",
  "labels": [
    "Issue-Question",
    "Resolution-Answered",
    "WG-Remoting"
  ],
  "number": 13617,
  "state": "closed",
  "title": "Failed to launch interactive ssh session over Enter-PSSession",
  "updated_at": "2021-01-18T06:05:32Z"
}