{
  "_url": "https://github.com/PowerShell/PowerShell/issues/13656",
  "author": "kyanha",
  "body": "## Summary of the new feature/enhancement\r\n\r\nSet-Content, Clear-Content, and Get-Content should, but currently do not, work on datastreams set on directories.\r\n\r\nBug #10570 requested that `Get-Item name -Stream streamname` should work the same way for directories that it does for files. Previously, there existed a check that bypassed any datastreams being looked for on directories, but NTFS supports it.  PR #13650 allows for this operation.\r\n\r\nDuring the process of writing the tests for #13650, I found that Set-Content would not set a stream on a directory (because Clear-Content does not work on directories).  As such, I had to call out to cmd.exe to do so, but the interaction between PowerShell and cmd led to the string it was set to to be followed by two newlines, and I had to change the size test accordingly.\r\n\r\nIf it's possible to read datastreams on directories, it should be possible to write them.\r\n\r\n## Proposed technical implementation details (optional)\r\n\r\nGet-Content for datastreams on directories should not return an error that the user should use Get-ChildItem instead.\r\nSet-Content for datastreams on directories should behave the same way that it does for datastreams on files.  Because Set-Content calls Clear-Content, Clear-Content needs to be changed to look for a -Stream parameter and bypass the directory check if that parameter is provided.  Set-Content may also have additional directory checks which would need to be bypassed if a -Stream parameter were provided, but I have not investigated that far.\r\n\r\n",
  "closed_at": "2020-12-08T01:31:56Z",
  "comments": [
    {
      "author": "msftbot[bot]",
      "author_association": "NONE",
      "body": ":tada:This issue was addressed in #13941, which has now been successfully released as `v7.2.0-preview.2`.:tada:\n\nHandy links:\n* [Release Notes](https://github.com/PowerShell/PowerShell/releases/tag/v7.2.0-preview.2)\n",
      "created_at": "2020-12-15T21:37:50Z",
      "updated_at": "2020-12-15T21:37:50Z"
    }
  ],
  "created_at": "2020-09-18T18:58:09Z",
  "labels": [
    "Issue-Enhancement",
    "Up-for-Grabs",
    "WG-Cmdlets-Management"
  ],
  "number": 13656,
  "state": "closed",
  "title": "Get-Content, Set-Content, and Clear-Content should work with datastreams set on directories",
  "updated_at": "2020-12-15T22:40:15Z"
}