{
  "_url": "https://github.com/PowerShell/PowerShell/issues/1369",
  "author": "HemantMahawar",
  "body": "",
  "closed_at": "2016-07-28T01:35:12Z",
  "comments": [
    {
      "author": "vors",
      "author_association": "COLLABORATOR",
      "body": "I think we should also align our nuget packages versions that we produce on appveyor.\nIt's controlled by 2 things: the first part (\"6.0.0-*\") is \"version\" in all our project.json files.\nThe second part (\"alpha.<build>\") is a \"VersionSuffix\" from `Publish-NugetFeed` https://github.com/PowerShell/PowerShell/blob/0a87a3d8288d6ff5a3ee22a1b0edbcec40e61542/build.psm1#L745\n\nNow, because we have 2 build systems (appveyor and travis ci) it's all becoming a little bit more tricky. We cannot (easily) sync build numbers between them.\nI think it's fine for nuget packages for SDK purposes: we publish only from appveyor at the moment. So there is no ambiguity.\n\nHowever, using build numbers as a naming sequence is inconvenient for Windows and Linux. They would have two different sequence without relations to each other. It would be more convinient to have the same version, if they build from the same commit.\nI propose use some approach similar to what @JamesWTruher took for `$PSVersionTable.GitCommitId`: approach based on the number of commits. It will allow us generate consistent sequence on both CI systems without additional synchronization. \n\nAnother related thing I'd like to discuss is the format of naming.\nI expect that we will do multiply releases under \"alpha\" state of the product. For instance, we currently have milestones `6.0.0-alpha.8` and `6.0.0-alpha.9`. It make a lot of sense for me. I think we should re-use this name pattern for product versions as well. SemVer [allows](http://semver.org/#spec-item-11) making constructions like `6.0.0-alpha.8.21300` (where 21300 is the build number). This way, nobody needs to map build numbers into release tags/dates by hand, like people do now https://www.powershellgallery.com/packages/PSVersion/1.5\n",
      "created_at": "2016-07-21T15:34:05Z",
      "updated_at": "2016-07-21T15:36:59Z"
    },
    {
      "author": "joeyaiello",
      "author_association": "CONTRIBUTOR",
      "body": "@HemantMahawar and I think we should just ditch the _.8._ and replace it with just the build number. @HemantMahawar also thinks, if there's some way to push AppVeyor to do this, that we should round up for \"real releases\" (especially production ready releases) so that those releases are easier to identify/remember. \n",
      "created_at": "2016-07-21T21:16:27Z",
      "updated_at": "2016-07-21T21:16:27Z"
    },
    {
      "author": "vors",
      "author_association": "COLLABORATOR",
      "body": "So how the nuget package from something between alpha.8 and alpha.9 should be named?\n",
      "created_at": "2016-07-21T21:18:25Z",
      "updated_at": "2016-07-21T21:18:25Z"
    }
  ],
  "created_at": "2016-07-14T16:31:01Z",
  "number": 1369,
  "state": "closed",
  "title": "Change the PowerShell version ($PSVersionTable.PSVersion) to 6.0.0-alpha.<build>",
  "updated_at": "2016-08-04T21:11:18Z"
}