{
  "_url": "https://github.com/PowerShell/PowerShell/issues/13715",
  "author": "axobel",
  "body": "When I open any application using Start-Process in PowerShell Core the **DPI Awareness of the process is Unaware** causing scaling problems with the applications on a HiDPI display. Fonts appear blurry or scaled incorrectly, dialogs are unreadable, etc.. \r\n\r\nI have tested this in a PowerShell Core window and through a Windows Terminal PowerShell Core session and both have the same issue. Windows PowerShell sets the DPI Awareness correctly to System through PowerShell ISE, a PowerShell window, and a Windows Terminal PowerShell session.\r\n\r\nThe DPI Awareness setting of the running process can be seen through Task Manager > Details (Tab) > DPI Awareness (Column).\r\n\r\n## Steps to reproduce\r\n\r\n```\r\n1. Run `Start-Process outlook` in any PowerShell Core session.\r\n\r\n```\r\n\r\n## Expected behavior\r\n\r\n```\r\nThe application opens with the system default scaling settings (200% on my display panel), with DPI Awareness set to System. \r\n```\r\n\r\n## Actual behavior\r\n\r\n```\r\nThe application opens with DPI Awareness set to Unaware. \r\n```\r\n\r\n## Environment data\r\n\r\n```\r\nName                           Value\r\n----                           -----\r\nPSVersion                      7.1.0-rc.1\r\nPSEdition                      Core\r\nGitCommitId                    7.1.0-rc.1\r\nOS                             Microsoft Windows 10.0.19041\r\nPlatform                       Win32NT\r\nPSCompatibleVersions           {1.0, 2.0, 3.0, 4.0ÔÇª}\r\nPSRemotingProtocolVersion      2.3\r\nSerializationVersion           1.1.0.1\r\nWSManStackVersion              3.0\r\n\r\n```\r\n![outlook_dpi_unaware](https://user-images.githubusercontent.com/65114226/94650501-84a11f80-02ff-11eb-8b63-f8a080fa72d2.png)",
  "closed_at": "2020-09-30T18:32:59Z",
  "comments": [
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "/cc @DHowett",
      "created_at": "2020-09-30T12:02:22Z",
      "updated_at": "2020-09-30T12:02:22Z"
    },
    {
      "author": "DHowett",
      "author_association": "NONE",
      "body": "> Windows PowerShell sets the DPI Awareness correctly to System through PowerShell ISE, a PowerShell window, and a Windows Terminal PowerShell session.\r\n\r\nInteresting.\r\n\r\nPerhaps there was a change to the .NET process API PowerShell is using between Framework and Core?\r\n\r\nThe console host cannot control this, so I'm afraid I won't be of much help :smile:",
      "created_at": "2020-09-30T15:57:17Z",
      "updated_at": "2020-09-30T15:57:17Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "@axobel Could you reproduce this with a simple C# application?",
      "created_at": "2020-09-30T16:32:43Z",
      "updated_at": "2020-09-30T16:32:43Z"
    },
    {
      "author": "axobel",
      "author_association": "NONE",
      "body": "So. I can code in many languages, but I haven't used C# in ages other than using .Net classes in a PowerShell module I am building for my colleagues and I at work. I was going to ask if you knew of an simple open source app I could use to test with but decided to go down another route....\r\n\r\nAfter spending too long searching online for how to set the a programs DPI Awareness property and not coming up with anything concrete in PowerShell, using CIM classes, etc..  I checked the **pwsh.exe DPI Awareness in Task Manager** and it was also Unaware. The problem wasn't occurring before so I think I inadvertently changed it when messing with Soap UI (related to the module that I am building), Java versions and .bat files that don't play well with HiDPI displays. I am moving more and more to working predominantly from the shell in Windows (very good thing) so I was running everything in the shell.\r\n\r\nI ran the **Troubleshooter on pwsh.exe and got it to change its DPI Awareness to Per Monitor**. Now, apps started with Start-Process are appearing as they should, so closing the issue. Sorry to waste your time, but thanks a million for the assist.\r\n\r\nI would still like to know how to mess with the DPI Awareness or get to the property programmatically though... ¯\\_(ツ)_/¯",
      "created_at": "2020-09-30T18:32:59Z",
      "updated_at": "2020-09-30T18:32:59Z"
    }
  ],
  "created_at": "2020-09-30T06:32:10Z",
  "number": 13715,
  "state": "closed",
  "title": "PowerShell Core Start-Process cmdlet opening apps DPI Unaware  ",
  "updated_at": "2020-09-30T18:32:59Z"
}