{
  "_url": "https://github.com/PowerShell/PowerShell/issues/13749",
  "author": "ThomasNieto",
  "body": "Please add the `Hacktober` topic to the repository to opt-in to the event. Here is some additional information for the event.\r\n\r\nAfter working closely with our friends at GitHub, we are happy to introduce measures that are brand new to Hacktoberfest 2020.\r\n\r\n* Pull requests can be made in any participating GitHub-hosted repositories/projects.\r\n\r\n* Maintainers can opt-in to participate by classifying their projects with the hacktoberfest topic. https://youtu.be/FxBv4FMcDgo\r\n\r\n* Your pull requests will count toward your participation if they are in a repository with the hacktoberfest topic and once they have been merged, approved by a maintainer or labelled as hacktoberfest-accepted.\r\n\r\n* Additionally, any pull request with the hacktoberfest-accepted label, submitted to any public GitHub repository, with or without the hacktoberfest topic, will be considered valid for Hacktoberfest.",
  "closed_at": "2020-10-13T01:49:27Z",
  "comments": [
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "We already have `Hacktoberfest` label.\r\n\r\nProblem is that now we are in intermediate period - RC1, then RC2 - so all another work excluding release stabilization is frozen.",
      "created_at": "2020-10-06T09:50:17Z",
      "updated_at": "2020-10-06T09:50:17Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "@iSazonov the `hacktoberfest` label itself is not recognised by DigitalOcean from what I can tell.\r\n\r\nIf we wanted to allow PRs to count towards hacktoberfest we'd need to add the topic to the repository itself, and also add a `hacktoberfest-accepted` label for PRs.",
      "created_at": "2020-10-06T12:00:04Z",
      "updated_at": "2020-10-06T12:00:04Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "I see they changed rules. Now they exclude repositories from the project by default.\r\n\r\nWe need a confirmation from MSFT team if they want to participate in the project and accept PRs in the time.\r\n\r\n/cc @joeyaiello @SteveL-MSFT \r\n",
      "created_at": "2020-10-06T12:23:14Z",
      "updated_at": "2020-10-06T12:23:14Z"
    },
    {
      "author": "SeeminglyScience",
      "author_association": "COLLABORATOR",
      "body": "Note that adding the topic isn't really a commitment to reviewing the PR any time soon (or at all really). Unless the PS team was considering disabling PR's all together I don't think there's a reason not to add it.\r\n\r\n(Not suggesting it be added without checking with them, just clarifying)",
      "created_at": "2020-10-06T13:45:08Z",
      "updated_at": "2020-10-06T13:45:41Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "Aye. I think it might be a good idea for maintainers to go through PRs submitted during the hacktoberfest period and tag the ones that look likely to be accepted as `hacktoberfest-accepted` so that the contribution is recognised, even if it takes longer for the review to be completed and/or the PR to be merged.",
      "created_at": "2020-10-06T17:45:00Z",
      "updated_at": "2020-10-06T17:45:00Z"
    },
    {
      "author": "SeeminglyScience",
      "author_association": "COLLABORATOR",
      "body": "Yeah, hopefully that's something outside collaborators can do as well (just yourself and @iSazonov right?).  Should be pretty quick to determine if something is just spam.",
      "created_at": "2020-10-06T17:54:13Z",
      "updated_at": "2020-10-06T17:54:13Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "Yeah, I can help make sure we label stuff appropriately as needed, as long as the label is created already (I can't create tags, but I can apply/remove them where appropriate). 🙂  \r\n\r\nWe should also make sure we have an `invalid` or `spam` label in case we get any spammy PRs.",
      "created_at": "2020-10-06T18:05:32Z",
      "updated_at": "2020-10-06T18:05:32Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "I've already added the `hacktoberfest` topic to this repo.  I'll add the `hacktoberfest-accepted` label to be used with PRs.",
      "created_at": "2020-10-12T23:26:07Z",
      "updated_at": "2020-10-12T23:26:07Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "Looks like that's all sorted, so I guess we can call this one covered for now. 🙂 ",
      "created_at": "2020-10-13T01:49:27Z",
      "updated_at": "2020-10-13T01:49:27Z"
    }
  ],
  "created_at": "2020-10-05T23:16:54Z",
  "number": 13749,
  "state": "closed",
  "title": "Add Hacktober topic to repository",
  "updated_at": "2020-10-13T01:49:35Z"
}