{
  "_url": "https://github.com/PowerShell/PowerShell/issues/13987",
  "author": "vrpalla-rms",
  "body": "## PowerShell docker container security module\r\nAvailability of complete security module in docker PowerShell container\r\n\r\n## Technical details\r\nTo enforce permissions on our network file shares, we are using the security module within PowerShell. The following commands (get-acl, set-acl) are used to acquire the permissions from root of the share and push them onto the subfolders and files. These commands are released in Windows PowerShell version3. \r\n\r\nResearching online, as only the core version of PowerShell is supported on Linux as of now, these commands aren't available. It appears these are only supported on the full version.\r\n\r\nAvailability of the complete security module in PowerShell container would be crucial for our use case. Else, if it is possible to install the module in container, please feel free to point me to the documentation.\r\n\r\nPlease find the details of PowerShell container used\r\nPowerShell container: mcr.microsoft.com/powershell:7.0.0-preview.6-centos-7",
  "closed_at": "2020-11-07T12:00:04Z",
  "comments": [
    {
      "author": "jborean93",
      "author_association": "COLLABORATOR",
      "body": "There are 2 issues I see with supporting the `*-Acl` cmdlets on that Docker container because it runs on Linux\r\n\r\n* Accessing paths would need to be mounted\r\n    * Linux does not natively support the UNC paths that you expect on Windows like `\\\\server\\share\\path`\r\n    * You usually use something like [smbclient](https://www.samba.org/samba/docs/current/man-html/smbclient.1.html) to map the network path to a local path like `/mnt/server/share/path`\r\n    * So while possible it requires some more system packages and set up for you to access these paths in PowerShell\r\n* The underlying .NET classes that the `*-Acl` cmdlets use are heavily dependent on Windows specific structures like [SECURITY_DESCRIPTOR](https://docs.microsoft.com/en-us/windows/win32/api/winnt/ns-winnt-security_descriptor), [ACEs](https://docs.microsoft.com/en-us/windows/win32/secauthz/ace), [Security Identifiers](https://docs.microsoft.com/en-us/windows/security/identity-protection/access-control/security-identifiers)\r\n    * While it's possible to craft this stuff outside of Windows it requires a lot of work to just implement\r\n    * SMB does support getting/setting the security descriptor of an object but it's up to the client to expose this functionality\r\n    * The way this is done can differ based on the client that has mounted the path\r\n* Even if the above is handled, translating Security Identifiers to an actual account name requires even more work\r\n    * This might be provided by the client but will need even more configuration to be able to make the RPC calls to the domain controller\r\n\r\nAll this work is technically outside the realm of PowerShell. I'm sure it is all theoretically possible but would require a lot of ground work to be done and even then it may be difficult to set up properly. Your best bet is to\r\n\r\n* Run a Windows container that runs PowerShell Core\r\n    * This will have the required .NET libraries and give you the ability to access UNC paths like you normally expect on Windows\r\n* Use the native tools available on Linux to mount and edit the SDs through the binaries they provide",
      "created_at": "2020-11-04T21:28:53Z",
      "updated_at": "2020-11-04T21:28:53Z"
    },
    {
      "author": "vrpalla-rms",
      "author_association": "NONE",
      "body": "@jborean93 Thank you for the detailed technical explanation and the quick response.\r\n\r\nThe explanation makes complete sense as to why it would be difficult to achieve this in a Linux docker environment.\r\n\r\nDoes it mean if we have a Windows docker environment, running the same PowerShell container would work there as it would have the underlying libraries (or) would it still be the same?",
      "created_at": "2020-11-05T18:35:30Z",
      "updated_at": "2020-11-05T18:35:30Z"
    },
    {
      "author": "jborean93",
      "author_association": "COLLABORATOR",
      "body": "> Does it mean if we have a Windows docker environment, running the same PowerShell container would work there as it would have the underlying libraries (or) would it still be the same?\r\n\r\nWill work for a Windows container as the .NET libraries and the underlying system can understand all that.",
      "created_at": "2020-11-05T22:36:22Z",
      "updated_at": "2020-11-05T22:36:22Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "You could use PowerShell remoting to connect to a Windows system and run needed commands there.",
      "created_at": "2020-11-06T10:47:51Z",
      "updated_at": "2020-11-06T10:47:51Z"
    },
    {
      "author": "msftbot[bot]",
      "author_association": "NONE",
      "body": "This issue has been marked as answered and has not had any activity for **1 day**. It has been closed for housekeeping purposes.",
      "created_at": "2020-11-07T12:00:03Z",
      "updated_at": "2020-11-07T12:00:03Z"
    }
  ],
  "created_at": "2020-11-04T19:58:00Z",
  "labels": [
    "Issue-Question",
    "Resolution-Answered"
  ],
  "number": 13987,
  "state": "closed",
  "title": "PowerShell docker container security module",
  "updated_at": "2020-11-07T12:00:04Z"
}