{
  "_url": "https://github.com/PowerShell/PowerShell/issues/14251",
  "author": "nathan-alden-hp",
  "body": "## Summary of the new feature/enhancement\r\n\r\nIn the programming world, developers are encouraged to follow a \"one type per file\" rule. I am trying to apply this rule to classes in PowerShell. Unfortunately, I can't find a way to allow my editor (VS Code in my case) to \"see\" types in other files. Consider this trivial case where I have a module consisting of two classes:\r\n\r\n### `Class1.ps1`\r\n\r\n```ps\r\nclass Class1 {\r\n    [void]Method() {}\r\n}\r\n```\r\n\r\n### `Class2.ps1`\r\n\r\n```ps\r\nclass Class2 {\r\n    Class2() {\r\n        $c = [Class1]::new() # VS Code reports \"unable to find type [Class1]\"\r\n        $c. # Typing the dot does not display any members\r\n    }\r\n}\r\n```\r\n\r\n![image](https://user-images.githubusercontent.com/40613229/100155223-e059d600-2e74-11eb-9b49-0b6b147d4df2.png)\r\n\r\nI know _why_ the warning occurs, but this effectively forces me to declare all my types in a single file in order to benefit from VS Code's PowerShell analyzer. That means with a big enough number of types, the single file can easy reach thousands of lines, making it harder to maintain and making it harder to tell via Git diffs what types were changed.\r\n\r\nIs there a way around this problem?\r\n\r\n## Proposed technical implementation details (optional)\r\n\r\nI'm not sure what can be done to improve the developer experience, but as it stands now this is preventing me from using classes to their full extent in my more complex PowerShell modules. I know I could always create a full-blown C# project, but that introduces build pipeline and CI dependencies I'm trying to avoid. It also means developers who work on my module need to be more aware of .NET tools like Visual Studio than they otherwise would be.\r\n\r\nSome kind of special comment used by the analyzer to temporarily import other files, perhaps? I'm not sure that would be directly related to PowerShell itself.\r\n",
  "closed_at": "2020-11-24T21:59:44Z",
  "comments": [
    {
      "author": "nathan-alden-hp",
      "author_association": "NONE",
      "body": "Recreated in the correct place.\r\n\r\nhttps://github.com/PowerShell/PSScriptAnalyzer/issues/1617",
      "created_at": "2020-11-24T21:59:44Z",
      "updated_at": "2020-11-24T22:00:18Z"
    }
  ],
  "created_at": "2020-11-24T21:50:55Z",
  "labels": [
    "Issue-Enhancement"
  ],
  "number": 14251,
  "state": "closed",
  "title": "Some kind of mechanism to allow types in other files to be seen by editors like VS Code",
  "updated_at": "2020-11-24T22:00:18Z"
}