{
  "_url": "https://github.com/PowerShell/PowerShell/issues/14281",
  "author": "iSazonov",
  "body": "<!-- Anything that looks like this is a comment and can't be seen after the Pull Request is created. -->\r\n\r\n# PR Summary\r\n\r\nAt startup we send a telemetry that delays the startup.\r\nThe delay is from 10 to 100 ms on my notebook but under other conditions this delay may be even worse (issues with DNS, network, target telemetry service).\r\n- TrackEvent() is sync and causes ApplicationInsightsTelemetry static class initialization\r\n- GetMetric().TrackValue() delays sending telemetry on 1 minutes but initialize ApplicationInsightsTelemetry too.\r\n\r\nThe fix is to send startup telemetry in a background thread with 500 ms delay.\r\n\r\nOpen question is how many do we want to postpone the send? Current value is 500 ms. This corresponds to the start time of pwsh. If we reduce this time, it may slow down the launch. If we increase this time, we can lose telemetry for short processes.\r\nAdditionally, we could add a wait for this task to complete in PowerShell exit code to ensure that the telemetry is transmitted\r\n \r\n\r\n#### Perf win on my notebook:\r\n- 35 ms ApplicationInsightsTelemetry..cctor()\r\n- from 10 ms up to 100 ms telemetry send\r\n\r\nScreenshots show the delays we removed:\r\n![image](https://user-images.githubusercontent.com/22290914/100523030-fea23780-31ce-11eb-876c-756e6f8d1fd7.png)\r\n\r\n![image](https://user-images.githubusercontent.com/22290914/100523037-0a8df980-31cf-11eb-8c51-848b7a4997ff.png)\r\n\r\n\r\n## PR Context\r\n\r\nTracking issue #14268\r\n\r\n## PR Checklist\r\n\r\n- [x] [PR has a meaningful title](https://github.com/PowerShell/PowerShell/blob/master/.github/CONTRIBUTING.md#pull-request---submission)\r\n    - Use the present tense and imperative mood when describing your changes\r\n- [x] [Summarized changes](https://github.com/PowerShell/PowerShell/blob/master/.github/CONTRIBUTING.md#pull-request---submission)\r\n- [x] [Make sure all `.h`, `.cpp`, `.cs`, `.ps1` and `.psm1` files have the correct copyright header](https://github.com/PowerShell/PowerShell/blob/master/.github/CONTRIBUTING.md#pull-request---submission)\r\n- [x] This PR is ready to merge and is not [Work in Progress](https://github.com/PowerShell/PowerShell/blob/master/.github/CONTRIBUTING.md#pull-request---work-in-progress).\r\n    - If the PR is work in progress, please add the prefix `WIP:` or `[ WIP ]` to the beginning of the title (the `WIP` bot will keep its status check at `Pending` while the prefix is present) and remove the prefix when the PR is ready.\r\n- **[Breaking changes](https://github.com/PowerShell/PowerShell/blob/master/.github/CONTRIBUTING.md#making-breaking-changes)**\r\n    - [x] None\r\n    - **OR**\r\n    - [ ] [Experimental feature(s) needed](https://github.com/MicrosoftDocs/PowerShell-Docs/blob/staging/reference/6/Microsoft.PowerShell.Core/About/about_Experimental_Features.md)\r\n        - [ ] Experimental feature name(s): <!-- Experimental feature name(s) here -->\r\n- **User-facing changes**\r\n    - [x] Not Applicable\r\n    - **OR**\r\n    - [ ] [Documentation needed](https://github.com/PowerShell/PowerShell/blob/master/.github/CONTRIBUTING.md#pull-request---submission)\r\n        - [ ] Issue filed: <!-- Number/link of that issue here -->\r\n- **Testing - New and feature**\r\n    - [x] N/A or can only be tested interactively\r\n    - **OR**\r\n    - [ ] [Make sure you've added a new test if existing tests do not effectively test the code changed](https://github.com/PowerShell/PowerShell/blob/master/.github/CONTRIBUTING.md#before-submitting)\r\n- **Tooling**\r\n    - [ ] I have considered the user experience from a tooling perspective and don't believe tooling will be impacted.\r\n    - **OR**\r\n    - [ ] I have considered the user experience from a tooling perspective and enumerated concerns in the summary. This may include:\r\n        - Impact on [PowerShell Editor Services](https://github.com/PowerShell/PowerShellEditorServices) which is used in the [PowerShell extension](https://github.com/PowerShell/vscode-powershell) for VSCode (which runs in a different PS Host).\r\n        - Impact on Completions (both in the console and in editors) - one of PowerShell's most powerful features.\r\n        - Impact on [PSScriptAnalyzer](https://github.com/PowerShell/PSScriptAnalyzer) (which provides linting & formatting in the editor extensions).\r\n        - Impact on [EditorSyntax](https://github.com/PowerShell/EditorSyntax) (which provides syntax highlighting with in VSCode, GitHub, and many other editors).\r\n",
  "closed_at": "2021-11-02T05:57:04Z",
  "comments": [
    {
      "author": "daxian-dbw",
      "author_association": "MEMBER",
      "body": "I didn't know you were doing something similar :)\r\n\r\n> The fix is to send startup telemetry in a background thread with 500 ms delay.\r\n\r\nNo, we cannot delay the 'sending telemetry work' by 500 ms. This will likely cause telemetry to not be sent at all when a user executes command directly using `pwsh -noprofile -c run-a-command`. Startup telemetry should be fired right away and the task  needs to be waited on before `pwsh` exists, so we can make sure the `SendPSCoreStartupTelemetry` call actually run. Please see #14304 for details about how I approached it.\r\n\r\n> TrackEvent() is sync \r\n\r\nWhat do you mean by \"is sync\"? Is it sending out package to the server synchronously (I doubt it ...)?",
      "created_at": "2020-12-02T22:19:24Z",
      "updated_at": "2020-12-02T22:19:24Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "> I didn't know you were doing something similar :)\r\n\r\nI am collecting all in #14268 issue to sync the work with others.\r\n\r\n> > TrackEvent() is sync\r\n> \r\n> What do you mean by \"is sync\"? Is it sending out package to the server synchronously (I doubt it ...)?\r\n\r\nYes, I think it is sending synchronously to to the server. I read docs and best practices and found the recommendation to put it in background. Traces show the same for me.\r\nI am not sure whether it makes sense to ask owners of the package to improve performance/add async-s or maybe MSFT could consider https://github.com/open-telemetry/opentelemetry-dotnet.\r\n\r\n> No, we cannot delay the 'sending telemetry work' by 500 ms. This will likely cause telemetry to not be sent at all when a user executes command directly using pwsh -noprofile -c run-a-command. Startup telemetry should be fired right away and the task needs to be waited on before pwsh exists, so we can make sure the SendPSCoreStartupTelemetry call actually run. Please see #14304 for details about how I approached it.\r\n\r\nI see how you approached it. But my thoughts is again about low-power hardware - \r\nI suppose it is important to do _useful work_ (the short script) as quickly as possible and postpone sending telemetry but make it mandatory. For the latter, the solution could be to add (1) a delay and then (2) await for the background task in PowerShell exit code.\r\n\r\n\n\n<blockquote><img src=\"https://avatars3.githubusercontent.com/u/49998002?s=400&v=4\" width=\"48\" align=\"right\"><div><img src=\"https://github.githubassets.com/favicons/favicon.svg\" height=\"14\"> GitHub</div><div><strong><a href=\"https://github.com/open-telemetry/opentelemetry-dotnet\">open-telemetry/opentelemetry-dotnet</a></strong></div><div>The OpenTelemetry .NET Client. Contribute to open-telemetry/opentelemetry-dotnet development by creating an account on GitHub.</div></blockquote>",
      "created_at": "2020-12-03T04:25:47Z",
      "updated_at": "2020-12-03T04:25:49Z"
    },
    {
      "author": "daxian-dbw",
      "author_association": "MEMBER",
      "body": "> Yes, I think it is sending synchronously to to the server. I read docs and best practices and found the recommendation to put it in background.\r\n\r\nWhere do you see that? Can you share the links? I will also check with @JamesWTruher on this.\r\n\r\n> But my thoughts is again about low-power hardware ... \r\n\r\nOn low-power hardware, it's even less deteministic about whether a task/worker thread can even be scheduled to run, and thus less deteministic about whether what we do here actually make a difference -- it may even be a penalty on those hardwares due to context switching or contention.\r\n\r\nFor #14304, I think I will leverage worker thread only if `Environment.ProcessorCount >= 4`.",
      "created_at": "2020-12-03T06:07:59Z",
      "updated_at": "2020-12-03T06:07:59Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "> Where do you see that? Can you share the links? I will also check with @JamesWTruher on this.\r\n\r\nhttps://github.com/degant/application-insights-best-practices\r\nhttps://docs.microsoft.com/en-us/dotnet/api/microsoft.applicationinsights.telemetryclient.trackmetric?view=azure-dotnet\r\n> This method is not the preferred method for sending metrics. Metrics should always be pre-aggregated across a time period before being sent.\r\nUse one of the GetMetric(..) overloads to get a metric object for accessing SDK pre-aggregation capabilities.\r\n\r\nIf you could confirm it is always async it would be nice.\r\n\r\nAnother question how do we ensure the telemetry has been sent before PowerShell exit? I see TelemetryClient.Flush() async too.\r\n\r\n\r\n> On low-power hardware, it's even less deteministic about whether a task/worker thread can even be scheduled to run, and thus less deteministic about whether what we do here actually make a difference -- it may even be a penalty on those hardwares due to context switching or contention.\r\n\r\nThat is why I am convinced that we should do fewer threads - there are too many of them. We need to reconsider this. Regarding ApplicationInsights, unfortunately we will have to move this to a background thread.\r\nAnd we need to take Experimental Features into account - you don't seem to be doing this, although while people are testing them in real scenarios it should work as fast as release too.\r\n\r\nIn last commits I have tried to make the process more deterministic.\r\n(On Linux the behavior is so strange - s_telemetryCliebt is null but we never assign the null so there is no initialization! - I guess there is a tricky bug.)\r\n\r\n### Update:\r\nafter some thought, I suppose that we'd better wait and first do _all the other optimizations_ that we can, as well as get and evaluate all the benefits of future versions of .Net 6.0 - if we get performance comparable to WinPS, then it generally makes no sense to complicate the code for the sake of ApplicationInsights. It's much better to ask the ApplicationInsights owners to improve this scenario. We have several months to wait. If they do this, then we won't have to do anything and complicate the code.\r\nAlso if a hardware is fast we don't get big perf win with background thread, if a hardware is slow we don't get noticeable perf win too.\r\n\r\n> \r\n> For #14304, I think I will leverage worker thread only if `Environment.ProcessorCount >= 4`.\r\n\r\nIn the case we should make more common improvement and think about _all_ threads - perhaps this helps with scenarios like Wasm (and maybe PSES). Doing this for ApplicationInsights _only_ looks redundant.\r\n\r\n<blockquote><img src=\"https://avatars1.githubusercontent.com/u/6065982?s=400&v=4\" width=\"48\" align=\"right\"><div><img src=\"https://github.githubassets.com/favicons/favicon.svg\" height=\"14\"> GitHub</div><div><strong><a href=\"https://github.com/degant/application-insights-best-practices\">degant/application-insights-best-practices</a></strong></div><div>Application Insights Best Practices for MVC and Web API - degant/application-insights-best-practices</div></blockquote>\r\n<blockquote><img src=\"https://docs.microsoft.com/en-us/media/logos/logo-ms-social.png\" width=\"48\" align=\"right\"><div><strong><a href=\"https://docs.microsoft.com/en-us/dotnet/api/microsoft.applicationinsights.telemetryclient.trackmetric\">TelemetryClient.TrackMetric Method (Microsoft.ApplicationInsights) - Azure for .NET Developers</a></strong></div><div>This method is not the preferred method for sending metrics. Metrics should always be pre-aggregated across a time period before being sent. Use one of the GetMetric(..) overloads to get a metric object for accessing SDK pre-aggregation capabilities. If you are implementing your own pre-aggregation logic, then you can use this method. If your application requires sending a separate telemetry item at every occasion without aggregation across time, you likely have a use case for event telemetry; see TrackEvent(EventTelemetry). </div></blockquote>",
      "created_at": "2020-12-03T07:38:03Z",
      "updated_at": "2020-12-03T12:52:24Z"
    },
    {
      "author": "daxian-dbw",
      "author_association": "MEMBER",
      "body": "I checked with @JamesWTruher and he confirmed that ApplicationInsight does not send telemetry packets to the endpoint (server) in synchronous way. It maintains a in-memory buffer and uses thread pool thread for sending telemetry packets.\r\n\r\nThat's how a tracing library should work -- never sending packets on wire synchronous. Log4Net is bad just for that exact reason.\r\n\r\nPre-aggregation is more about processing the data before sending on the wire, so as to [_\"reducing the volume of data sent from the SDK to the Application Insights collection endpoint\"_](https://docs.microsoft.com/en-us/azure/azure-monitor/app/pre-aggregated-metrics-log-metrics#using-pre-aggregation-with-application-insights-custom-metrics). According to Jim, `TrackEvent` is used for startup telemetry because we are sending non-metric sort of data. _\"Events are amorphous blobs of data, metrics are more akin to performance counters\"_.\r\n\r\n> Another question how do we ensure the telemetry has been sent before PowerShell exit? I see TelemetryClient.Flush() async too.\r\n\r\nIt's a best effort thing. It's possible that a proces may exit before the packets are sent out, even today. But that also means if a task is used for that job, we shouldn't enforce a delay on the task. Also, we probably should wait on that task to finish before giving the initial prompt to user (or something similar when it's `pwsh -c xxx` scenario).\r\n\r\n> That is why I am convinced that we should do fewer threads - there are too many of them. We need to reconsider this.\r\n\r\nI want to remind you again on the philosophy here, leveraging parallel processing doesn't contradict with the work that improves specific/individual code paths. When it's handled correctly, they amplify the final result.\r\n\r\nAs for your concern about the background thread used by ApplicationInsight, I think you overestimated it's impact. The expensive part that I see in the startup telemetry collection, is the loading of the ApplicationInsight assembly and the initialization of types from it.\r\n\r\n> I suppose that we'd better wait and first do all the other optimizations that we can, as well as get and evaluate all the benefits of future versions of .Net 6.0 ...\r\n\r\nI agree. I don't mean to rush my PR to the code base :) I'm not happy with the changes yet, and also it needs more testing to fine-tune the decisions like how many tasks to use, and what work load shall be done in tasks. But we also cannot wait till near the end of the release cycle for a PR like #14304. \r\n\r\nAbout the .NET 6 runtime initialization improvement, can you share links about it?\r\n\r\n",
      "created_at": "2020-12-03T23:27:27Z",
      "updated_at": "2020-12-03T23:27:27Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "> About the .NET 6 runtime initialization improvement, can you share links about it?\r\n\r\nI collect all references in #14268.\r\nMains is https://github.com/dotnet/runtime/issues/44545 and https://github.com/dotnet/runtime/issues/44598\r\nIf you can communicate and work with Stephan Toub directly you have chance to improve PowerShell startup up to 30% I hope. :-)\r\n\r\nMany thanks for clarifications about ApplicationInsight! \r\n \r\n> As for your concern about the background thread used by ApplicationInsight, I think you overestimated it's impact. The expensive part that I see in the startup telemetry collection, is the loading of the ApplicationInsight assembly and **the initialization of types from it**.\r\n\r\nMy worries are only about the initialization. It would be great if you could ask ApplicationInsight owners to improve this.\r\n And you can see other cases in the trace. One with ToLower() we already merged. In #14268 there are others. \r\n\r\n>  Also, we probably should wait on that task to finish before giving the initial prompt to user (or something similar when it's pwsh -c xxx scenario).\r\n\r\nIt is again question for ApplicationInsight owners. I hope they can do more and better than us.\r\n\r\n> I want to remind you again on the philosophy here, leveraging parallel processing doesn't contradict with the work that improves specific/individual code paths. When it's handled correctly, they amplify the final result.\r\n\r\nI completely trust your experience (many thanks for discussions with me), but I have absolutely no idea how this is implemented in depth (after Stephan Toub's articles, I only have an understanding that everything is complicated) and how we could reliably check this in tests, especially for a startup script. \r\nSo I'm still in the opinion that it is better to make a couple of threads fast than hoping that ten pots will be better. This is me about myself, maybe you know how to make these checks reliable.\r\n\r\n> I agree. I don't mean to rush my PR to the code base :)\r\n\r\n:-)))) So it seems we have a chance to see how the open PR counter is rapidly decreasing from 150 to 0 - half of them you and your team can merge in a day as very simple.\r\n\r\nI updated #14268 with our last thoughts - feel free to add more there. Thanks!",
      "created_at": "2020-12-04T04:13:43Z",
      "updated_at": "2020-12-04T04:13:43Z"
    },
    {
      "author": "daxian-dbw",
      "author_association": "MEMBER",
      "body": "> It would be great if you could ask ApplicationInsight owners to improve this.\r\n\r\nI'm afraid the answer would be \"go ahead take a look at our code base, any perf improvement contributions are welcome!\" 😄\r\nTo be fair, the type initialization for many PowerShell types is also pretty expensive, for example, `System.Management.Automation.Utils` -- It's just too large.\r\n\r\nThanks for the compilation in #14268, and I'm glad that we are on the same page now.",
      "created_at": "2020-12-04T06:40:36Z",
      "updated_at": "2020-12-04T06:40:36Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "> I'm afraid the answer would be \"go ahead take a look at our code base, any perf improvement contributions are welcome!\" 😄\r\n\r\nThreaten them migrating to OpenTelemetry 😄\r\n\r\n> To be fair, the type initialization for many PowerShell types is also pretty expensive, for example, `System.Management.Automation.Utils` -- It's just too large.\r\n\r\nYou could open new tracking issue for this and share where we could investigate - I could get involved, maybe prepare fixes and open issues in .Net if needed - now is the right time.\r\n\r\nAlso we could see Source Generators. I made an experiment for TypeGen. This works but the .Net feature is not ready for production (I already sent some feedbacks) and .Net team will actively improve and use them in .Net 6.0.\r\nWe could benefit from Source Generators  too in TypeGen, types.ps1xml convertor, others???",
      "created_at": "2020-12-04T07:15:59Z",
      "updated_at": "2020-12-04T07:15:59Z"
    },
    {
      "author": "daxian-dbw",
      "author_association": "MEMBER",
      "body": "> We could benefit from Source Generators too in TypeGen, types.ps1xml convertor, others???\r\n\r\n`TypeGen`, you mean the `TypeCatalogGen` project? It's a built-time only project, not included in PowerShell package, so I don't see a need of any chnage to it.",
      "created_at": "2020-12-04T17:21:39Z",
      "updated_at": "2020-12-04T17:21:39Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "> > We could benefit from Source Generators too in TypeGen, types.ps1xml convertor, others???\r\n> \r\n> `TypeGen`, you mean the `TypeCatalogGen` project? It's a built-time only project, not included in PowerShell package, so I don't see a need of any chnage to it.\r\n\r\nLike `ResGen`  the `TypeCatalogGen` complicates a life of Linux distribution maintainers. Migrating to MSBuild process helps them.",
      "created_at": "2020-12-04T17:28:25Z",
      "updated_at": "2020-12-04T17:28:25Z"
    },
    {
      "author": "msftbot[bot]",
      "author_association": "NONE",
      "body": "This pull request has been automatically marked as Review Needed because it has been there has not been any activity for **7 days**.\nMaintainer, please provide feedback and/or mark it as `Waiting on Author`",
      "created_at": "2020-12-12T02:00:08Z",
      "updated_at": "2020-12-12T02:00:08Z"
    },
    {
      "author": "daxian-dbw",
      "author_association": "MEMBER",
      "body": "@iSazonov I went through our comments and it looks we were on the same page that this PR is not needed. I will close it now.",
      "created_at": "2021-11-02T05:57:04Z",
      "updated_at": "2021-11-02T05:57:04Z"
    }
  ],
  "created_at": "2020-11-28T18:03:58Z",
  "number": 14281,
  "state": "closed",
  "title": "Send telemetry lazy at startup",
  "updated_at": "2021-11-02T11:42:59Z"
}