{
  "_url": "https://github.com/PowerShell/PowerShell/issues/14290",
  "author": "HumanEquivalentUnit",
  "body": "## Steps to reproduce\r\n\r\nQuery DNS for the name `myip.opendns.com` against the OpenDNS server `resolver1.opendns.com`, it should echo your connection's public IP address.\r\n\r\nNB. it will only retun an A record on an IPv4 connection, an AAAA record on an IPv6 connection; mixing them and querying for an A record using an IPv6 connection returns a \"name not found\" lookup fail. On my connection which supports both IPv4 and IPv6, this happens:\r\n\r\n```powershell\r\nPS C:\\> Resolve-DnsName -Name myip.opendns.com -Server resolver1.opendns.com\r\nresolve-dnsname : myip.opendns.com : DNS name does not exist\r\n```\r\n\r\nA WireShark packet capture shows that this goes out over IPv6 and queries both A and AAAA records. The A record lookup gets a \"DNS name does not exist\" response - lookup fail. The AAAA record gets an IPv6 address back. PowerShell is showing me the fail, rather than the success.\r\n\r\n![image](https://user-images.githubusercontent.com/187787/100550512-5a71cc80-3272-11eb-8a1e-87200fcb3f58.png)\r\n\r\nNB. that I can specify `-Type AAAA` and get a valid result, but I can't see a way to choose whether Resolve-DnsName uses IPv4 or IPv6 for its connection, so I have no way of knowing whether I should specify `-Type A` or `-Type AAAA`. One will match the connection it uses and one will not, so I would have to try both. Which is annoying, given that it defaults to trying both for me already - the only problem is it throws away the more useful result in favour of the less useful result.\r\n\r\n## Expected result\r\n\r\nThe data from the successful query, because it's more useful.\r\n\r\n## Actual result\r\n\r\nThe IPv4 lookup fail takes precedence, I see an exception, and the successful query data is lost to the void. \r\n\r\n## Environment data\r\n\r\n```\r\nName                           Value\r\n----                           -----\r\nPSVersion                      7.1.0\r\nPSEdition                      Core\r\nGitCommitId                    7.1.0\r\nOS                             Microsoft Windows 10.0.19042\r\nPlatform                       Win32NT\r\nPSCompatibleVersions           {1.0, 2.0, 3.0, 4.0…}\r\nPSRemotingProtocolVersion      2.3\r\nSerializationVersion           1.1.0.1\r\nWSManStackVersion              3.0\r\n```",
  "closed_at": "2020-12-02T00:00:05Z",
  "comments": [
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "@HumanEquivalentUnit The cmdlet is not in the repo. It is in DnsClient module. Please use other channels to communicate with the module owners (Windows 10 feedback tool, UserVoice site, forums and so on).",
      "created_at": "2020-11-30T17:46:40Z",
      "updated_at": "2020-11-30T17:46:40Z"
    },
    {
      "author": "msftbot[bot]",
      "author_association": "NONE",
      "body": "This issue has been marked as answered and has not had any activity for **1 day**. It has been closed for housekeeping purposes.",
      "created_at": "2020-12-02T00:00:04Z",
      "updated_at": "2020-12-02T00:00:04Z"
    }
  ],
  "created_at": "2020-11-29T18:57:45Z",
  "labels": [
    "Issue-Question",
    "Resolution-Answered"
  ],
  "number": 14290,
  "state": "closed",
  "title": "Resolve-DnsName prefers a failed IPv4 query to a successful IPv6 query",
  "updated_at": "2020-12-02T00:00:05Z"
}