{
  "_url": "https://github.com/PowerShell/PowerShell/issues/14429",
  "author": "SteveL-MSFT",
  "body": "## Summary of the new feature/enhancement\r\n\r\nWhen `Get-Error` was implemented, there was a deliberate decision to introduce a new `FormatAccent` color to help differentiate the metadata from the data visually.  We can use this same color to separate table headers and list metadata.  This PR implements this https://github.com/PowerShell/PowerShell/pull/14406\r\n\r\nExample:\r\n\r\n![image](https://user-images.githubusercontent.com/11859881/102249659-718dfc80-3eb7-11eb-972e-e12176c77db0.png)\r\n\r\n@powercode asked a good question whether we want separate user configurations for tables vs lists.  My preference is to keep it simple and just have one setting.\r\n\r\nAnother consideration is that if ANSI is available, the table header can be rendered with an underline instead of using up a row of dashes.\r\n\r\n",
  "closed_at": "2021-07-20T04:02:53Z",
  "comments": [
    {
      "author": "jhoneill",
      "author_association": "NONE",
      "body": "Using the accentColor for labels works as well or as badly as the choice of different accents - the change to a green font is fine, everything _flows_ , the change to background means that blue block for the table header makes it too separate. This is a lot less controversial than some of the others, if one dislikes it, change the accent colour, if one wants to go mad with it, change the accent colour :-)  \r\n \r\nUnderline for headers is worth considering (but green does it quite nicely. )   I'd also suggest looking at whether ----- should be as wide as the label, or run the full width of the column. Underline probably only goes as far as the text.. \r\n",
      "created_at": "2020-12-15T18:03:03Z",
      "updated_at": "2020-12-15T18:03:03Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "It would be preferable to be able to, but not impose.\r\n",
      "created_at": "2020-12-15T18:28:44Z",
      "updated_at": "2020-12-15T18:28:44Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "To be clear, don't focus on the blue background example, that was ONLY intended to show what a user can customize for themselves and would not be considered as a default option.  Users can decide they don't want color, but just want to have labels in italics or bold.",
      "created_at": "2020-12-15T19:19:59Z",
      "updated_at": "2020-12-15T19:20:28Z"
    },
    {
      "author": "jhoneill",
      "author_association": "NONE",
      "body": "> To be clear, don't focus on the blue background example, that was ONLY intended to show what a user can customize for themselves and would not be considered as a default option. Users can decide they don't want color, but just want to have labels in italics or bold.\r\n\r\nAnd I think that is the best thing about the proposal. We can see how it is changed in your video so it's reasonably clear that the white on blue was a user choice - and users can pick what works for them (even if others hate it). Personally I'd have bold labels and one colour.  Provided it redirects without escape codes of course :-) ",
      "created_at": "2020-12-15T23:18:57Z",
      "updated_at": "2020-12-15T23:18:57Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "Here's an example with emphasis on the data instead of the metadata:\r\n\r\n![image](https://user-images.githubusercontent.com/11859881/102284635-563be500-3ee9-11eb-831d-bd212a8ddbfd.png)\r\n\r\nAs for redirection, `$PSStyle.OutputRendering = 'host'` already covers that in that redirected output will always be plaintext with this set.  Note that default is `automatic` which mimics Linux behavior whereas `host` mimics macOS behavior.  I'm open to switching the two and make `host` default if that is what most folks prefer.",
      "created_at": "2020-12-15T23:23:33Z",
      "updated_at": "2020-12-15T23:23:33Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "> I'm open to switching the two and make `host` default if that is what most folks prefer.\r\n\r\nI think [my comment](https://github.com/PowerShell/PowerShell/issues/9270#issuecomment-745775526) is applicable here too.",
      "created_at": "2020-12-16T05:38:06Z",
      "updated_at": "2020-12-16T05:38:06Z"
    },
    {
      "author": "powercode",
      "author_association": "COLLABORATOR",
      "body": "@SteveL-MSFT My suggestion was to separate FormatAccent from FormatHeader.\r\nFormatAccent may be used to highlight things, which is not the same thing as separate headers from content.",
      "created_at": "2020-12-16T10:34:08Z",
      "updated_at": "2020-12-16T10:34:38Z"
    },
    {
      "author": "powercode",
      "author_association": "COLLABORATOR",
      "body": "There may be a better name than Header, but the main point was to not use `FormatAccent` since that should be used to draw attention to something in the text. This is not conceptually the same.",
      "created_at": "2020-12-18T07:36:28Z",
      "updated_at": "2020-12-18T07:36:28Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "@powercode I see.  `FormatAccent` currently is only used with `Get-Error` to provide visual distinction between property names and values, so using the same color for `Format-List` makes sense to me.  For tables, I'm ok with a separate member that can be customized, but perhaps have it the same color by default.  Since this is now under `$PSStyle.Formatting`, I think just calling it `TableHeader` would be concise and don't need the word `Format` in it at all.",
      "created_at": "2021-01-08T01:02:27Z",
      "updated_at": "2021-01-08T01:02:27Z"
    },
    {
      "author": "powercode",
      "author_association": "COLLABORATOR",
      "body": "When thinking about this, I think we should separate \"What color is used\" from \"What it logically is\".\r\n\r\nGet-Error should probably use the logical color as Format-List, but I don't think it should be `FormatAccent`, which I would use for accentuating text in a flow, like select-string or so.\r\n`ListHeader` would be more appropriate. They could default to the same color but should be different concepts.",
      "created_at": "2021-01-08T09:47:32Z",
      "updated_at": "2021-01-08T09:47:32Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "Revisiting this now that I have some time.  I like the separation of table and list colors.  However, we've already shipped FormatAccent and would be a breaking change to rename it now.  I think I'll just add a `TableHeader`.",
      "created_at": "2021-06-25T00:10:38Z",
      "updated_at": "2021-06-25T00:10:38Z"
    },
    {
      "author": "msftbot[bot]",
      "author_association": "NONE",
      "body": ":tada:This issue was addressed in #14406, which has now been successfully released as `v7.2.0-preview.8`.:tada:\n\nHandy links:\n* [Release Notes](https://github.com/PowerShell/PowerShell/releases/tag/v7.2.0-preview.8)\n",
      "created_at": "2021-07-22T21:41:55Z",
      "updated_at": "2021-07-22T21:41:55Z"
    },
    {
      "author": "ThomasNieto",
      "author_association": "CONTRIBUTOR",
      "body": "@SteveL-MSFT it wouldn't be an official breaking change since this feature has only shipped in preview correct? I just upgraded to preview 8 and didn't find `FormatAccent` for list headers to be user friendly and didn't make the connection until finding this issue.\r\n\r\nhttps://github.com/PowerShell/PowerShell/blob/master/docs/dev-process/breaking-change-contract.md\r\n> Note that these rules only apply to existing stable features that have shipped in a supported release. New features marked as “in preview” that are still under development may be modified from one preview release to the next. These are not considered breaking changes.",
      "created_at": "2021-07-27T03:39:06Z",
      "updated_at": "2021-07-27T03:41:37Z"
    }
  ],
  "created_at": "2020-12-15T17:26:32Z",
  "labels": [
    "Issue-Enhancement"
  ],
  "number": 14429,
  "state": "closed",
  "title": "Colorize table and list headers",
  "updated_at": "2021-07-27T03:41:37Z"
}