{
  "_url": "https://github.com/PowerShell/PowerShell/issues/14477",
  "author": "erenturkm",
  "body": "Hi,\r\n\r\nI was using powershell.exe for my current script  in task scheduler without problems. I installed Powershell 7.1 through Microsoft Store and when I look at add/remove files I see it as installed. When I changed the program/script to pwsh.exe I started getting file not found errors, reading issue #13302, I thought it was the path that was the problem. When I run where pwsh.exe I get 2 paths:\r\n```\r\n1) C:\\Program Files\\WindowsApps\\Microsoft.PowerShell_7.1.0.0_x64__8wekyb3d8bbwe\\pwsh.exe\r\n2) C:\\Users\\user1\\AppData\\Local\\Microsoft\\WindowsApps\\pwsh.exe\r\n```\r\nLooking at user1's Path, I see no 2, which provides why it runs interactively. Looking at system path, none are listed, which is why task scheduler fails. I am not clear on how to solve this. if I enter no 1 in system's path, whenever application is automatically upgraded, it will become invalid and script will fail. if I enter no 2, it depends on user1 being available which I think is the best approach. \r\n\r\nCould somebody propose the best action here?\r\n\r\n## Environment data\r\n\r\n<!-- provide the output of $PSVersionTable -->\r\nName                           Value\r\n----                           -----\r\nPSVersion                      7.1.0\r\nPSEdition                      Core\r\nGitCommitId                    7.1.0\r\nOS                             Microsoft Windows 10.0.18363\r\nPlatform                       Win32NT\r\n```none\r\n\r\n```\r\n",
  "closed_at": "2020-12-22T12:20:58Z",
  "comments": [
    {
      "author": "jborean93",
      "author_association": "COLLABORATOR",
      "body": "It seems like you have installed PowerShell through the Windows store and while the true executable is at `C:\\Program Files\\WindowsApps\\Microsoft.PowerShell_7.1.0.0_x64__8wekyb3d8bbwe\\pwsh.exe` there's a lot of stuff that goes on in the background here.\r\n\r\nThe folder `C:\\Program files\\WindowsApps` is a special folder that restricts the users that can open it up and enumerate the contents and execute things\r\n\r\n![image](https://user-images.githubusercontent.com/8462645/102823241-4b6fdb80-4426-11eb-8f50-ea4830235379.png)\r\n\r\nYou can see that Administrators can only list the contents and only a subset of others can read/execute. The `Users` groud does have this right but only when that particular condition is met. To deal with this, Windows creates an AppExecLink in `C:\\Users\\<username>\\AppData\\Local\\Microsoft\\WindowsApps` which points to the relevant executable in `C:\\Program Files\\Windows\\Apps\\<app id>`. Because the `WindowsApps` in your useer's appdata path is in the PATH for that user when they call `pwsh.exe` Windows will pick up that AppExecLink do some trickery with your logon token so the `WIN://SYSAPPID` condition can now be met and it's able to open `pwsh` in `C:\\Program Files`. This is a reason why Windows Store apps must be installed per user account as opening programs like this must be done through that AppExecLink which is stored in the user's profile.\r\n\r\nSo when running it as a scheduled task then it should be running as the account the Windows Store/appx pwsh was installed to. If you are wanting to run as SYSTEM you could potentially hard code the full path to `pwsh.exe` in `C:\\Program Files\\WIndowsApps` but that would mean you need to update your path everytime it is updated. You might even be able to install the appx in the context of the SYSTEM account using something like psexec but I honestly wouldn't be surprised if that doesn't work. You could also just install it like a normal msi and have it work like `powershell.exe`.",
      "created_at": "2020-12-21T21:36:10Z",
      "updated_at": "2020-12-21T21:36:10Z"
    },
    {
      "author": "doctordns",
      "author_association": "COLLABORATOR",
      "body": "Why not just use the Install-PowerShell script on GitHub and either install it with the MSI, or into the folder you want. That avoids all the store stuff.",
      "created_at": "2020-12-21T21:50:28Z",
      "updated_at": "2020-12-21T21:50:28Z"
    },
    {
      "author": "erenturkm",
      "author_association": "NONE",
      "body": "Basicly what you are saying, If you want to use PS 7.x from Microsoft store (that automatically upgrades itself) you can't use it from Task Scheduler. <sigh> back to chocolatey then.  ",
      "created_at": "2020-12-22T12:20:58Z",
      "updated_at": "2020-12-22T12:20:58Z"
    },
    {
      "author": "doctordns",
      "author_association": "COLLABORATOR",
      "body": "That is a remarkably silly conclusion in my view. \r\n\r\nI have Pwsh 7.1 installed on a bunch of domain servers and all can use it just fine even with task scheduler. Try using the **Install-PowerShell** script on GitHub. Get it at https://github.com/PowerShell/PowerShell/blob/master/tools/install-powershell.ps1. If you have to install it from the store, re-read the post avoce from @jborean93 which shows how you can resolve your issue.\r\n\r\nIMHO, the store is for consumer apps on Windows client devices. If you want to manage a domain and do grown up stuff, install PowerShell 7 from the real source. Chocolately is a non-supported repository. If support matters, use a more supported approach.\r\n\r\n<blockquote><img src=\"https://repository-images.githubusercontent.com/49609581/aad0ad80-cdec-11ea-8248-a37bc0571bfd\" width=\"48\" align=\"right\"><div><img src=\"https://github.githubassets.com/favicons/favicon.svg\" height=\"14\"> GitHub</div><div><strong><a href=\"https://github.com/PowerShell/PowerShell\">PowerShell/PowerShell</a></strong></div><div>PowerShell for every system! Contribute to PowerShell/PowerShell development by creating an account on GitHub.</div></blockquote>",
      "created_at": "2020-12-22T12:58:10Z",
      "updated_at": "2020-12-22T13:00:50Z"
    },
    {
      "author": "erenturkm",
      "author_association": "NONE",
      "body": "Thomas,\r\n\r\nI respect your opinion but marking sombody's opinion as silly, not grown up is not professional and should not be part of this forum, especially not knowing the specifics of their environment, and the problems they are trying to solve. Contribute only if it benefits this community.\r\n\r\nThe real problem here is how to keep Powershell updated which is a systems management problem not an installation problem. @jborean93's answer is elaborate but does not resolve this issue.  I am sure you know pretty well that if you are managing a domain you would never use the mentioned URL to update your 100's of servers/clients individually. Installing it from the Microsoft store for business or using a system management tool such as chocolatey are two different ways to solve this. Above answer is important as it highlights a pitfall for Office365 users who want to leverage Microsoft store app for their system management.\r\n\r\n\r\n",
      "created_at": "2020-12-22T18:59:32Z",
      "updated_at": "2020-12-22T18:59:32Z"
    }
  ],
  "created_at": "2020-12-21T17:07:59Z",
  "labels": [
    "Issue-Question",
    "Resolution-Answered"
  ],
  "number": 14477,
  "state": "closed",
  "title": "pwsh.exe executable does not work in Windows Task Scheduler",
  "updated_at": "2020-12-22T18:59:32Z"
}