{
  "_url": "https://github.com/PowerShell/PowerShell/issues/14531",
  "author": "codaamok",
  "body": "## Summary of the new feature/enhancement\r\n\r\n<!-- \r\nA clear and concise description of what the problem is that the new feature would solve.\r\nTry formulating it in user story style (if applicable):\r\n'As a user I want X so that Y.' with X being the being the action and Y being the value of the action.\r\n-->\r\n\r\nThis request is for a parameter which persists the original HTTP method used in `Invoke-RestMethod` and `Invoke-WebRequest` upon redirect. Currently, when the client receives a redirect from the web server, the HTTP client used by said cmdlets reissues the HTTP call but persistently uses HTTP GET, regardless what method was originally used.\r\n\r\nThis is typical to how browsers operate, and it's also how cURL operates out of the box, too. \r\n\r\nHere is an example:\r\n\r\n```powershell\r\nInvoke-RestMethod -Uri \"http://test.acook.io\" -Method POST\r\n```\r\nThe web server will redirect the request to `https://` and process `index.php` which just prints out `$_SERVER['REQUEST_METHOD']` ([link](https://www.php.net/manual/en/reserved.variables.server.php))\r\n\r\n## Proposed technical implementation details (optional)\r\n\r\n<!-- \r\nA clear and concise description of what you want to happen.\r\nConsider providing an example PowerShell experience with expected result.\r\n-->\r\n\r\nA parameter that instructions the cmdlets to persist the originally intended HTTP method through redirects would be useful in scenarios where the web server issues a 30x redirect of `http://` to `https://`.\r\n\r\n[cURL](https://curl.se/docs/manpage.html) offers this parameter idea, but for just POST methods, via `--post301`, `--post302` and `--post303`.\r\n\r\nIdeally, this request is to have a switch which persists all types of HTTP methods through redirects via said cmdlets.",
  "closed_at": null,
  "comments": [
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "@codaamok Thanks for raising the issue!\r\n\r\n> This is typical to how browsers operate, and it's also how cURL operates out of the box, too.\r\n\r\n1. If it is typical behavior why do we need new parameter? I'd expect you request to change the cmdlet behavior to make it standard.\r\n2. Could you please make more investigation? What do any standards say about this? What is behavior of others popular clients (curl, wget, IE, ...)? Please add links (to docs) if possible.",
      "created_at": "2021-01-07T13:37:28Z",
      "updated_at": "2021-01-07T13:37:28Z"
    },
    {
      "author": "codaamok",
      "author_association": "NONE",
      "body": "> 1. If it is typical behavior why do we need new parameter? I'd expect you request to change the cmdlet behavior to make it standard.\r\n\r\nIf you sent a POST request to a REST API, using PowerShell, and you forgot to explicitly define `https://` in the URL, would you like the HTTP method to remain as POST and not get converted to GET? The answer would likely be yes, and I think that's a valid use case. It's interesting to note that [cURL](https://curl.se/docs/manpage.html) offers this parameter idea, but for just POST methods, via --post301, --post302 and --post303.\r\n\r\nAs far as I'm aware this is a feature request but if I've done it wrong please tell me.\r\n\r\n> 2. Could you please make more investigation? What do any standards say about this? What is behavior of others popular clients (curl, wget, IE, ...)? Please add links (to docs) if possible.\r\n\r\nI believe [section 6.4](https://www.ietf.org/rfc/rfc7231.txt) will helps us here. This quote from a note at the start of that section is interesting:\r\n\r\n```\r\n      Note: In HTTP/1.0, the status codes 301 (Moved Permanently) and\r\n      302 (Found) were defined for the first type of redirect\r\n      ([RFC1945], Section 9.3).  Early user agents split on whether the\r\n      method applied to the redirect target would be the same as the\r\n      original request or would be rewritten as GET.  Although HTTP\r\n      originally defined the former semantics for 301 and 302 (to match\r\n      its original implementation at CERN), and defined 303 (See Other)\r\n      to match the latter semantics, prevailing practice gradually\r\n      converged on the latter semantics for 301 and 302 as well.  The\r\n      first revision of HTTP/1.1 added 307 (Temporary Redirect) to\r\n      indicate the former semantics without being impacted by divergent\r\n      practice.  Over 10 years later, most user agents still do method\r\n      rewriting for 301 and 302; therefore, this specification makes\r\n      that behavior conformant when the original request is POST.\r\n```",
      "created_at": "2021-01-09T17:00:35Z",
      "updated_at": "2021-01-09T17:00:35Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "@codaamok Thanks for great investigations! I think we can change the cmdlet to follow \"the latter semantics\". Later we could consider additional parameters based on feedback.\r\n\r\nIf you ready to pull PR I will help you and review.",
      "created_at": "2021-01-09T17:09:15Z",
      "updated_at": "2021-01-09T17:58:50Z"
    },
    {
      "author": "codaamok",
      "author_association": "NONE",
      "body": "The cmdlet is already following \"the latter semantics\" (rewrite as GET). This feature request is for a parameter which forces `Invoke-RestMethod` and `Invoke-WebRequest` to follow \"the former semantics\" (persist as original method).",
      "created_at": "2021-01-09T17:17:34Z",
      "updated_at": "2021-01-09T17:17:34Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "Ah, sorry, I thought we still follow old behavior. In the case we need more feedback. Do know important scenarios where the feature is critical? Specially Azure scenarios?\r\n\r\n  /cc @markekraus ",
      "created_at": "2021-01-09T17:58:36Z",
      "updated_at": "2021-01-09T17:58:36Z"
    },
    {
      "author": "codaamok",
      "author_association": "NONE",
      "body": "It's absolutely not critical, it's definitely a quality of life type thing. Most people would simply change the `-Uri` parameter to be `https://` and get on with their lives.\r\n\r\nHowever, where this feature request will be most helpful is for module authors. For example, for modules which are written for a web service's REST API. Perhaps a parameter for each function in said module allowed the user to specify a URL to their target host/service and they passed `example.com` to said parameter. By default, most HTTP agents will send out the request over tcp/80 and the majority of web servers today will respond with a redirect to `https://example.com`. As it stands today, if the function of the module was to HTTP POST, that would get rewritten as HTTP GET and potentially produce erroneous results.\r\n\r\nThis puts module authors in a bit of a dilemma of sorts. Questions like \"Do I try and look out for the redirect response and handle that within my code?\" or \"Should I force the parameter to only accept `https://`?\". Having this new parameter to persist the original HTTP method would simplify that common situation for modules which are essentially REST API wrappers.",
      "created_at": "2021-01-09T18:21:19Z",
      "updated_at": "2021-01-09T18:23:03Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "@codaamok Thanks! Now I see you want a flexibility if a server sends 301 or 302 (I am not sure about 303) wrong status instead of 307 one. I agree it could be useful and I agree to mentor implementation but we need more detail proposal (one parameter? some?) and more feedback.",
      "created_at": "2021-01-09T18:39:10Z",
      "updated_at": "2021-01-09T18:39:10Z"
    },
    {
      "author": "codaamok",
      "author_association": "NONE",
      "body": "It looks like same experience for 303; rewrites POST to GET. Otherwise, yes, exactly, 307 is arguably what REST API web servers should be using. \r\n\r\nAs a starting point, I think support for the new parameter(s) should focus on only 301, 302 and 303 status codes.\r\n\r\nFor my needs, just one switch parameter `-PersistHTTPMethod` for all three status codes would be fine. However I can imagine there may be others out there that might want more granularity e.g. same parameter name but accept a string array of four possible values: `301`, `302`, `303` and `All` - allowing the user to pass a combination of status codes. \r\n\r\nAn alternative might be three switch parameters `-PersistHTTPMethod301`, `-PersistHTTPMethod302` and `-PersistHTTPMethod303` however that would add noise to the parameter list for the cmdlets - it depends how \"offended\" the team is with that.",
      "created_at": "2021-01-09T19:03:24Z",
      "updated_at": "2021-01-09T19:03:24Z"
    },
    {
      "author": "codaamok",
      "author_association": "NONE",
      "body": "Thinking about it a little more, the parameter name would likely depend on whether support is possible for persisting any HTTP method, or just POST.",
      "created_at": "2021-01-09T19:08:15Z",
      "updated_at": "2021-01-09T19:08:15Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "We already have `Method` parameter so we have no need duplicate this in the new parameter.\r\n\r\nFor discussion:\r\n\r\n1. PersistHTTPMethod [301, 302, 303, All(default)]\r\n2. PersistHTTPMethodOnRedirection [301, 302, 303, All(default)]\r\n3. CERNRedirection [301, 302, 303, All(default)]\r\n4. OldRFCRedirection [301, 302, 303, All(default)]\r\n\r\nWe could replace \"Persist\" with \"Preserve\".",
      "created_at": "2021-01-10T05:56:53Z",
      "updated_at": "2021-01-10T05:56:53Z"
    }
  ],
  "created_at": "2021-01-02T21:56:18Z",
  "labels": [
    "Issue-Enhancement",
    "WG-Cmdlets-Utility"
  ],
  "number": 14531,
  "state": "open",
  "title": "Feature Request: create switch to persist HTTP method when following a redirect for Invoke-RestMethod or Invoke-WebRequest",
  "updated_at": "2021-01-10T05:56:53Z"
}