{
  "_url": "https://github.com/PowerShell/PowerShell/issues/14744",
  "author": "IkerGimenez",
  "body": "## Summary of the new feature/enhancement\r\n\r\nOne way I like to work with programming projects is to `subst` a virtual drive to the root of the workspace I'm using. It solves a lot of issues like having extremely long paths that build tools often can't process. `subst` isn't persistent though, so once you shutdown the computer it's lost. There's workarounds, like adding a script to the startup process that sets up the drives, but reducing the amount of work needed by just having it available when using `-Persist` with `New-PSDrive` would be very nice to have.\r\n\r\n## Proposed technical implementation details (optional)\r\n\r\n`New-PSDrive -Name \"X\" -PSProvider \"Filesystem\" -Root \"C:\\My\\Really\\Long\\And\\Inconveniently\\Nested\\Folder\\Path\" -Persist -Scope Global`\r\nAfter running the above, the path at root should be accessible as drive \"X:\\\"\r\n\r\nConsiderations:\r\n`-Name` argument will need sanitizing for valid drive names\r\n`-PSProvider` not sure if it would make sense for this to be available for arguments that aren't `\"Filesystem\"`\r\n",
  "closed_at": null,
  "comments": [
    {
      "author": "jborean93",
      "author_association": "COLLABORATOR",
      "body": "I believe this is not in place today because `subst` just creates the [DosDevice](https://docs.microsoft.com/en-us/windows-hardware/drivers/kernel/introduction-to-ms-dos-device-names) and because those devices are unique per session they are lost when you enter a new session. Mapped drives work in a similar fashion where they are just a `DosDevice` that maps the drive letter with the SMB provider but they also provide a functionality to persist across logon session through the `HKCU:\\Network` register key. This key is special because the Winlogon process knows to enumerate these values and create the `DosDevices` for that logons session. I'm not aware of `subst` offering that ability and anything that does just rely on autorun features like the `Run` key in the registry to run the `subst` command manually.\r\n\r\nPotentially it could add an entry into `HKLM:\\SYSTEM\\CurrentControlSet\\Control\\Session Manager\\DOS Devices` which should work across reboots but this has some limitations to be aware off\r\n\r\n* It affects all users on the system, unlike persisted mapped drives which are just for the current user (logon session)\r\n* You have to be an admin as the key is in `HKLM` not `HKCU`",
      "created_at": "2021-02-09T22:30:20Z",
      "updated_at": "2021-02-09T22:35:24Z"
    },
    {
      "author": "IkerGimenez",
      "author_association": "NONE",
      "body": "I see, I didn't realize it was tied to the OS like that. I can close this if you feel it's inappropriate for the PowerShell project.",
      "created_at": "2021-02-11T13:27:21Z",
      "updated_at": "2021-02-11T13:27:21Z"
    }
  ],
  "created_at": "2021-02-09T15:09:53Z",
  "number": 14744,
  "state": "open",
  "title": "Feature Request - Make New-PSDrive -Persist option available for local folders and drives",
  "updated_at": "2022-03-17T22:38:18Z"
}