{
  "_url": "https://github.com/PowerShell/PowerShell/issues/14866",
  "author": "LeeHolmes",
  "body": "When logged on to your machine using a Microsoft Account (something that Microsoft is pushing on very hard), WinRM generates an error when you try to use loopback remoting (i.e.: for experimentation): “Connecting to remote server localhost failed with the following error message : WinRM cannot process the request. The following error with errorcode 0x8009030e occurred while using Negotiate authentication: A specified logon session does not exist. It may already have been terminated.”\r\n\r\nYou can work around this by “-EnableNetworkAccess” (which you shouldn't have to do), or using a local account. This also happens with Windows PowerShell, but is for sure a regression from some point in the past.",
  "closed_at": "2021-03-04T01:16:49Z",
  "comments": [
    {
      "author": "jborean93",
      "author_association": "COLLABORATOR",
      "body": "Are you running as administrator beforehand? I know 2 or so years ago Microsoft stopped this from working with normal accounts due to a CVE that allows a limited access token to elevate to the admin token. I don’t fully agree with the CVE as UAC is not meant to be a security boundary but I doubt this will go back to the way it was before. More details are in https://devblogs.microsoft.com/powershell/windows-security-change-affecting-powershell/.\n\n<blockquote><img src=\"https://devblogs.microsoft.com/powershell/wp-content/uploads/sites/30/2018/09/Powershell_256.png\" width=\"48\" align=\"right\"><div><img src=\"https://devblogs.microsoft.com/powershell/wp-content/uploads/sites/30/2019/02/Powershell_2561.png\" height=\"14\"> PowerShell Team</div><div><strong><a href=\"https://devblogs.microsoft.com/powershell/windows-security-change-affecting-powershell/\">Windows Security change affecting PowerShell | PowerShell Team</a></strong></div><div>Windows Security change affecting PowerShell January 9, 2019 The recent (1/8/2019) Windows security patch CVE-2019-0543, has introduced a breaking change for a PowerShell remoting scenario. It is a narrowly scoped scenario that should have low impact for most users. The breaking change only affects local loopback remoting,</div></blockquote>",
      "created_at": "2021-02-20T21:07:26Z",
      "updated_at": "2021-02-20T21:07:28Z"
    },
    {
      "author": "LeeHolmes",
      "author_association": "CONTRIBUTOR",
      "body": "Yep - different error messages. This is a difference between Microsoft Accounts and local accounts.",
      "created_at": "2021-02-20T22:13:42Z",
      "updated_at": "2021-02-20T22:13:42Z"
    },
    {
      "author": "jborean93",
      "author_association": "COLLABORATOR",
      "body": "Ah my apologies, I wonder if it also affects a\r\nnon-loop back scenario, I.e from another windows host with the Microsoft account credentials. I know that NTLM has special behaviour when it comes to authenticating the implicit credentials over localhost so knowing whether it’s just the loop back scenario would help track that down.\r\n\r\nUltimately I don’t think the issue is with PowerShell itself as the logon process is all handled by the WinRM service and that’s where the error message is coming from. PowerShell could try and bypass it by automatically adding the `-EnableNetworkAccess` in this situation.",
      "created_at": "2021-02-21T01:20:53Z",
      "updated_at": "2021-02-21T01:20:53Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "The authentication and logon is handled by WinRM and not directly by PowerShell.  This would have to be taken up by the owners of WinRM.",
      "created_at": "2021-03-04T01:16:49Z",
      "updated_at": "2021-03-04T01:16:49Z"
    }
  ],
  "created_at": "2021-02-20T19:40:38Z",
  "number": 14866,
  "state": "closed",
  "title": "Localhost Remoting doesn't work if you use Microsoft Accounts",
  "updated_at": "2021-03-04T01:16:57Z"
}