{
  "_url": "https://github.com/PowerShell/PowerShell/issues/14886",
  "author": "Bamajon1974",
  "body": "PowerShell v7 installs right-click context menu entries to launch a PowerShell window when right clicking a directory, directory background, or drive. The entries are installed in HKCU\\Directory\\shell, HKCU\\Directory\\Background\\Shell and HKCU\\Drive. These entries work fine....meaning that when selecting Open PowerShell 7 window upon right-clicking a directory, directory background or drive, a PowerShell window opens up to the desired directory. \r\n\r\nHowever, PowerShell also installs right click context menu entries for Libraries that do not work. PowerShell entries are not installed at HKCU\\Library\\Background\\Shell, but, when right clicking the main library icon in File Explorer Navigation Pane, or the background of the main library virtual folder, a PowerShell context menu entry appears. When PowerShell is launched from the entry in a library, nothing happens. Note that, the PowerShell right-click entries for individual libraries, such as documents or pictures, have no PowerShell entries unless added to HKCR\\Library\\Background\\shell\r\n\r\nSo, I would like to either:  modify the context menu commands for PowerShell to open in libraries (which I don't think is possible for virtual folders) or exclude libraries, but not regular folders, from the registry entries. \r\n\r\nHow do I do this? \r\n\r\n<img width=\"768\" alt=\"lib1\" src=\"https://user-images.githubusercontent.com/48393602/108790734-70c6b600-754b-11eb-8cff-957779198407.png\">\r\n\r\n<img width=\"640\" alt=\"lib2\" src=\"https://user-images.githubusercontent.com/48393602/108791396-f7c85e00-754c-11eb-988c-215583c0f975.png\">\r\n\r\n",
  "closed_at": null,
  "comments": [
    {
      "author": "Bamajon1974",
      "author_association": "NONE",
      "body": "After looking into the issue further....the default PowerShell and Command Prompt context menu entries included in Win10 also do not open in libraries. See attached pic for the error message when launching PowerShell from right-click menu in libraries. Would this question be better directed to Microsoft? \r\n\r\n<img width=\"1130\" alt=\"error\" src=\"https://user-images.githubusercontent.com/48393602/109313308-0e550a80-7816-11eb-8828-23c8d21d6c6c.png\">\r\n",
      "created_at": "2021-02-26T14:36:19Z",
      "updated_at": "2021-02-26T14:36:19Z"
    }
  ],
  "created_at": "2021-02-23T01:31:43Z",
  "labels": [
    "Issue-Bug",
    "Area-Maintainers-Build"
  ],
  "number": 14886,
  "state": "open",
  "title": "PowerShell v7 right-click context menu entries don't work on libraries",
  "updated_at": "2021-03-02T22:48:59Z"
}