{
  "_url": "https://github.com/PowerShell/PowerShell/issues/1497",
  "author": "andschwa",
  "body": "Only pull requests, merges to master, and branches starting with the prefix \"test\" will trigger Travis CI builds.\n\n/cc @vors @lzybkr @lilyfang @JamesWTruher \n\nI would still like to explore speeding up the build by:\n- tagging many more tests as slow\n- running OS X builds only for merges to master\n\nAs it is, our builds take about 18 minutes on Linux, and 22 on OS X. The majority of the time is spent waiting for the queue to free up, and once building, spent running Pester tests.\n",
  "closed_at": "2016-07-25T07:24:52Z",
  "comments": [
    {
      "author": "andschwa",
      "author_association": "MEMBER",
      "body": "Per my [comment here](https://github.com/PowerShell/PowerShell/pull/1478#issuecomment-234806888), I do not believe that it is reasonably possible to setup \"early pass\" of PRs that only affect docs; there far too many edge cases and bugs around the one variable that would give us the information we would need to do this. Additionally, I would also be afraid of the master branch failing, then docs being merged, which causes the master branch to pass, and then not knowing the branch failed until later. This does not seem worth the trouble.\n",
      "created_at": "2016-07-24T22:38:09Z",
      "updated_at": "2016-07-24T22:38:09Z"
    },
    {
      "author": "andschwa",
      "author_association": "MEMBER",
      "body": "There does not appear to be enough flexibility (and predictability) around the `matrix.include` option of Travis, leaving OS X testing to be an all or nothing.\n\nWe could skip OS X for pull requests by exiting the build early, but that would give a false sense of success, and would still tie up a build runner for a few minutes (for it to boot, restore cache, clone repo). I'm not all for this option.\n",
      "created_at": "2016-07-24T22:58:52Z",
      "updated_at": "2016-07-24T22:58:52Z"
    },
    {
      "author": "vors",
      "author_association": "COLLABORATOR",
      "body": "I'm fine with the current PR proposition.\n",
      "created_at": "2016-07-25T05:09:23Z",
      "updated_at": "2016-07-25T05:09:23Z"
    },
    {
      "author": "andschwa",
      "author_association": "MEMBER",
      "body": "The let's get it in before we get clogged again.\n",
      "created_at": "2016-07-25T07:24:50Z",
      "updated_at": "2016-07-25T07:24:50Z"
    }
  ],
  "created_at": "2016-07-24T22:35:47Z",
  "number": 1497,
  "state": "closed",
  "title": "Whitelist master and test branches for Travis CI",
  "updated_at": "2016-07-25T07:24:57Z"
}