{
  "_url": "https://github.com/PowerShell/PowerShell/issues/15006",
  "author": "MHHenriksen",
  "body": "## Summary of the new feature/enhancement\r\n\r\nAs a user, I want to understand the consequences of enabling remoting when installing PowerShell, so that I know that I am not exposing any potential security holes or attack vectors.\r\n\r\n### Context\r\nI just updated to 7.1.3, and had to pause on the page with optional features. The \"Enable PowerShell remoting\" option stuck out to me, wedged in the middle of all the others almost as an afterthought, and while it sounds like an attractive feature I don't know exactly what it does or changes with my system, and I did not have time to look more into it. \r\n\r\nHere's all the thoughts that ran through my head and ultimately made me decide to not enable it and also not plan to follow it up since it seems like it would consume too much time.\r\n\r\nThe term \"remoting\" is a bit overloaded and therefore ambiguous to me. I work with containers and it sounds like remoting could involve ssh and remote shells, which I tried and failed to use from Windows to Linux once long ago in one of the first previews of PS Core. But I also know it could be related to things like DSC and WinRM, or even new stuff I haven't heard about yet.\r\n\r\nI also worried if this would set up a listening port to remote into this machine, which I would need to think through if is acceptable on my work laptop and maybe involve my IT department.\r\n\r\nAnd I was skeptical if this could interfere with other \"stuff\" I already use for remoting.\r\n\r\n## Proposed technical implementation details\r\n\r\nTogether with the checkbox to enable this feature, provide a summary of the concrete consequences of enabling it. There's more than one way this could be done:\r\n\r\nMost straightforward: Just add text slightly indented and styled below the option.\r\n\r\nI expect there could be quite a bit to cover, and that all that text wouldn't fit directly on the page it currently lives in, even as just concise keywords. Maybe an (i) icon with a tooltip would work. And a link to the doc page for the feature would also be useful, to remove the friction of having to search for it. Not in the tooltip though, that would be tricky to click ;)\r\n\r\nI want to ask you to consider going one step further though, and move this particular option to its own page, so that there's room to write and explain without having to sidestep into a browser. This should be weighed by someone with more knowledge of the actual feature, because it definitely depends on how impactful enabling remoting actually is, especially about security vulnerabilities. If it's totally safe, a separate page might give the wrong impression and also possibly promote it more than it should be. But if there are indeed such implications or other important considerations, this would be a great way to highlight and warn about it.",
  "closed_at": null,
  "comments": [
    {
      "author": "joeyaiello",
      "author_association": "CONTRIBUTOR",
      "body": "I think it would be reasonable for us to add a hyperlink there to our [remoting docs](https://docs.microsoft.com/en-us/powershell/scripting/learn/remoting/running-remote-commands?view=powershell-7.1). Would that be helpful to you? ",
      "created_at": "2021-03-17T00:40:58Z",
      "updated_at": "2021-03-17T00:40:58Z"
    },
    {
      "author": "MHHenriksen",
      "author_association": "NONE",
      "body": "Yep! That will do.",
      "created_at": "2021-03-18T11:45:03Z",
      "updated_at": "2021-03-18T11:45:03Z"
    }
  ],
  "created_at": "2021-03-12T09:51:14Z",
  "number": 15006,
  "state": "open",
  "title": "MSI installer \"Enable PowerShell remoting\" could use some hints",
  "updated_at": "2021-03-18T11:45:03Z"
}