{
  "_url": "https://github.com/PowerShell/PowerShell/issues/15045",
  "author": "p0W3RH311",
  "body": "hi Guys !!\r\n\r\nyes its crazy but the idea is like a framework its use _Dynamic AST keyword_ , string manipulation and the _event-typing_:\r\n```\r\n\r\nPS C:\\> $ExecutionContext.SessionState.InvokeCommand.CommandNotFoundAction\r\nPS C:\\> $ExecutionContext.SessionState.InvokeCommand.PreCommandLookupAction\r\nPS C:\\> $ExecutionContext.SessionState.InvokeCommand.PostCommandLookupAction\r\nPS C:\\> $ExecutionContext.SessionState.InvokeCommand.LocationChangedAction\r\n\r\n```\r\ncreate a json file with predefined keyword (json schema maybe ?) keyword like: MetaKeyword (the name of the new keyword) , MetaArguments (the arguments of MetaKeyword with type if necessarly), String (the string expanded by the macro MetaKeyword), Code ( in json key: the code typed by the user and in there value: the code transformation) \r\nfor example with simple example  `'unless ($condition) { $body }': 'if (!($condition)) { $body }'` in this example i use $condition and $body its a special variable to determine an unspecified code.\r\n\r\nthen we use the new pre-processor Cmdlet `Expand-PSLanguage -JsonFile $json` \r\n\r\nthis feature will add more meta programming within PS",
  "closed_at": "2022-05-18T00:01:07Z",
  "comments": [
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "While the implementation differs in your suggestions, dynamic language keywords are already something that is built into the engine.\r\n\r\nI can't say I'd really recommend using them, though. Neither the current dynamic keyword implementation nor your suggestion really seems to differ much from simply creating a function to do that directly:\r\n\r\n```ps\r\nfunction unless {\r\n    [CmdletBinding()]\r\n    param(\r\n        [Parameter(Mandatory, Position = 0)]\r\n        [bool]\r\n        $Condition,\r\n\r\n        [Parameter(Mandatory, Position = 1)]\r\n        [scriptblock]\r\n        $Body\r\n    )\r\n    if (-not $condition) {\r\n        & $Body\r\n    }\r\n}\r\n```\r\n\r\nThere would be scoping differences, but those are not entirely insurmountable, and you still have more flexibility in terms of how you choose to implement any aspect of it. ",
      "created_at": "2021-03-16T21:09:31Z",
      "updated_at": "2021-03-16T21:09:31Z"
    },
    {
      "author": "p0W3RH311",
      "author_association": "NONE",
      "body": "@vexx32 \r\n\r\nthanks, but this pre-processor technic are expanded before the execution of the code (like in c with `string ` json key), function can't because it gets called at runtime\r\n\r\n```\r\nsome code\r\nmy_new_metakeyword_contains_text # change in a text\r\nsome code\r\n```\r\n\r\nThe downside to implementing this pre-processor engine instead of a function is that pre-processor definitions are more complex than function definitions because you’re writing powershell code that writes powershell code...but in final it offers new capabilities",
      "created_at": "2021-03-17T03:15:21Z",
      "updated_at": "2021-03-17T03:15:21Z"
    },
    {
      "author": "SeeminglyScience",
      "author_association": "COLLABORATOR",
      "body": "`DynamicKeyword` was an interesting experiment.  Really cool idea, but it highlights how nearly insurmountable of a challenge it is to get the UX right for \"parser extensions\" in PowerShell.  Your extension would need to be registered *before any script utilizing it is parsed for the first time*. Dynamic loading is also probably out since it would require implicit code invocation at parse time which is sort of a nightmare to secure.\r\n\r\nAs much as I would absolutely *love* for there to be a way to extend the parser, it's such a huge challenge for such a small audience that I don't see it happening.\r\n\r\n---\r\n\r\nThe closest we're going to get is if someone writes a transpiler with add-on support. A build step eliminates all of those problems.\r\n\r\nThere are a lot of potential use cases for a transpiler, but that work would likely need to be a separate project.  Similar to typescript > javascript.",
      "created_at": "2021-03-17T13:57:43Z",
      "updated_at": "2021-03-17T13:57:43Z"
    },
    {
      "author": "msftbot[bot]",
      "author_association": "NONE",
      "body": "This issue has been marked as answered and has not had any activity for **1 day**. It has been closed for housekeeping purposes.",
      "created_at": "2022-05-18T00:01:06Z",
      "updated_at": "2022-05-18T00:01:06Z"
    }
  ],
  "created_at": "2021-03-16T19:55:50Z",
  "labels": [
    "Issue-Enhancement",
    "Resolution-Answered"
  ],
  "number": 15045,
  "state": "closed",
  "title": "Expand-PSLanguage cmdlet  to expand the PS language with PS",
  "updated_at": "2022-05-18T00:01:07Z"
}