{
  "_url": "https://github.com/PowerShell/PowerShell/issues/1507",
  "author": "PaulHigin",
  "body": "These changes add support for PowerShell remoting over SSH.  This includes creating new transport objects to use SSH as the PSRP remoting transport along with a new parameter set for the New-PSSession, Invoke-Command, and Enter-PSSession cmdlets.  The parameters are HostName, UserName, and KeyPath to allow both SSH password prompt (for interactive sessions) and key based user authentication.\n\nThis check in is to support PowerShell SSH remoting demos and the final parameter sets will likely change in the future.  I also have a list of known issues that will be added to this GitHub repo.\n\nThe changes affect Win32 full, core, and Linux versions.  For Linux some types such as WindowsIdentity information were left null.  Also the crypto helper that is based on Win32 native APIs is abandoned for Linux since SSH provides the encrypt/decrypt.\n\nPowerShell SSH remoting requires SSH to be installed on both client (ssh.exe) and server (sshd.exe) along with a PowerShell build including these changes.  In addition the server (sshd.exe) configuration must include the ability to launch a PowerShell subsystem in server mode, and I'll add a new document to describe how to do this.\n",
  "closed_at": "2016-08-12T22:58:18Z",
  "comments": [
    {
      "author": "PaulHigin",
      "author_association": "COLLABORATOR",
      "body": "Thanks everyone for your comments.  I believe I have addressed them all.  I talked with Jason and he feels these code review changes should be squashed before accepting the RP, to keep the history clean.  So I will do that next.\n",
      "created_at": "2016-07-28T23:11:37Z",
      "updated_at": "2016-07-28T23:11:37Z"
    },
    {
      "author": "TravisEz13",
      "author_association": "MEMBER",
      "body": "Please make sure that you add a meaningful title per the [contribution guide](https://github.com/PowerShell/PowerShell/blob/master/.github/CONTRIBUTING.md#pull-request-submission).\n",
      "created_at": "2016-08-09T19:50:16Z",
      "updated_at": "2016-08-09T19:50:16Z"
    },
    {
      "author": "rkeithhill",
      "author_association": "COLLABORATOR",
      "body": "Effing awesome!\n",
      "created_at": "2016-08-12T18:39:20Z",
      "updated_at": "2016-08-12T18:39:20Z"
    },
    {
      "author": "lzybkr",
      "author_association": "MEMBER",
      "body": "Uh, 250+ commits - somethings not right here.\n",
      "created_at": "2016-08-12T19:14:48Z",
      "updated_at": "2016-08-12T19:14:48Z"
    },
    {
      "author": "TravisEz13",
      "author_association": "MEMBER",
      "body": "I resubmitted this with what I _think_ @PaulHigin  intended in #1786 \n",
      "created_at": "2016-08-12T22:54:15Z",
      "updated_at": "2016-08-12T22:54:15Z"
    },
    {
      "author": "PaulHigin",
      "author_association": "COLLABORATOR",
      "body": "I have added the changes to a new fork/branch (PaulHigin/PowerShell/WorkingA) and will close this branch.  I am also closing this pull request because I will submit a new one from the new fork/branch.\n",
      "created_at": "2016-08-12T22:58:11Z",
      "updated_at": "2016-08-12T22:58:11Z"
    },
    {
      "author": "PaulHigin",
      "author_association": "COLLABORATOR",
      "body": "Closing this pull request because I have moved the changes to a new fork/branch and will submit pull request from there.  The changes include all code review comments from here.\n",
      "created_at": "2016-08-12T22:59:00Z",
      "updated_at": "2016-08-12T22:59:00Z"
    }
  ],
  "created_at": "2016-07-25T22:10:56Z",
  "number": 1507,
  "state": "closed",
  "title": "Add PowerShell remoting over SSH feature",
  "updated_at": "2016-08-12T22:59:00Z"
}