{
  "_url": "https://github.com/PowerShell/PowerShell/issues/15089",
  "author": "yevgeni-zolotko",
  "body": "Hi,\r\n\r\nI need to display additional \"external variables\" in the code completion provided by PSES. An example of such variables are custom session state variables provided by a runtime environment from the outside via RunSpace.SessionStateProxy.SetVariable.\r\nWhat I tried so far is to pass a specially crafted PS module to -AdditionalModules parameter with the following declarations. The module contains the following:\r\n\r\n```powershell\r\nNew-Variable -Name MyVar1\r\nNew-Variable -Name MyVar2\r\n```\r\nThese variables then are displayed in the code completion list. This is all good, but I also need these variables to be typed, so that a proper code completion is shown when I type \"$MyVar1.\" This could be achieved by initialized the variables above to some particular values. But the problem is I cannot provide values for them in my module, since the values are provided externally at runtime and not at design time. Only the types of the variables are known. What I ultimately would like to do is:\r\n\r\n```powershell\r\nNew-Variable -Name Var1 -Type [ClassLibrary1.Class1] # ClassLibrary1 assembly was imported before\r\nNew-Variable -Name Var2 -Type [System.Int32]\r\n```\r\nbut \"-Type\" parameter is not supported. Also I tried several other approaches\r\n\r\n```powershell\r\n[ClassLibrary1.Class1] $MyVar34\r\n$MyVar34 = [ClassLibrary1.Class1]$null\r\nNew-Variable -Name MyVar1 -Value ($null -as [ClassLibrary1.Class1])\r\n```\r\n\r\n-- but they dont work. The only thing that worked is assigning actual values to the variables, but, the only information I have for each variable is name and type.\r\n\r\nCould you please point me in the right direction?",
  "closed_at": null,
  "comments": [],
  "created_at": "2020-12-16T16:26:17Z",
  "labels": [],
  "number": 15089,
  "state": "open",
  "title": "Introduce custom typed variables to code completion",
  "updated_at": "2021-03-23T23:04:45Z"
}