{
  "_url": "https://github.com/PowerShell/PowerShell/issues/15334",
  "author": "MattPennerVVUSD",
  "body": "**Issue:**\r\nOn an Azure AD joined device, when running commands such as get-ADUser or get-ADGroup the initial query is very fast.  However, when storing the results in a variable and attempting to view them the domain controller is contacted for each and every single result, causing massive delays for processing records.\r\n\r\nThis does not occur on a standard domain joined device.  Both devices are on the same physical wired network within the organization.\r\n\r\nWith the initial query ran and results cached, if the network adapter is disabled traversing the results happens instantly as would be expected.  When viewing the difference between those records returned with a live network and those without the results returned with a live network have five additional blank attributes:\r\n\r\n- WriteDebugStream\r\n- WriteErrorStream\r\n- WriteInformationStream\r\n- WriteVerboseStream\r\n- WriteWarningStream\r\n\r\nNot sure why traversing the records would cause additional network activity and what these fields are to represent.\r\n\r\n**Expected Behavior:**\r\nThe code should operate the same whether using a domain joined device or an Azure AD joined device.\r\n\r\n**How to Replicate:**\r\nRunning the following code on a domain joined PC works fine.  Running the same code on an Azure AD joined PC has the issue.\r\n```\r\n$var = get-ADUser -filter * -Server SomeDCServerName\r\n$var | Select -First 10\r\n\r\n```\r\n\r\n**PowerShell Version:**\r\nTested on 5.1.19041.610 and 2021.2.2\r\n\r\n**Resources:**\r\nPlease check out the following [StackOverflow issue ](https://stackoverflow.com/questions/60418494/slow-get-aduser-query#)and [Reddit thread ](https://www.reddit.com/r/PowerShell/comments/mc6gng/ad_powershell_question_writestream_properites)for additional info on users experiencing this.",
  "closed_at": null,
  "comments": [
    {
      "author": "daxian-dbw",
      "author_association": "MEMBER",
      "body": "@MattPennerVVUSD Can you try if running `$result = $var | Select -First 10` is fast on an Azure AD joined PC?\r\nI suspect it's because `$var | Select -First 10` will send the results through formatting system, which will try retrieving the values for the properties to be displayed. For some properties, the attempt to retrieve value somehow results in a network IO for the Azure AD joined machine.\r\n\r\n@joeyaiello @theJasonHelmick This is an issue with the `ActiveDirectory` module. Where shall we transfer this to?",
      "created_at": "2021-05-02T05:44:13Z",
      "updated_at": "2021-05-02T05:44:13Z"
    },
    {
      "author": "MattPennerVVUSD",
      "author_association": "NONE",
      "body": "Hi @daxian-dbw, I finally had a chance to test out your suggestion.  Running `$result = $var | Select -First 10` immediately returned, however, when I did a simple select on `$result` I received the same experience.  Running the query and storing that in `$result` is quick, but attempting to iterate over the results causes the formatting to kick in.",
      "created_at": "2021-05-11T18:20:57Z",
      "updated_at": "2021-05-11T18:20:57Z"
    },
    {
      "author": "MattPennerVVUSD",
      "author_association": "NONE",
      "body": "Is it possible to disable the formatting system as a workaround in the mean time?",
      "created_at": "2021-05-11T18:22:35Z",
      "updated_at": "2021-05-11T18:22:35Z"
    },
    {
      "author": "daxian-dbw",
      "author_association": "MEMBER",
      "body": "Thanks for confirming the behavior -- it's indeed as what I suspected.\r\nYou cannot disable the formatting system, also when you attempt to access any of those problematic properties of the returned AD object, you will experience the same problem.\r\n@SteveL-MSFT This is an issue with the `ActiveDirectory` module. do you know where we should transfer this issue to?",
      "created_at": "2021-05-13T04:52:37Z",
      "updated_at": "2021-05-13T04:52:37Z"
    }
  ],
  "created_at": "2021-04-30T23:22:11Z",
  "number": 15334,
  "state": "open",
  "title": "Get-AD* is severely slow on Azure AD joined devices when filling ",
  "updated_at": "2021-05-13T04:52:37Z"
}