{
  "_url": "https://github.com/PowerShell/PowerShell/issues/15370",
  "author": "NotNotWrongUsually",
  "body": "If an array of `PSCustomObject` contains specific property names Powershell gets confused. \"Clone\", as in the example below is one, but I'm going to take a guess that this goes for all method names on System.Object (only tested with \"Equals\", personally, but that displays similar behaviour).\r\n\r\nExample of actual problem caused by this: when using Invoke-RestMethod with Bitbucket's API, a field named \"clone\" in the JSON is used to indicate the url needed for cloning a specific repo. Trying to fetch all the clone-links from the object returned by Invoke-RestMethod fails (can be worked around by creative usage of `Select-Object`)\r\n\r\n## Steps to reproduce\r\n\r\n```powershell\r\n# If only one object, things are fine:\r\nPS > $object = [PSCustomObject]@{Clone = \"1\"}\r\nPS > $object.Clone\r\n1\r\n\r\n# Multiple objects cause strange behaviour\r\nPS > $objects = [PSCustomObject]@{Clone = \"1\"}, [PSCustomObject]@{Clone = \"2\"}\r\nPS > $objects.Clone\r\n\r\nOverloadDefinitions\r\n-------------------\r\nSystem.Object Clone()\r\nSystem.Object ICloneable.Clone()\r\n```\r\n\r\n## Expected behavior\r\nWould have expected the output of $objects.Clone to be\r\n```none\r\n1\r\n2\r\n```\r\n\r\n## Actual behavior\r\nOutput is\r\n```none\r\nOverloadDefinitions\r\n-------------------\r\nSystem.Object Clone()\r\nSystem.Object ICloneable.Clone()\r\n```\r\n\r\n## Environment data\r\n\r\n<!-- provide the output of $PSVersionTable -->\r\n\r\n```none\r\nName                           Value\r\n----                           -----\r\nPSVersion                      7.1.3\r\nPSEdition                      Core\r\nGitCommitId                    7.1.3\r\nOS                             Microsoft Windows 10.0.19042\r\nPlatform                       Win32NT\r\nPSCompatibleVersions           {1.0, 2.0, 3.0, 4.0…}\r\nPSRemotingProtocolVersion      2.3\r\nSerializationVersion           1.1.0.1\r\nWSManStackVersion              3.0\r\n```\r\n",
  "closed_at": "2021-05-11T14:51:59Z",
  "comments": [
    {
      "author": "SeeminglyScience",
      "author_association": "COLLABORATOR",
      "body": "`Clone` is a method on `object[]` itself which will take priority over members of items contained within it. You'd need to manually enumerate with the pipeline, `foreach` or `$objects.ForEach('Clone')`.",
      "created_at": "2021-05-10T17:49:00Z",
      "updated_at": "2021-05-10T17:49:00Z"
    },
    {
      "author": "237dmitry",
      "author_association": "NONE",
      "body": "Or:\r\n```\r\n$objects | Select -expand Clone\r\n```",
      "created_at": "2021-05-10T19:16:14Z",
      "updated_at": "2021-05-10T19:16:14Z"
    },
    {
      "author": "NotNotWrongUsually",
      "author_association": "NONE",
      "body": "@SeeminglyScience - I understand _why_ this is happening and how to work around it. But isn't it still a bug from a usage perspective, though?\r\n\r\nIt seems inconsistent that `$myArray.Property1` and `$myArray.Property2` are not necessarily unrolled the same way. Unrolling like this also makes it a potentially breaking change when .NET adds members to the Array class (e.g. if I addressed some data from an API like `$data.values.findfirst` and the FindFirst method is later added into .NET, my code will stop working).\r\n\r\nAdding to the confusion, the default behaviour on a single object would be to hide the original member and expose the one I overwrote it with. Unrolling a collection of those objects then decides that the property from the Array class is more important.\r\n\r\nI think this is unexpected behaviour from the perspective of most users.",
      "created_at": "2021-05-11T09:19:01Z",
      "updated_at": "2021-05-11T09:19:01Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "PowerShell can't automatically unroll a property name if a matching method or property name exists on the collection. That's sort of by design, I guess.\r\n\r\nIt can't know ahead of time what you want. If you had a property called `Length` or `Count` on your individual objects, how would it know whether you'd want to look for the property on the collection (to find how many elements are in said collection) or the individual properties on the objects?\r\n\r\nThe situation is ambiguous, and there's not a way to resolve that. PowerShell opts to prioritise the parent object here, and I don't think it's the wrong behaviour. If it didn't, there would be absolutely no way to really find the data on the parent object. As it is, it's sometimes a little confusing (so perhaps there is room for improvement in telling the user how to find the information they _might_ be looking for in some fashion, not sure how that would work) but in the end you can still access both the parent collection's properties/methods as well as the child objects' properties/methods.\r\n\r\nSure, you have to iterate the collection in a case where maybe you weren't expecting to need to, but it doesn't actively prevent you from accessing either. \"Fixing\" this would mean effectively that child objects' properties could actively prevent you from using properties on the parent collection.",
      "created_at": "2021-05-11T11:51:01Z",
      "updated_at": "2021-05-11T11:51:01Z"
    },
    {
      "author": "NotNotWrongUsually",
      "author_association": "NONE",
      "body": "Good points.\r\n\r\nFor what it is worth, what seems intuitive to me in the context of unrolling would be:\r\n`$myCollection.Count` => give me the Count property from individual members of the collection _if such a property exists_, otherwise the Count of the parent object.\r\n`,$myCollection.Count` => Always gives the Count from the parent object.\r\n\r\nI can see how this could lead to some other confusing scenarios though (and intuitive to me might very well be illogical to someone else).\r\n\r\nWith that, I am closing the task. Maybe someone will come up with a brilliant idea for how to go about this and suggest an enhancement at some point. A bug it isn't.\r\n",
      "created_at": "2021-05-11T14:51:59Z",
      "updated_at": "2021-05-11T14:51:59Z"
    }
  ],
  "created_at": "2021-05-10T12:39:29Z",
  "number": 15370,
  "state": "closed",
  "title": "PSCustomObject properties with specific names fail",
  "updated_at": "2021-05-11T14:52:00Z"
}