{
  "_url": "https://github.com/PowerShell/PowerShell/issues/15396",
  "author": "potatoqualitee",
  "body": "## Summary of the new feature/enhancement\r\n\r\nAs a trusted community module maintainer, I would like a wealth of information shouted from the rooftops about how to prevent PowerShell scripts from being reported as a trojan by Windows Defender. Recently, a file that has not changed in 2 years was reported as a Trojan to two of our users.\r\n\r\n![image](https://user-images.githubusercontent.com/8278033/118113836-14a35d80-b3e7-11eb-85ff-5cfecc670245.png)\r\n\r\nWhile our file is not a trojan, false positives from Windows Defender impact the trustworthiness of our module. We've worked hard over the years to engender trust in both dbatools and PowerShell. Currently, I hold up our CI/CD process to review each commit to ensure it is not malicious before I publish it to the PowerShell Gallery.\r\n\r\nIs there a solution for whitelisting trusted community modules and adding a feature to PSScriptAnalyzer that highlights problematic techniques?\r\n\r\nSo far, one user has confirmed that the signed version from the PowerShell Gallery is not triggering AV. The problem with this is that:\r\n\r\n1. Not all PowerShell Developers can afford Code Signing Certificates\r\n2. Not everyone uses the PowerShell Gallery and we'd like to continue offering installs via GitHub. Our code cannot be signed and saved to the repository.\r\n\r\nIt seems that this may be a result of some enhancements to [AMSI and machine learning](https://www.microsoft.com/security/blog/2020/08/27/stopping-active-directory-attacks-and-other-post-exploitation-behavior-with-amsi-and-machine-learning/)\r\n\r\n> Antimalware Scan Interface (AMSI) helps security software to detect such malicious scripts by exposing script content and behavior. AMSI integrates with scripting engines on Windows 10 as well as Office 365 VBA to provide insights into the execution of PowerShell, WMI, VBScript, JavaScript, and Office VBA macros. \r\n\r\n(I hope IronPython is impacted as well 😅)\r\n\r\nHere's information about the Defender definition that alerted the user\r\n\r\n![image](https://user-images.githubusercontent.com/8278033/118118685-8bdbf000-b3ed-11eb-94f2-d73681a7f79d.png)\r\n\r\nI assume that `[Reflection.Assembly]::LoadFrom($assemblyPath)`, which we use to make imports as fast as possible, is the problematic technique, but I can't find any confirmation. Other blogs talk about using that for loading from memory but we are loading from disk. Once we get this issue solved, however, I'd like to know what to modify in other files. Perhaps the Gallery can detect these techniques and email module owners.\r\n\r\nOther PowerShell users are experiencing this a well as noted in the following links:\r\n\r\nhttps://twitter.com/JustinWGrote/status/1392518022900850688\r\nhttps://twitter.com/psCookieMonster/status/1392796401545981953\r\nhttps://twitter.com/DrAzureAD/status/1361298815815417856\r\nhttps://twitter.com/PrzemyslawKlys/status/1392933835978027019\r\nhttps://github.com/PowerShell/vscode-powershell/issues/3017\r\nhttps://www.reddit.com/r/PowerShell/comments/jj4wzw/removing_trojanpowershellmountsiaml_trigger_from/\r\nhttps://techcommunity.microsoft.com/t5/microsoft-defender-for-endpoint/defender-detected-powershell-ise-exe-as-trojan-powershell/m-p/2180534\r\n\r\n\r\nIn addition, [this article](https://web.archive.org/web/20210421190712/https://getimageview.net/2020/06/02/microsoft-defender-smartscreen-is-hurting-independent-developers/) suggests that the file being unsigned is the problem, and a commenter said that \"Cleared it up by submitting it to Microsoft’s service at https://www.microsoft.com/en-us/wdsi/filesubmission.\" Do we make it part of our GitHub pipeline to submit changed files to that site?\r\n\r\nEdit: I know that the PowerShell team is not the Defender team,  but considering unsigned PowerShell files in a git repository (it's impossible to sign and commit, I've tried, it changes the SHA) trigger AV warnings, this may be a very big problem for PowerShell development and scripting in general. Taking a look at [Warren](https://twitter.com/psCookieMonster/status/1392796401545981953)'s code, which has been flagged by Defender, nothing stands out.\r\n\r\n```powershell\r\n# Pester wasn't mocking git... \r\n# Borrowed idea from https://github.com/pester/Pester/issues/415\r\nfunction Invoke-ExternalCommand {\r\n    [cmdletbinding()]\r\n    param($Command, [string[]]$Arguments, [switch]$Passthru)\r\n\r\n    Write-Verbose \"Running $Command with arguments $($Arguments -join \"; \")\"\r\n    $result = $null\r\n    $result = & $command @arguments  \r\n    Write-Verbose \"$($result | Out-String)\"\r\n    if($Passthru)\r\n    {\r\n        $Result\r\n    }\r\n}\r\n````",
  "closed_at": "2021-05-17T20:56:41Z",
  "comments": [
    {
      "author": "tig",
      "author_association": "NONE",
      "body": "I don't think this is specific to your script.\r\n\r\nDefender has quarantined my `profile.ps1`! \r\n\r\n![image](https://user-images.githubusercontent.com/585482/118169474-d5bcda00-b3dd-11eb-94a0-0cda73de283d.png)\r\n\r\n\r\nThis is insane.",
      "created_at": "2021-05-13T18:24:36Z",
      "updated_at": "2021-05-13T18:24:59Z"
    },
    {
      "author": "potatoqualitee",
      "author_association": "NONE",
      "body": "Crushing, @tig! Hopefully this gets fixed soon.\r\n\r\nIt was suggested that I ping @SteveL-MSFT and @PaulHigin to ask if they can get the MS Defender team to scan the GitHub Repos of popular community modules help teach the ML.",
      "created_at": "2021-05-13T19:14:43Z",
      "updated_at": "2021-05-13T19:15:51Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "The Defender team continuously refines and update their heuristics to detect potential malicious scripts.  I don't think there's a way to validate one moment in time and ensure it'll always pass detection (as the rules keep changing/improving) with the exception of signing it with the Windows certificate (yeah, that's not going to happen!).\r\n\r\nI'm pretty sure the Defender team already uses GitHub Open Source code as a resource, but I don't think they can just give any projects a free pass as you can't guarantee that a well known and popular piece of code doesn't get attacked and malicious code gets added.  See [this article](https://thenewstack.io/github-open-source-projects-entangled-by-the-octopus-malware-scanner/) as one example.\r\n",
      "created_at": "2021-05-13T22:10:59Z",
      "updated_at": "2021-05-13T22:11:32Z"
    },
    {
      "author": "potatoqualitee",
      "author_association": "NONE",
      "body": "Thank you for the detailed response. Is there any way you can engage the Defender team to get a confirmation either way?",
      "created_at": "2021-05-13T22:31:03Z",
      "updated_at": "2021-05-13T22:31:03Z"
    },
    {
      "author": "tig",
      "author_association": "NONE",
      "body": "> The Defender team continuously refines and update their heuristics to detect potential malicious scripts. I don't think there's a way to validate one moment in time and ensure it'll always pass detection (as the rules keep changing/improving) with the exception of signing it with the Windows certificate (yeah, that's not going to happen!).\r\n> \r\n> I'm pretty sure the Defender team already uses GitHub Open Source code as a resource, but I don't think they can just give any projects a free pass as you can't guarantee that a well known and popular piece of code doesn't get attacked and malicious code gets added. See [this article](https://thenewstack.io/github-open-source-projects-entangled-by-the-octopus-malware-scanner/) as one example.\r\n\r\nBut @SteveL-MSFT, the fact that my PROFILE ps1 gets literally deleted by Defender is way different than Defender flagging ps1s that are actually found in the wild.\r\n\r\nI've had to disable Defender's scanning for this vuln to keep it from deleting my PowerShell profile! \r\n\r\nI can't believe I'm the only person this is happening to!",
      "created_at": "2021-05-13T23:33:06Z",
      "updated_at": "2021-05-13T23:33:06Z"
    },
    {
      "author": "regner",
      "author_association": "NONE",
      "body": "> I can't believe I'm the only person this is happening to!\r\n\r\nYou're not. Our TeamCity builds started failing across the board two days ago after a Windows 10 security update. To get builds running again we had to disable real-time protection. Which was deemed acceptable in the short-term while IT works on bringing on a new AV system that is not Windows Defender.",
      "created_at": "2021-05-13T23:37:20Z",
      "updated_at": "2021-05-13T23:37:20Z"
    },
    {
      "author": "gsaluja9",
      "author_association": "NONE",
      "body": "I saw this too. any recommended actions ?\r\n![psvirus](https://user-images.githubusercontent.com/52312085/118289904-70c7b980-b49b-11eb-9280-8efd6d2f09b1.jpg)\r\n",
      "created_at": "2021-05-14T15:02:13Z",
      "updated_at": "2021-05-14T15:02:13Z"
    },
    {
      "author": "jt-eic",
      "author_association": "NONE",
      "body": "For the record, I'm getting this issue as well.",
      "created_at": "2021-05-14T20:15:12Z",
      "updated_at": "2021-05-14T20:15:12Z"
    },
    {
      "author": "mackposh",
      "author_association": "NONE",
      "body": "@SteveL-MSFT I was just woken up at 3am this morning by alerting because a script we run on a nightly basis on ~10,000 endpoints Defender decided suddenly was a Trojan. This script hasn’t changed in months. These endpoints are in a PCI compliant segregated environment with no domain. This is a real problem. What’s the point of using a particular AV product if the ratio of false positives to legitimate events is high? At some point, it becomes the boy crying wolf.",
      "created_at": "2021-05-15T09:33:09Z",
      "updated_at": "2021-05-15T09:33:09Z"
    },
    {
      "author": "potatoqualitee",
      "author_association": "NONE",
      "body": "Btw, Steve said this on Twitter \n\n> Some folks are getting false positives from Windows Defender recently with their legitimate PowerShell scripts.  We've contacted someone on the Defender team, so hopefully this gets resolved quickly.",
      "created_at": "2021-05-15T15:47:42Z",
      "updated_at": "2021-05-15T15:47:42Z"
    },
    {
      "author": "mackposh",
      "author_association": "NONE",
      "body": "First, apologies to @SteveL-MSFT if my last comment was a little salty. I realize this isn't Powershell's problem directly. For some additional info, the script in question hasn't been touched in 2 years, and after reviewing it looking for anything we were doing that might have triggered AMSI(like direct .Net calls or inline C# type of things), it's as vanilla Powershell as you can probably get. That said, the irony of it all is that this is the script we use to make sure certain file extensions and directories are in Defender's exclusion lists. We are temporarily disabling certain Defender behaviors like real-time network scanning.\n\nI can see why heuristics may have interpreted that behavior as potentially malicious, but if you can't manage Defender policies with the Defender Powershell module then what's the alternative? Again, for our environment, these endpoints are not in a domain and have no network access except for what we specifically allow, so solutions like Group Policy are not an option.\n\nIt would be preferable if Defender had options to customize actions to take for different events. In this case, warn us, but don't quarantine immediately. Understandably, from a security perspective, that increases the potential risk for us, especially if a specific event is actually legitimately malicious. I'd argue though that that is something that we, as an organization, should have processes and solutions in place to handle such an event. \n\nIn our case, due to the segregated nature of our network environment, potential impact is rather low. We can simply replace the affected endpoint(s) without any worry of the compromise being able to spread to other systems, so for us, such a risk may be acceptable. It wouldn't for everyone though, so this is a tricky problem to solve.\n\nStill, I think the problem is that Defender's heuristics are a wee bit _too sensitive_ and need dialed back a bit.",
      "created_at": "2021-05-15T16:25:37Z",
      "updated_at": "2021-05-15T16:25:37Z"
    },
    {
      "author": "TravisEz13",
      "author_association": "MEMBER",
      "body": "WG-Security\r\n\r\nPowerShell must follow the AMSI result.  If we add ability to alter how we respond, it becomes an attack vector to AMSI plug-ins.  We would need an AMSI feature that tells us that we could, say warn, instead of block. This would probably be by return code from AMSI.\r\n\r\nOtherwise, you need to work through [Microsoft Security Intelligence](https://www.microsoft.com/en-us/wdsi/filesubmission) to get the file cleared as not malware.\r\n\r\nI think we can continue this as a discussion.",
      "created_at": "2021-05-17T20:56:30Z",
      "updated_at": "2021-05-17T20:56:30Z"
    }
  ],
  "created_at": "2021-05-13T10:58:06Z",
  "number": 15396,
  "state": "closed",
  "title": "Feature Request - Additional details related to Trojan:PowerShell/Mountsi.A!ml",
  "updated_at": "2021-05-17T20:56:43Z"
}