{
  "_url": "https://github.com/PowerShell/PowerShell/issues/15403",
  "author": "bergmeister",
  "body": "## Summary of the new feature/enhancement\r\n\r\n[install-powershell.ps1](https://github.com/PowerShell/PowerShell/blob/master/tools/install-powershell.ps1) offers the option of installing Current, preview or daily but not LTS. This would e.g. be useful to test the LTS version as well in CI as hosted agents like LTS are usually on the Current version.\r\n\r\n## Proposed technical implementation details (optional)\r\n\r\nThe [metadata.json](https://raw.githubusercontent.com/PowerShell/PowerShell/master/tools/metadata.json) file is already used to determine the right version and already has the version of the last servicing/LTS release. The script is not elegant as it already has a switch for preview and daily, therefore adding a `LTS` switch would at least keep it consistent as we'd likely not want to break existing syntax.",
  "closed_at": null,
  "comments": [
    {
      "author": "adityapatwardhan",
      "author_association": "MEMBER",
      "body": "Maintainers reviewed the issue and we think it is a good idea. Eventually we will be having more that one LTS releases so there would be some need to specify which version needs to be installed.",
      "created_at": "2021-05-25T21:29:45Z",
      "updated_at": "2021-05-25T21:29:45Z"
    },
    {
      "author": "bergmeister",
      "author_association": "CONTRIBUTOR",
      "body": "So are you saying that an -LTS switch would not be acceptable? To me it sounds like the current and lts switches should just install the latest lts or current 'flavour'. Anything that is not latest current or latest lts, a version switch could be offered instead where people can pin major and minor version?",
      "created_at": "2021-06-03T18:06:18Z",
      "updated_at": "2021-06-03T18:06:18Z"
    }
  ],
  "created_at": "2021-05-13T22:15:47Z",
  "number": 15403,
  "state": "open",
  "title": "Feature Request: install-powershell.ps1: Being able to install latest servicing/LTS release and not just Current",
  "updated_at": "2021-06-03T18:06:18Z"
}