{
  "_url": "https://github.com/PowerShell/PowerShell/issues/1540",
  "author": "joeyaiello",
  "body": "**Please don't merge this PR yet**\n\n<!-- PR checklist -->\n- [x] Resolves the need for an all-up governance doc.\n- [x] Code is up-to-date with `master`.\n- [N/A] Add tests that fail without your changes.\n- [x] Update all relevant [documentation](../docs).\n\n<!-- Provide more details about the PR below -->\n\nThis is purely a WIP review to make sure I'm not completely out of left field here. I still need to do a considerable rewrite of the other contributor docs in order to change terminology to align with this document (e.g. maintainers.md, contributing.md, etc.)\n\nEDIT: Thanks to @TravisEz13 and @KarolKaczmarek for giving me some existing documentation, governance, and structure to work with. :) \n",
  "closed_at": "2016-08-11T21:21:06Z",
  "comments": [
    {
      "author": "joeyaiello",
      "author_association": "CONTRIBUTOR",
      "body": "Didn't meant to include a bunch of those edits in my weak attempt at a rebase. My apologies. I'm inline with `master` now #Resolved\n",
      "created_at": "2016-07-27T18:48:57Z",
      "updated_at": "2016-08-10T18:44:11Z"
    },
    {
      "author": "TravisEz13",
      "author_association": "MEMBER",
      "body": ":clock1:\n",
      "created_at": "2016-07-27T22:19:54Z",
      "updated_at": "2016-07-27T22:19:54Z"
    },
    {
      "author": "TravisEz13",
      "author_association": "MEMBER",
      "body": "1 comments do not have a response. #Pending\n",
      "created_at": "2016-07-28T21:36:31Z",
      "updated_at": "2016-08-10T18:44:21Z"
    },
    {
      "author": "joeyaiello",
      "author_association": "CONTRIBUTOR",
      "body": "@vors @hiteshraigandhi @lzybkr @TravisEz13 @andschwa @daxian-dbw @mirichmo \n\nI believe I addressed all the notes from this week's meeting. I'm in a place now where I think this can be merged and executed upon whenever we want. I'm out until Monday, but I can definitely address any minor comments in another PR next week. :)\n",
      "created_at": "2016-08-04T21:03:56Z",
      "updated_at": "2016-08-04T21:03:56Z"
    },
    {
      "author": "TravisEz13",
      "author_association": "MEMBER",
      "body": ">   See [this][closing-via-message] for more details.\n\nThis does not agree with the maintainers readme.md\n`SHOULD encourage contributors to refer to issues in their pull request description ...' \n\nEither this should say that they should open a new issues if one does not exist, or the maintainers readme should be qualified, with if the issue already exists #Pending\n\n---\n\nRefers to: .github/CONTRIBUTING.md:101 in ee5a755. [](commit_id = ee5a755540086ff5475a6b67a1330f16b49a83c0, deletion_comment = False)\n",
      "created_at": "2016-08-09T03:02:54Z",
      "updated_at": "2016-08-10T18:45:26Z"
    },
    {
      "author": "TravisEz13",
      "author_association": "MEMBER",
      "body": "> - Otherwise, these issues should be treated like any other issue in this repo.\n\nThere have been comments that doc issues should not require opening an issue.  [Example](https://github.com/PowerShell/PowerShell/pull/1640#issuecomment-238322178) #Pending\n\n---\n\nRefers to: .github/CONTRIBUTING.md:51 in ee5a755. [](commit_id = ee5a755540086ff5475a6b67a1330f16b49a83c0, deletion_comment = False)\n",
      "created_at": "2016-08-09T03:03:40Z",
      "updated_at": "2016-08-10T18:44:53Z"
    },
    {
      "author": "joeyaiello",
      "author_association": "CONTRIBUTOR",
      "body": "Had an offline conversation with @TravisEz13 about issues being created prior to pull requests. I'm making some final modifications to this PR that should communicate the following:\n- issues should be created prior to doing large pieces of work. This is to try and minimize the duplication of effort on significant bodies of work\n- a PR should not be blocked on whether an issue exists. If they've done the work, and the work is sound, and the PR meets all the bars to being accepted by a repository maintainer, it should be accepted. Any discussion on it can happen in the PR.\n- _however_, that PR submitter should be reminded that, next time, they should start an issue to get this discussion and approval out of the way BEFORE they do a bunch of work. This is to minimize duplication of efforts and to minimize having to redo work that didn't get discussed or approved\n\nSound okay?  #Resolved\n",
      "created_at": "2016-08-09T22:50:58Z",
      "updated_at": "2016-08-10T18:50:42Z"
    },
    {
      "author": "joeyaiello",
      "author_association": "CONTRIBUTOR",
      "body": "Also, we need to merge this guy. We can continue to make any minor fixes over the next couple days, but it's gotta go in. \n",
      "created_at": "2016-08-09T22:51:15Z",
      "updated_at": "2016-08-09T22:51:15Z"
    },
    {
      "author": "joeyaiello",
      "author_association": "CONTRIBUTOR",
      "body": "Alright, @TravisEz13, everything should be merged up here. Can I get a signoff and merge from you? Thanks! #Pending\n",
      "created_at": "2016-08-09T23:45:50Z",
      "updated_at": "2016-08-10T18:48:15Z"
    },
    {
      "author": "alexandair",
      "author_association": "CONTRIBUTOR",
      "body": "That section about issues prior to PR applies to code-related PR? Or, docs-related PRs too?\n",
      "created_at": "2016-08-09T23:54:54Z",
      "updated_at": "2016-08-09T23:54:54Z"
    },
    {
      "author": "joeyaiello",
      "author_association": "CONTRIBUTOR",
      "body": "@alexandair the spirit of the guideline is, again, to minimize duplication of efforts and churn in one place. It's a poor-man's work tracking mechanism. \n\nBut given the spirit of the rule, you don't need to go file an issue for every typo. However, I _do_ think there's some benefit to saying \"hey, semantic line feeds are busted all over the repo, I'm going to go tackle that\" and just giving people a heads up before changing 15-20 files. And there's _certainly_ benefit to saying \"hey, I'm going to go move a bunch of files around\" or \"I'm going to go refactor these sets of docs and move headers and content between files/folders\". I say this from personal experience: this PR was _super_ hard to get merged because of how much a moving target `master` was. (And not just the technical aspects of rebasing, but conceptually keeping track of often undiscussed decisions people were codifying throughout the maintainer and contributor documentation.) \n\nI know it feels like needless process now, but I'd rather err on the side of a little process before we open the floodgates. \n\nPlus, I also don't expect contributor documentation here to be changing significantly after the first month we're live. So, to be honest, I think it's kind of a no-op. \n",
      "created_at": "2016-08-10T16:29:29Z",
      "updated_at": "2016-08-10T16:29:29Z"
    },
    {
      "author": "TravisEz13",
      "author_association": "MEMBER",
      "body": "This looks good to me other than, this comment:  https://github.com/PowerShell/PowerShell/pull/1540#discussion-diff-74307276\n\nWe should merge and file an issue for this.\n",
      "created_at": "2016-08-10T18:56:19Z",
      "updated_at": "2016-08-10T18:56:19Z"
    },
    {
      "author": "joeyaiello",
      "author_association": "CONTRIBUTOR",
      "body": "Looks like I forgot to do it in both places. Should be fixed now\n",
      "created_at": "2016-08-11T20:48:34Z",
      "updated_at": "2016-08-11T20:48:34Z"
    }
  ],
  "created_at": "2016-07-27T17:45:40Z",
  "number": 1540,
  "state": "closed",
  "title": "[WIP] review of project governance ",
  "updated_at": "2016-08-11T21:21:12Z"
}