{
  "_url": "https://github.com/PowerShell/PowerShell/issues/15451",
  "author": "vexx32",
  "body": "## Details\r\n\r\nThe actual process around how CoC violations are handled isn't really clear. There's reference to the Microsoft Code of Conduct and an email address, but how the process of reporting works doesn't really seem clear;\r\n\r\n- Who are we expected to report to? Is that email contact _for_ that, or just for general questions?\r\n- How do community members follow up after an initial report?\r\n- What are the expected communications from the team, if any is necessary, around this kind of thing?\r\n\r\nThese questions are not exhaustive; it'd be good to discuss further here, other folks may have other questions as well.\r\n\r\n## Context\r\n\r\nFrom @joeyaiello's [PR around WG governance documentation](https://github.com/PowerShell/PowerShell/pull/14603):\r\n\r\n> We should reiterate that WG members must also follow our Code of Conduct, and link to it and our (hopefully extant) documentation on how we handle COC violations and the process that community members can follow to report COC issues.\r\n>\r\n> _Originally posted by @andschwa in https://github.com/PowerShell/PowerShell/pull/14603#discussion_r574175551_\r\n\r\nResponse from myself a little down the chain:\r\n\r\n> Actually, _is_ there a process for reporting COC violations? I can imagine there could well be cases where a report needs to be made somewhat more directly that (e.g.) publicly pinging a WG/pwsh team member, or filing a Github issue.\r\n>\r\n>Are folks just expected to drop an email to the address mentioned in the COC document in the repo? 🤔 ",
  "closed_at": null,
  "comments": [],
  "created_at": "2021-05-25T21:31:12Z",
  "labels": [
    "Area-Maintainers-Documentation",
    "Issue-Meta",
    "Issue-Discussion"
  ],
  "number": 15451,
  "state": "open",
  "title": "Clarify process around reporting and communication for CoC violations",
  "updated_at": "2021-05-25T21:36:18Z"
}