{
  "_url": "https://github.com/PowerShell/PowerShell/issues/15476",
  "author": "rjmholt",
  "body": "## Summary of the new feature/enhancement\r\n\r\nFrom https://github.com/PowerShell/PowerShell/issues/15304.\r\n\r\n`Get-ChildItem` should provide output in a consistent ordering across platforms if possible, and if implemented should add a switch to opt out of the overhead of sorting.\r\n\r\nOne important question around this ordering is whether it should be case-sensitive or not across platforms. Currently it is sorted with `CurrentCultureIgnoreCase`:\r\n\r\nhttps://github.com/PowerShell/PowerShell/blob/c857392c34613fc8ece1432ceb89a5310d9e5fd9/src/System.Management.Automation/namespaces/FileSystemProvider.cs#L1617-L1618\r\n\r\nHowever, it may be desirable on *nix platforms or on case-sensitive filesystems to make the ordering discern case-sensitivity.",
  "closed_at": null,
  "comments": [
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "No need to complicate the cmdlet. It is wrong design intention. All cosmetics must be in formatting subsystem if needed and they could be switchable. For scripts we should use explicit formatting where need using Sort-Object cmdlet or .Net methods.\r\nDon't kill PowerShell performance at whole for the sake of pink in the output.",
      "created_at": "2021-05-28T05:27:26Z",
      "updated_at": "2021-05-28T05:27:26Z"
    },
    {
      "author": "jborean93",
      "author_association": "COLLABORATOR",
      "body": "I personally feel like pwsh shouldn’t be ordering at all and just output the objects as they are retrieved from the file system. This is more performant when dealing with large structures as it doesn’t need to collect everything to then sort. If the end user desires it to be sorted they can pipe the output into `Sort-Object` and sort as they wish.",
      "created_at": "2021-05-28T09:40:22Z",
      "updated_at": "2021-05-28T09:40:22Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "To be clear; we're _already_ sorting this, have been since... probably 6.0. The formatting system currently does not support actual sorting of objects.\r\n\r\nYes, there are performance concerns because of that, most likely. However, it's probably not unreasonable to say that some kind of sorted output is _expected_, especially on MacOS or Linux systems, whose filesystems do not tend to order by default. The `ls` utility sorts by name by default, so I think it's not unreasonable for folks to generally expect that PS's Get-ChildItem does the same.\r\n\r\nConsider also if the formatting system was the only thing doing sorting. Users could `Get-ChildItem`, see the results, try to `Get-ChildItem | Select -First 1` or `$items[0]` and the item they end up with is not the first one they saw in the output. I don't think sorting in formatting is the answer here, it only leads to more confusion.\r\n\r\nIt you call `[System.IO.Directory]::EnumerateFileSystemEntries($path)` on Mac/Linux from PS, you can see what I mean. There is essentially no intrinsic ordering at all, so if we didn't order things it would be a complete mess and Get-ChildItem would pretty much always have to be paired with Sort-Object when used interactively, which isn't really ideal. \r\n\r\nAdding an opt-in to more performant behaviour is definitely not _ideal_ (I would kinda prefer that as the default, really), but I think it's not an unreasonable concession to have slightly less performant behaviour for a cmdlet that's often used interactively. I think users will complain if they have to constantly reach for `gci | sort-object name` instead of just `gci` when working at a console.\r\n\r\nFor cases where the interactive behaviour is not necessary or particularly important, an option that can be provided (even as a default via $PSDefaultParameterValues) is an OK compromise in my opinion.",
      "created_at": "2021-05-28T12:49:01Z",
      "updated_at": "2021-05-28T12:49:42Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "> The ls utility sorts by name by default, so I think it's not unreasonable for folks to generally expect that PS's Get-ChildItem does the same.\r\n\r\nEvery time I see an appeal to Unix it makes me nervous. \r\nWhatever part of Unix we touch, we always find in its history discussions or even claims that it works wrong but it doesn't get fixed because it's been working for _years_.\r\nI sometimes get the feeling that Unix consists entirely of deviations from concepts, violations of standards and bugs in implementation which are declared as Unix standards! 😺 \r\n\r\n_PowerShell 1.0 appeared as a rethinking of previous experiences (including Unix) based on the most advanced concepts of the time._\r\nIs it worth referring to Unix as the benchmark in this situation (I am not talking about minor inconsistencies in implementation, but about concepts)? No.\r\n\r\nUnfortunately the conceptual development process of PowerShell stopped a long time ago. It got bogged down in the swamp of everyday life and backward compatibility. Although the number of incompatible changes is already so great that it makes no sense to talk about backward compatibility.\r\n\r\n_We should be discussing and trying to implement modern innovative concepts more than pink colored letters or ala old school Unix behavior._",
      "created_at": "2021-05-28T13:50:42Z",
      "updated_at": "2021-05-28T13:50:42Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "I don't disagree with your points @iSazonov but I think some concession for usability in `Get-ChildItem` which is very often used interactively is not unreasonable here. 🙂 ",
      "created_at": "2021-05-28T14:33:40Z",
      "updated_at": "2021-05-28T14:33:40Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "@vexx32 Hidden files are not intended for interactivity, are they? :-)\r\nIf we follow the logic that you have expressed, we should magically overcome the security boundaries and access files without access rights \"because it's very necessary.\"",
      "created_at": "2021-05-28T15:35:02Z",
      "updated_at": "2021-05-28T15:35:02Z"
    },
    {
      "author": "jessey-git",
      "author_association": "NONE",
      "body": "The sorting extends beyond display, to tab-completion as well -- which 7.1 broke spectacularly (#14757) and is why I won't upgrade to it as long as possible.",
      "created_at": "2021-06-16T20:51:31Z",
      "updated_at": "2021-06-16T20:51:31Z"
    },
    {
      "author": "jessey-git",
      "author_association": "NONE",
      "body": "Any movement here?  I don't see why, in any universe, '_' should come before '.' for file listing or tab-completion at least as per the issue noted in my above comment.",
      "created_at": "2021-10-03T23:12:59Z",
      "updated_at": "2021-10-03T23:12:59Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "After we get new .Net API we will use it in FileSystem Provider v2 (FSPv2). As result, the sorting will be removed from the provider. We will consider moving the sorting to Formating Subsystem (See #15369).",
      "created_at": "2021-11-30T07:08:31Z",
      "updated_at": "2021-11-30T07:10:21Z"
    }
  ],
  "created_at": "2021-05-28T00:53:31Z",
  "labels": [
    "Issue-Enhancement",
    "WG-Cmdlets",
    "WG-Cmdlets-Management",
    "Needs-Triage",
    "Area-FileSystem-Provider"
  ],
  "number": 15476,
  "state": "open",
  "title": "Establish a known, cross-platform ordering of output from Get-ChildItem and provide a parameter to opt out of sorting",
  "updated_at": "2021-11-30T07:10:21Z"
}