{
  "_url": "https://github.com/PowerShell/PowerShell/issues/15533",
  "author": "rjmholt",
  "body": "## Summary of the new feature/enhancement\r\n\r\nMotivated by https://github.com/PowerShell/PSArm/pull/133 and related to https://github.com/PowerShell/PowerShell/issues/15532.\r\n\r\nThere are a number of cases for PowerShell DSLs where a user-provided scriptblock needs to be executed in a local scope but where normal commands and aliases should not apply.\r\n\r\nOne example in PSArm is where resource keywords (defined as functions) are overridden by global aliases which are unhelpful in that scope. In order to prevent these aliases from affecting the DSL, PSArm has to do some kind of scope teardown and restore (or compromise the UX of the DSL).\r\n\r\nAnother example is in Pester, where Pester defines mocks while also storing the true definition of commands in a hashtable to safely use the latter while defining the former for testing.\r\n\r\nBecause of the altered-universe semantics of many DSLs, it would be nice if there were a finer-grained control over scopes for this kind of problem, allowing things like:\r\n\r\n- Running a scriptblock in an alias-free environment or an environment where only supplied aliases are defined\r\n- Being able to \"freeze\" the current scope (and call back into it when needed) and pushing a new scope\r\n- Being able to create a new child scope where exactly the desired commands/functions/aliases/variables are defined and no others (essentially https://github.com/PowerShell/PowerShell/issues/15532)\r\n\r\nWhile this issue was opened separately from https://github.com/PowerShell/PowerShell/issues/15532 because the two are solved separately in PSArm, it's easy to imagine the \"clean scope\" and the \"scope interleaving\" problems could easily be accomplished by a well thought out \"custom child scope\" API.",
  "closed_at": null,
  "comments": [
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "It seems that we will have to redesign and reimplement Engine to make it work transparently and fast. :-)",
      "created_at": "2021-06-08T03:44:30Z",
      "updated_at": "2021-06-08T03:44:30Z"
    }
  ],
  "created_at": "2021-06-07T18:18:10Z",
  "labels": [
    "Issue-Enhancement",
    "WG-Language",
    "Needs-Triage"
  ],
  "number": 15533,
  "state": "open",
  "title": "[DSL support] Provide a way to execute a scriptblock in a clean or custom scope",
  "updated_at": "2021-06-08T03:44:30Z"
}