{
  "_url": "https://github.com/PowerShell/PowerShell/issues/15534",
  "author": "rjmholt",
  "body": "## Summary of the new feature/enhancement\r\n\r\nWhen writing PowerShell DSLs, a common feature is providing \"keywords\" as commands and \"blocks\" or \"bodies\" as scriptblocks. The awkward part here is that because the scriptblock is actually being passed to the command as an argument value, it must be on the same line to be recognised as such.\r\n\r\nIt would be nice if keyword bodies could be provided much like ordinary blocks in PowerShell today, on the next line as well.\r\n\r\nThe big issue here is that marked keywords must already be known at parse time to make this work, however in many DSL contexts this will be the case. Alternatively, the parser could simply always look for a scriptblock on the next line, but that would be a bigger and probably less desirable change.",
  "closed_at": null,
  "comments": [
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "> It would be nice if keyword bodies could be provided much like ordinary blocks in PowerShell today, on the next line as well.\r\n\r\nIt doesn't always work even now. :-(\r\n\r\nI think the current PowerShell Engine design is not well suited for such things as you describe in this set of new issues.\r\nAny insertion of a new feature almost inevitably leads to breaking changes at best or regressions.\r\nI'd much rather open up an experimental branch of V8 and redesign PowerShell Engine so as to better support the concept of subsystems and their more flexible, transparent, and functional interactions.",
      "created_at": "2021-06-08T04:12:07Z",
      "updated_at": "2021-06-08T04:12:07Z"
    }
  ],
  "created_at": "2021-06-07T18:22:25Z",
  "labels": [
    "Issue-Enhancement",
    "WG-Language",
    "Needs-Triage"
  ],
  "number": 15534,
  "state": "open",
  "title": "[DSL support] Allow DSL keyword highlighting and next-line brace support for scriptblock bodies",
  "updated_at": "2021-06-08T04:12:08Z"
}