{
  "_url": "https://github.com/PowerShell/PowerShell/issues/15564",
  "author": "bgshacklett",
  "body": "## Summary of the new feature/enhancement\r\n\r\n<!-- \r\nA clear and concise description of what the problem is that the new feature would solve.\r\nTry formulating it in user story style (if applicable):\r\n'As a user I want X so that Y.' with X being the being the action and Y being the value of the action.\r\n-->\r\nAs a software developer, I want to be able to write to the structured PowerShell streams, from \"native\" code, so that I can ensure that output is treated appropriately and provide a more native experience to my users.\r\n\r\nI've seen, and encountered, a number of issues reported across multiple repositories (and my own use cases) where people are dealing with the fact that writing to `stderr` from a native application may result in an error. This has led to many suggestions for workarounds and changes to PowerShell's behavior which may not fit with the original goals and design.\r\n\r\nRather than changing the behavior of how PowerShell handles Stderr (or perhaps in addition to), it would be quite useful for developers using Python, Go, Haskell, et al., to be able to write to additional streams, such as Warning, Info, Verbose, etc.. This would facilitate development of native applications which feel closer in behavior to PowerShell Cmdlets. I expect this may also remove some barriers to adoption, which exist amongst POSIX shell purists. \r\n\r\n## Proposed technical implementation details (optional)\r\n\r\n<!-- \r\nA clear and concise description of what you want to happen.\r\nConsider providing an example PowerShell experience with expected result.\r\n-->\r\nI expect that this enhancement would take the form of multiple phases:\r\n1. Ground work to enable the behavior and a proof of concept, of some sort, showing a native application writing to, for example, the Informational stream.\r\n2. A documented recommendation for developers of languages which result in native executables, which explains how to write libraries which enable output to PS streams.\r\n\r\nAdditional goals:\r\n3. A documented standard for the \"protocol\", or mechanism, which enables native streams. This might enable the same architecture to be implemented in other shells.\r\n4. Reference libraries for languages which may be strategic to Microsoft, e.g.: Python.\r\n5. Extend the solution to enable writing object streams from native applications, rather than pure text.",
  "closed_at": null,
  "comments": [
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "As far as my own understanding goes, native applications on Windows, MacOS, and Linux generally only have access to two streams: stdout, and stderror.\r\n\r\nThe additional streams PowerShell provides only really exist as a concept _inside_ of PowerShell. So any way of writing to them has to be handled from one of these existing inter-process communication methods. I'm not clear on how you'd enable that without also making the application (potentially) submit oddly-formed output to non-PowerShell applications?",
      "created_at": "2021-06-11T15:03:06Z",
      "updated_at": "2021-06-11T15:03:30Z"
    },
    {
      "author": "jborean93",
      "author_association": "COLLABORATOR",
      "body": "This is actually possible today but there are a few caveats. Your native app can output to stdout in CLIXML the objects you want to return back to PowerShell. Here is a basic example of that when using bash (any app will do though)\r\n\r\n```powershell\r\nSet-Content -Path /tmp/test.sh -Value @'\r\n#!/usr/bin/env bash\r\n\r\necho '#< CLIXML'\r\necho -n '<Objs Version=\"1.1.0.1\" xmlns=\"http://schemas.microsoft.com/powershell/2004/04\">'\r\necho -n  '<S S=\"Output\">output string</S>'\r\necho -n  '<Obj S=\"Output\" RefId=\"0\"><TN RefId=\"0\"><T>System.Management.Automation.PSCustomObject</T><T>System.Object</T></TN><MS><S N=\"Foo\">Bar</S></MS></Obj>'\r\necho -n  '<S S=\"Verbose\">verbose msg</S>'\r\necho -n '</Objs>'\r\n'@\r\n\r\n$out = bash /tmp/test.sh\r\n```\r\n\r\nWhen running that I get the following\r\n\r\n![image](https://user-images.githubusercontent.com/8462645/121739931-ac5baf00-cb3f-11eb-93c4-dfa254b88399.png)\r\n\r\n\r\nWhat's happening is that pwsh sees the start of the output is `# <CLIXML` and then parses the rest of the output as actual objects. It allows you to write to specific streams as well as write complex objects back which is pretty nice. The downsides of this\r\n\r\n* The native app needs to be aware of this - `pwsh` has the `-OutputFormat XML` that does the same thing, a native app could do the same\r\n* You explicitly need to capture/redirect the output when calling the native app\r\n  * Not doing so means the output is written directly to the console so the end user will see the CLIXML\r\n  * Capturing is essentially doing something like `$var = native` or pipelining/redirection in pwsh\r\n* CLIXML is very verbose\r\n  * Simple strings are fine but dealing with complex objects gets messy very quickly",
      "created_at": "2021-06-11T19:36:38Z",
      "updated_at": "2021-06-11T19:36:38Z"
    },
    {
      "author": "237dmitry",
      "author_association": "NONE",
      "body": "> As far as my own understanding goes, native applications on Windows, MacOS, and Linux generally only have access to two streams: stdout, and stderror.\r\n\r\nAnd `stdin`. And `3..8` descriptors may be used for arbitrary output (for bash):\r\n```bash\r\nexec 3>file\r\necho \"test\" >&3\r\ncat file\r\n```",
      "created_at": "2021-06-11T21:18:09Z",
      "updated_at": "2021-06-11T21:18:09Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "We discussed such proposal previously and rejected because native application sometimes use error output handle not for writing errors but for other purposes.",
      "created_at": "2021-06-12T06:09:05Z",
      "updated_at": "2021-06-12T06:09:05Z"
    },
    {
      "author": "jborean93",
      "author_association": "COLLABORATOR",
      "body": "I’m not sure what else needs to be done, it’s entirely possible as evident by my previous comment.",
      "created_at": "2021-06-12T09:28:19Z",
      "updated_at": "2021-06-12T09:28:19Z"
    },
    {
      "author": "rkeithhill",
      "author_association": "COLLABORATOR",
      "body": "> I've seen, and encountered, a number of issues reported across multiple repositories (and my own use cases) where people are dealing with the fact that writing to stderr from a native application may result in an error. \r\n\r\nThis issue is being addressed via a feature which is experiment in the 7.2 previews `PSNotApplyErrorActionToStderr`.",
      "created_at": "2021-06-12T20:29:13Z",
      "updated_at": "2021-06-12T20:29:13Z"
    },
    {
      "author": "bgshacklett",
      "author_association": "NONE",
      "body": "> We discussed such proposal previously and rejected because native application sometimes use error output handle not for writing errors but for other purposes.\r\n\r\nThat's one thing that led me to open this request. I think the preferred solution, for those who wish to target PS, would be to make use of the Info stream, but at present it doesn't seem feasible. If a mechanism for that could be surfaced, such applications could handle streams appropriately per shell, and we might even see other shells add additional streams some day.\r\n\r\n@jborean93 Your suggestion is really interesting, and I'll probably do some exploration on that front. One of the caveats, however, makes it quite difficult to rely on the current mechanism:\r\n> You explicitly need to capture/redirect the output when calling the native app\r\n>\r\n>    Not doing so means the output is written directly to the console so the end user will see the CLIXML\r\n>    Capturing is essentially doing something like $var = native or pipelining/redirection in pwsh\r\n\r\nWhile possible, I believe it would be deemed infeasible, in most scenarios, to assume that output would be captured in this way. This is going to be outside of the control of most developers, unless they decide to distribute a shim with their application. While that might be technically feasible, imposing that on the majority of those who are writing native applications seems unlikely to bring about any useful results.\r\n\r\nRegarding the other two points:\r\n> *    The native app needs to be aware of this - pwsh has the -OutputFormat XML that does the same thing, a native app >could do the same\r\n> *    CLIXML is very verbose\r\n>        Simple strings are fine but dealing with complex objects gets messy very quickly\r\n\r\nWhile not perfect, I think these are solve-able, with the first being the most difficult (because environment detection is almost always painful). Dealing with CLIXML wouldn't be too bad if libraries were available in developers' chosen languages.",
      "created_at": "2021-06-14T12:42:39Z",
      "updated_at": "2021-06-14T12:42:39Z"
    },
    {
      "author": "jborean93",
      "author_association": "COLLABORATOR",
      "body": "> While possible, I believe it would be deemed infeasible, in most scenarios, to assume that output would be captured in this way.\r\n\r\nSomewhat agreed as it's another barrier but it's just something we have to live with. Luckily at least on Windows it is definitely possible to detect whether your app has redirected output (pwsh is capturing it) or it's connected directly to the console. This allows you to have your native app determine whether to output as per usual or whether it should output in CLIXML. I would recommend you still put it behind a certain argument/switch when calling the native app just to be explicit just like pwsh has `-OutputFormat XML`.\r\n\r\nTo detect whether your `stdout` is being captured you need to call [GetStdHandle](https://docs.microsoft.com/en-us/windows/console/getstdhandle) for `-11` (`stdout`) then call [GetFileType](https://docs.microsoft.com/en-us/windows/win32/api/fileapi/nf-fileapi-getfiletype). If the value is `FILE_TYPE_CHAR` you know no redirection has occurred and if it's `FILE_TYPE_PIPE` you know it has been redirected and pwsh is capturing it.\r\n\r\nThis somewhat makes sense as you don't want to be writing CLIXML to the stdout yourself for any actual output as it will be written straight to the console. It does suck if all you want to do is write to the verbose/warning/debug/info stream but the workaround is as simple as doing something like `native.exe | Out-String`. Considering you will probably have this behind some flag like `native.exe -OutFormat Pwsh` it's probably not too hard of an ask to make sure you are piping it into pwsh.\r\n\r\nIt's unfortunate but simply something you just need to adjust when calling your native app.",
      "created_at": "2021-06-14T19:07:59Z",
      "updated_at": "2021-06-14T19:08:33Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "I think we'd need to sort out a fix for https://github.com/PowerShell/PowerShell/issues/15363 before we can really call this \"solved\"; currently CLIXML isn't always deserialised by PS when received, and I think that's pretty undesirable. It's very non-obvious to the user that simply capturing the output will magically deserialise it properly.\r\n\r\nAnother thing was mentioned here that is worth reinforcing as well -- something that would make this significantly easier is creating a standalone CLIXML library for other folks to use when structuring their output, and provide abstractions for writing to the distinct streams.\r\n\r\nEven if only a C# library is provided initially, if it's open source others can take pointers from there and copy the implementation into another language to allow this to work for any native application with minimal friction.",
      "created_at": "2021-06-14T19:49:29Z",
      "updated_at": "2021-06-14T19:49:29Z"
    },
    {
      "author": "jborean93",
      "author_association": "COLLABORATOR",
      "body": "> I think we'd need to sort out a fix for #15363 before we can really call this \"solved\"\r\n\r\nSomewhat agreed, the trouble is that to solve #15363 would mean that powershell always processes the `stdout` leading to the existing problems with how it encodes the bytes from this stream. There are many issues with this and there's no silver bullet to solve them all so I personally doubt this is something that is really feasible. It also doesn't really make much sense to convert an object from CLIXML when all it is going to do is then output it to the host. The only major disadvantage I can see from the optional CLIXML parsing is that you don't write data to the various streams. Even then this isn't too big of a problem IMO because\r\n\r\n* Streams just typically write to the host in the default session, the native app could do the same thing in this case\r\n* If you are running it in a PowerShell pipeline and are inspecting the streams manually then the output is captured by pwsh anyway so the CLIXML is parsed\r\n\r\nIt's not ideal but it's possible today for a native app to determine whether to print CLIXML or just text. I would have to double check on Linux around this but I don't see any reasons why it wouldn't be possible",
      "created_at": "2021-06-14T20:05:07Z",
      "updated_at": "2021-06-14T20:05:07Z"
    },
    {
      "author": "SeeminglyScience",
      "author_association": "COLLABORATOR",
      "body": "If a native application is *targeting* PowerShell then I'd expect a binary module instead.  If they aren't explicitly targeting PowerShell, then any solution is going to require quite a bit of extra complexity and overhead.  Either output will need to be serialized in a way PowerShell recognizes (which would then require PowerShell to analyze the output of every native app) or some sort of IPC would have to be opened between them.\r\n\r\nTo me it seems like the ideal use case for the proposed feature is something the dev can tack onto their existing application to make it PowerShell friendly rather than being required in run in PowerShell.  I have a hard time imagining how this feature could be implemented in a way that would make the extra complexity worth while.",
      "created_at": "2021-06-15T14:29:31Z",
      "updated_at": "2021-06-15T14:29:31Z"
    }
  ],
  "created_at": "2021-06-11T12:50:05Z",
  "number": 15564,
  "state": "open",
  "title": "Feature Request: Enable native applications writing to PS structured streams (Info, Warning, etc.)",
  "updated_at": "2021-06-15T14:29:31Z"
}