{
  "_url": "https://github.com/PowerShell/PowerShell/issues/15644",
  "author": "terrajobst",
  "body": "## Steps to reproduce\r\n\r\nLaunch PowerShell in your favorite terminal.\r\n\r\n## Expected behavior\r\n\r\nThe prompt I've set up in my PowerShell profile.\r\n\r\n## Actual behavior\r\n\r\nI get the following boilerplate:\r\n\r\n```none\r\nPowerShell 7.1.3\r\nCopyright (c) Microsoft Corporation.\r\n\r\nhttps://aka.ms/powershell\r\nType 'help' to get help.\r\n```\r\n\r\n\"But Immo, you can turn this off by using `-nologo`\". Yes. But I have to do this in every single one of the places that launches the shell: shortcuts in the start menu, pinned task bar entries, the Windows Terminal commands, the VS Code integrated terminal, the Visual Studio terminal, Git GUI clients etc. It's tiring. If there would be a user wide setting, that might be an OK workaround, but every time I set up a new machine I have to add these extra arguments -- just to get a shell that is ready for use.\r\n\r\nThe year is 2021. We're embracing command line stuff and simple text files for the modern dev environment (really, we're just rediscovering Unix philosophy, but that's a different rant 😄).  It seems the default shell behavior should optimize for this kind of user, rather than forcing this boilerplate on everyone that arguably adds zero value to their experience.",
  "closed_at": "2022-01-11T04:07:46Z",
  "comments": [
    {
      "author": "bergmeister",
      "author_association": "CONTRIBUTOR",
      "body": "The point around configuration in multiple places is a good one. Being able to override the default (whatever it is now or will be) via an environment variable seems like a good addition.",
      "created_at": "2021-06-22T23:45:26Z",
      "updated_at": "2021-06-22T23:45:26Z"
    },
    {
      "author": "kilasuit",
      "author_association": "COLLABORATOR",
      "body": "I do like this idea but don't think this should be an environmental variable but should be instead added as a configurable option (defaulted as on) in the powershell.config.json file as documented at https://docs.microsoft.com/en-us/powershell/module/microsoft.powershell.core/about/about_powershell_config?view=powershell-7.1 \r\n\r\n<blockquote><img src=\"https://docs.microsoft.com/media/logos/logo-powershell-social.png\" width=\"48\" align=\"right\"><div><strong><a href=\"https://docs.microsoft.com/en-us/powershell/module/microsoft.powershell.core/about/about_powershell_config\">about PowerShell Config - PowerShell</a></strong></div><div>Configuration files for PowerShell, replacing Registry configuration.</div></blockquote>\r\n\r\nThis would then tooling like choco/winget/etc to turn it off as part of their installation & tooling like just MSI/MSIX install leave it for those that are coming to PowerShell 7 for the first time",
      "created_at": "2021-06-22T23:58:41Z",
      "updated_at": "2021-06-23T00:35:32Z"
    },
    {
      "author": "warrenrumak",
      "author_association": "NONE",
      "body": "I'm generally in favour of this but the question must be asked -- without any kind of heading, how would a user know whether they're in the CMD or PowerShell environment?  (The existence of a space between the > and the cursor is not a satisfactory answer.)",
      "created_at": "2021-06-23T01:01:00Z",
      "updated_at": "2021-06-23T01:01:00Z"
    },
    {
      "author": "terrajobst",
      "author_association": "NONE",
      "body": "I don’t believe this to be a general concern as virtually all places show this information contextually (title bar, tab icon etc). In the rare cases where a user might not know, entering commands will make it quite obvious. ",
      "created_at": "2021-06-23T01:12:49Z",
      "updated_at": "2021-06-23T01:12:49Z"
    },
    {
      "author": "rkeithhill",
      "author_association": "COLLABORATOR",
      "body": "I'm not a big fan of all the text but it's not completely without precedent:\r\n```\r\n2> python\r\nPython 2.7.9 (default, Dec 10 2014, 12:28:03) [MSC v.1500 64 bit (AMD64)] on win32\r\nType \"help\", \"copyright\", \"credits\" or \"license\" for more information.\r\n>>>\r\n```\r\nAt least the above is only two lines of extra text.  :-)  I wouldn't mind seeing just:\r\n```\r\nPowerShell 7.1.3\r\nPS C:\\Users\\hillr> \r\n```\r\nOr if your legal team **absolutely requires** the copyright:\r\n```\r\nPowerShell 7.1.3 - Copyright (c) Microsoft Corporation\r\nPS C:\\Users\\hillr>\r\n```",
      "created_at": "2021-06-23T01:21:06Z",
      "updated_at": "2021-06-23T01:21:47Z"
    },
    {
      "author": "rkeithhill",
      "author_association": "COLLABORATOR",
      "body": "Argh GH!!  There is some keyboard shortcut I keep hitting that presses the `Close with comment` button.  Sorry guys. ",
      "created_at": "2021-06-23T01:23:08Z",
      "updated_at": "2021-06-23T01:23:08Z"
    },
    {
      "author": "Nirmal4G",
      "author_association": "NONE",
      "body": "Maybe, if there's a way to check the launch context of the console, we could detect whether it's lauched by the user (_interactive_) or via script (_non-interactive_).\r\n\r\nThis way we can display the header for the first-time the user launches the console and have a setting that suppress the header afterwards, while suppressing the header in the context of a script launch.",
      "created_at": "2021-06-23T01:27:51Z",
      "updated_at": "2021-06-23T12:22:26Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "More than once we have received requests to change default options. We already have several new environment variables (update notifications, telemetry). This is a good way, we just have to be more consistent to have support for these options in all kind of configurations (environment variables, config files, Registry)",
      "created_at": "2021-06-23T03:19:19Z",
      "updated_at": "2021-06-23T03:19:19Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "I think having some cmdlets making it easy to configure powershell.config.json might be the way to do this (since this file is already being read at startup).  I'd hate to add more env vars.",
      "created_at": "2021-06-23T03:51:49Z",
      "updated_at": "2021-06-23T03:51:49Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "> I'd hate to add more env vars.\r\n\r\nWe need to have a consistency with environment variables, config files, Registry. In Enterprise it is better use GPO and Registry and it is huge headache to use config files. In DevOps it is better to use environment variables, In personal environment it is better to use config files. ",
      "created_at": "2021-06-23T04:35:44Z",
      "updated_at": "2021-06-23T04:35:44Z"
    },
    {
      "author": "JustinGrote",
      "author_association": "CONTRIBUTOR",
      "body": "> I think having some cmdlets making it easy to configure powershell.config.json might be the way to do this (since this file is already being read at startup).  I'd hate to add more env vars.\n\nWould there be a userspace way to do this? Pretty sure that's a protected folder. ",
      "created_at": "2021-06-23T07:23:19Z",
      "updated_at": "2021-06-23T07:23:19Z"
    },
    {
      "author": "kilasuit",
      "author_association": "COLLABORATOR",
      "body": "@JustinGrote  - there is as per the doc & below\r\n![image](https://user-images.githubusercontent.com/6355225/123065528-2117ce80-d407-11eb-9a83-3e3c1a049494.png)\r\n",
      "created_at": "2021-06-23T08:41:23Z",
      "updated_at": "2021-06-23T08:41:23Z"
    },
    {
      "author": "dazzknowles",
      "author_association": "NONE",
      "body": "Agree they should be off by default but the one time they are useful is to make the user aware of a new version.",
      "created_at": "2021-06-23T11:45:42Z",
      "updated_at": "2021-06-23T11:45:42Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "You can put `cls` in your user profile :-)",
      "created_at": "2021-06-23T12:08:09Z",
      "updated_at": "2021-06-23T12:08:09Z"
    },
    {
      "author": "SeeminglyScience",
      "author_association": "COLLABORATOR",
      "body": "> You can put `cls` in your user profile :-)\r\n\r\nThat's what I do, but it's worth noting that that is pretty annoying for nested pwsh instances.",
      "created_at": "2021-06-23T12:51:37Z",
      "updated_at": "2021-06-23T12:51:37Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "@iSazonov I agree we have a bit of a mess right now with env vars and config.  As for the registry, the reason we created the config file was to move al config out of the registry.",
      "created_at": "2021-06-23T14:24:46Z",
      "updated_at": "2021-06-23T14:24:46Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "> the reason we created the config file was to move al config out of the registry.\r\n\r\nConfig files are terribly inconvenient for administrators who manage hundreds and thousands of servers and workstations in Enterprises. GPO is more fast and flexible. Especially in a scenario with `-NoLogo` :-)",
      "created_at": "2021-06-23T14:45:58Z",
      "updated_at": "2021-06-23T14:47:06Z"
    },
    {
      "author": "kilasuit",
      "author_association": "COLLABORATOR",
      "body": "@iSazonov you can deploy a config file that you've kept in source control at scale easily enough using GPO already & I'd say that would be cleaner & much more efficent than navigating the GPO UI for the configuration properties",
      "created_at": "2021-06-23T14:57:20Z",
      "updated_at": "2021-06-23T14:57:59Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "> @iSazonov you can deploy a config file that you've kept in source control at scale easily enough using GPO already & I'd say that would be cleaner & much more efficent than navigating the GPO UI for the configuration properties\r\n\r\nThere are undoubtedly many applications that allow you to manage configurations. But I prefer GPOs and sleep well at night instead of getting emergency alerts. :-) I guess I'm not alone in disliking round-the-clock alarms. :-)",
      "created_at": "2021-06-23T15:10:47Z",
      "updated_at": "2021-06-23T15:10:47Z"
    },
    {
      "author": "thedavecarroll",
      "author_association": "NONE",
      "body": "> @iSazonov I agree we have a bit of a mess right now with env vars and config. As for the registry, the reason we created the config file was to move al config out of the registry.\r\n\r\nDoesn't cross-compatibility preclude the use of the registry? Why not just focus on a single method or on those methods available to all supported operating systems, like config files and environment variables?",
      "created_at": "2021-06-23T16:34:09Z",
      "updated_at": "2021-06-23T16:34:09Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "> Doesn't cross-compatibility preclude the use of the registry?\r\n\r\nIf I'm talking about GPOs and Registry, am I talking about Unix? \r\nI'm talking about the fact that I manage an environment of hundreds and thousands of Windows servers and workstations and configuring with GPOs is the most powerful and convenient tool - it works out of the box and I don't need to spend time and money on third party applications. \r\nSince you mentioned cross-compatibility you might want to take a look at Mono's implementation of Registry.  :-)\r\n\r\n",
      "created_at": "2021-06-23T18:12:44Z",
      "updated_at": "2021-06-23T18:12:44Z"
    },
    {
      "author": "kilasuit",
      "author_association": "COLLABORATOR",
      "body": "Still can do so with GPO just get it to use this instead of a painful UI @iSazonov https://www.adamfowlerit.com/2016/07/group-policy-preferences-replace-existing-file/\n\n<blockquote><img src=\"https://i1.wp.com/www.adamfowlerit.com/wp-content/uploads/2016/07/gpp2.png?fit=413%2C462&ssl=1\" width=\"48\" align=\"right\"><div><img src=\"https://i1.wp.com/www.adamfowlerit.com/wp-content/uploads/2016/09/cropped-logo3.png?fit=192%2C192&ssl=1\" height=\"14\"> AdamFowlerIT.com</div><div><strong><a href=\"https://www.adamfowlerit.com/2016/07/group-policy-preferences-replace-existing-file/\">Group Policy Preferences – Replace Existing File</a></strong></div><div>I’ve written before on how great Group Policy Preferences are, and thought I’d write a quick ‘how to’ on a likely common scenario – replacing an older file with a new …</div></blockquote>",
      "created_at": "2021-06-24T11:36:38Z",
      "updated_at": "2021-06-24T11:36:42Z"
    },
    {
      "author": "Rexogamer",
      "author_association": "NONE",
      "body": "> Or if your legal team **absolutely requires** the copyright:\r\n> \r\n> ```\r\n> PowerShell 7.1.3 - Copyright (c) Microsoft Corporation\r\n> PS C:\\Users\\hillr>\r\n> ```\r\nPersonally, I'm a fan of this - seeing the version on start is useful (certainly for preview builds) and the copyright text doesn't feel *that* intrusive, but it cuts down the bloat quite nicely",
      "created_at": "2021-06-24T21:38:55Z",
      "updated_at": "2021-06-24T21:38:55Z"
    },
    {
      "author": "theJasonHelmick",
      "author_association": "CONTRIBUTOR",
      "body": "Hi @terrajobst \r\n\r\nI agree with @bergmeister that your point  around configuration in multiple places is a problem. I had the same initial reaction you described “Why Immo, just change…” - or - “Well, don’t close your shell!” ;) But you raise a very valid point.\r\n\r\nIf we were to take up this issue, which probably wouldn’t happen until after 7.2 LTS release, do you agree with the suggestions below that would reduce the foot print of the logo, and make it possible to turn off in powershell.config.json?\r\n\r\n1. @rkeithhill  - Reduced footprint of logo \r\n```output\r\nPowerShell 7.1.3 - Copyright (c) Microsoft Corporation\r\nPS C:\\Users\\MyName>\r\n```\r\n2. @SteveL-MSFT  - Global setting in powershell.config.json\r\n\r\nWhat does everyone think?\r\n",
      "created_at": "2021-07-12T16:09:49Z",
      "updated_at": "2021-07-12T16:09:49Z"
    },
    {
      "author": "terrajobst",
      "author_association": "NONE",
      "body": "> powershell.config.json\r\n\r\nWhere does this file live? Is this file for a specific version of PowerShell (i.e. do I have to re-apply when I move to 7.3 for example)? Does it roam across machines? Assuming it's a roaming file and it's applicable to all PowerShell sessions irrespective of the command line that started it, that would work for me.\r\n\r\n> do you agree with the suggestions below that would reduce the foot print of the logo\r\n\r\nAt least for me any logo, even the reduced one is noise that I'd like to turn off. Since I'll turn it of no matter what the reduction won't do much for me.",
      "created_at": "2021-07-12T16:24:27Z",
      "updated_at": "2021-07-12T16:24:27Z"
    },
    {
      "author": "theJasonHelmick",
      "author_association": "CONTRIBUTOR",
      "body": "@terrajobst Get-Help about_powershell_config has this information, including the location of the file in $PSHOME - and I think would help in most situations.",
      "created_at": "2021-07-12T19:00:21Z",
      "updated_at": "2021-07-12T19:00:21Z"
    },
    {
      "author": "terrajobst",
      "author_association": "NONE",
      "body": "> A powershell.config.json file in the $PSHOME directory defines the configuration for all PowerShell Core sessions running from that PowerShell Core installation.\r\n\r\nThat's not inspiring confidence as that means I need to babysit this for every new version on every machine. In that case I'd say no, this doesn't solve the scenario for the same reason the existing command line switch doesn't.",
      "created_at": "2021-07-12T19:12:36Z",
      "updated_at": "2021-07-12T19:13:15Z"
    },
    {
      "author": "SeeminglyScience",
      "author_association": "COLLABORATOR",
      "body": "There's also a user scoped location in `SpecialFolders.Personal + \"\\PowerShell\"` on Windows.  That one is more what you're looking for.",
      "created_at": "2021-07-12T19:41:14Z",
      "updated_at": "2021-07-12T19:41:14Z"
    },
    {
      "author": "kilasuit",
      "author_association": "COLLABORATOR",
      "body": "@terrajobst I just raised an issue that should help to combat this ` I need to babysit this for every new version on every machine` for the file that is stored in the install directory & I think right now in-place upgrades may override it.\r\n\r\nregarding your other questions\r\n>Where does this file live? \r\n\r\nin many places, including in the install directory by default or you can also have one in your user directory as per the doc linked above\r\n\r\n> Is this file for a specific version of PowerShell (i.e. do I have to re-apply when I move to 7.3 for example)? \r\n\r\nTechnically yes, though more for installation method than version (other than stable/preview)\r\nI think you may need to currently reapply on upgrade installs, only in the install location (All Users) however I don't want that either in future as this file could potentially have some settings applied using GPO's & raised #15796 for this.\r\n\r\n> Does it roam across machines? \r\n\r\nIf you place your settings in a `powershell.config.json` file within your user profile then yes it would if you use a roaming profile\r\n\r\n> Assuming it's a roaming file and it's applicable to all PowerShell sessions irrespective of the command line that started it, that would work for me.\r\n\r\nIf you make use of the user profile location for your required settings this should then apply to all versions of both `pwsh` & `pwsh-preview` regardless of install method MSI / MSIX / ZIP / MS Store / dotnet global tool / etc\r\nor at least that is how I understand it to be & **should** meet your needs.",
      "created_at": "2021-07-19T20:24:11Z",
      "updated_at": "2021-07-19T20:24:11Z"
    },
    {
      "author": "theJasonHelmick",
      "author_association": "CONTRIBUTOR",
      "body": "I'll add to the conversation that we are checking with legal to see if we could trim the logo to something similar to:\r\n```output\r\nPowerShell 7.2\r\nPS>\r\n```\r\n\r\n@kilasuit outlined some good points.  I think if we could agree on adding a setting to powershell.config.json to completely suppress the logo, maybe someone has thoughts on tooling (cmdlet support) to discover and manage those settings without directly editing the json.\r\n",
      "created_at": "2021-07-29T15:35:13Z",
      "updated_at": "2021-07-29T15:35:13Z"
    },
    {
      "author": "JustinGrote",
      "author_association": "CONTRIBUTOR",
      "body": "@theJasonHelmick as long as the setting can be done in userspace if the pwsh exe is system installed I'm cool with that. Some past stuff of the pwsh.exe.config could only be done if you had admin rights to the box or used a separate instance.",
      "created_at": "2021-07-29T15:54:12Z",
      "updated_at": "2021-07-29T15:54:55Z"
    },
    {
      "author": "dancojocaru2000",
      "author_association": "NONE",
      "body": "I would really like this in order to replace the default banner with a custom one.",
      "created_at": "2021-08-05T14:30:08Z",
      "updated_at": "2021-08-05T14:30:08Z"
    },
    {
      "author": "m1karii",
      "author_association": "NONE",
      "body": "> maybe someone has thoughts on tooling (cmdlet support) to discover and manage those settings without directly editing the json.\r\n\r\nYeah. I'd prefer being able to change this setting from within the shell itself.\r\n",
      "created_at": "2021-08-21T12:50:45Z",
      "updated_at": "2021-08-21T12:50:45Z"
    },
    {
      "author": "theJasonHelmick",
      "author_association": "CONTRIBUTOR",
      "body": "***Updated*** \r\nI'm looking at a minimum viable for this enhancement to get us started on improving the display of the logo, and including a machine wide configuration to enable/disable the display of the logo. \r\n\r\nTo move forward, here’s what I’m thinking:\r\n\r\n* New minimal terminal logo similar too:\r\n```powershell\r\nPowerShell 7.1.3 \r\nPS C:\\Users\\MyName>\r\n```\r\n* Add additional configuration setting to `powershell.config.json` in **$PSHome** following the same system wide and current user options discussed in `About_PowerShell_Config`.\r\n* Perhaps something like:  “PowershellTeminalLogo”:  “True”\r\n\r\nMy focus is the tooling support that I think is necessary for the initial implementation. The reason is, I think we can address multi-machine configuration issues that  @terrajobst  experiences  other than with GPO. Many machines are not domain joined or running linux. Tooling support should work over remoting, allowing multi-machine configuration. One question i'm investigating is:\r\n\r\n* PowerShell upgrades should not overwrite the configuration, maintaining desired configuration after upgrade.\r\n\r\nHere is an idea for cmdlet tooling - thoughts?\r\n\r\n```powershell\r\nGet-PowerShellConfigurationSetting\r\n# Lists all settings\r\nGet-PowerShellConfigurationSetting -Name “PowerShellTerminalLogo”\r\n# List only the specified setting\r\nSet-PowershellConfigurationSetting -Name “PowerShellTerminalLogo -Value True\r\n# Sets the setting value\r\nGet-PowerShellConfigurationSetting -Name “PowerShellTerminalLogo” | Set-PowerShellConfiguratinSetting -Value True\r\n```",
      "created_at": "2021-09-22T16:01:45Z",
      "updated_at": "2021-09-30T18:03:52Z"
    },
    {
      "author": "blowdart",
      "author_association": "NONE",
      "body": "If nologo tends towards the default I'd suggest (and want for myself) a slightly different nologo. The \"problem\" I have with nologo is it suppresses the update available message. Given that the update may be a security update I'd like to have a -nologoexceptforupdates (yes, msft employees are bad at naming) option which suppresses startup messages _except_ for the update message. ",
      "created_at": "2021-11-11T13:11:13Z",
      "updated_at": "2021-11-11T13:11:13Z"
    },
    {
      "author": "kilasuit",
      "author_association": "COLLABORATOR",
      "body": "@blowdart I agree though perhaps `-updatelogoonly` or just simply `-updatelogo` is a better name for this",
      "created_at": "2021-11-11T14:37:58Z",
      "updated_at": "2021-11-11T14:37:58Z"
    },
    {
      "author": "blowdart",
      "author_association": "NONE",
      "body": "This is why no one lets me name things 😀",
      "created_at": "2021-11-11T16:24:24Z",
      "updated_at": "2021-11-11T16:24:24Z"
    },
    {
      "author": "rkeithhill",
      "author_association": "COLLABORATOR",
      "body": "> the \"problem\" I have with nologo is it suppresses the update available message\r\n\r\nThis is why I don't think `-nologo` should be the default.  I want a \"reduced\" logo  that is the default.  There is still a place for `-nologo`.  Also, the PS update notification in the prompt already has a separate mechanism to control it -  `$env:POWERSHELL_UPDATECHECK`.\r\n\r\nSo for `-nologo`, I want it to behave exactly like it does today. \r\n```\r\nPS C:\\Users\\hillr>\r\n```\r\nI'd prefer to see a \"default\" startup experience like this:\r\n```\r\nPowerShell 7.3.0\r\nPS C:\\Users\\Keith>\r\n```\r\nAnd for the default / \"reduced\" logo, if there happens to be a PS update available AND I have not disabled the update check, I would expect to see this\r\n```\r\nPowerShell 7.3.0\r\n\r\n   A new PowerShell stable release is available: v7.3.1\r\n   Upgrade now, or check out the release page at:\r\n     https://aka.ms/PowerShell-Release?tag=v7.3.1\r\n\r\nPS C:\\Users\\hillr> \r\n```\r\n\r\nThat leaves just the \"where/how to get help\" text: \r\n```\r\nhttps://aka.ms/powershell\r\nType 'help' to get help.\r\n```\r\nWhich is great for the **first time** user but this text quickly becomes extra noise on every session start.  Noise because you have trained me with the rolled up newspaper, er this text over hundreds and hundreds of new PS session starts.  I really, I mean REALLY don't need to see it anymore.  😜   At the very least, just put the `https://aka.ms/powershell` link in the help topic for `help`.  You could then simplify to:\r\n```\r\nPowerShell 7.3.0 (type 'help' to get help)\r\nPS /home/hillr>\r\n```\r\nThat is **if** the team deems it necessary to always display info on how to get help.  \r\n\r\nOne last comment - I'm not a fan of any of this requiring powershell.config.json changes.  The reduced logo should be the default. No \"additional\" configuration (beyond the existing update check env var) should be required.",
      "created_at": "2021-11-18T18:45:27Z",
      "updated_at": "2021-11-18T18:48:02Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "\r\n1. In future we will have pwsh in box so we should have consistency with cmd.exe and Windows PowerShell.\r\n2. Did anybody ask to remove Python logo? 😄 @terrajobst you use Python in .Net repository, did you request them too? Link?\r\n3. We support side-by-side and global tool. So it is important to see what current pwsh distribution/version is. I think it makes sense to have _specific logo for every kind of pwsh_ - personal(application)-wide, system-wide, global tool - not only version. We never discussed this.\r\nEx., VS Code run pwsh - system-wide, installed with VS Code, from my profile? can I have specific config for the scenario? Or whether  I run pwsh from Global tool and with specific config? Should we support host specific configs again?\r\n4. Add more options to configs/envs is bad idea. It is difficult to discover and difficult to replicate. Users can put `cls` to user profile. On Windows the profile can be synced with OneDrive.\r\n5. We want to keep update notification.\r\n\r\n\r\nWe need PowerShell Committee conclusion before change something, if change.\r\n",
      "created_at": "2021-11-25T08:02:35Z",
      "updated_at": "2021-11-25T08:02:35Z"
    },
    {
      "author": "rkeithhill",
      "author_association": "COLLABORATOR",
      "body": "> have specific logo for every kind of pwsh\r\n\r\n🤔 I'm not sure this user would like that, but I think it would be useful info to have in `$PSVersionTable` - particularly for support scenarios.  IOW I don't think users in general should care about which one they're using but if they run into trouble and we're trying to help them, it would be good if they could easily tell us (report in an issue) which kind of install of PowerShell they have.",
      "created_at": "2021-11-25T19:15:36Z",
      "updated_at": "2021-11-25T19:15:36Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": ">  I'm not sure this user would like that, \r\n\r\nFollow looks bad?\r\n```\r\nPowerShell 7.3.0 (Global tool)\r\nPS C:\\Users\\Keith>\r\n```\r\n```\r\nPowerShell 7.3.0 (System Wide)\r\nPS C:\\Users\\Keith>\r\n```",
      "created_at": "2021-11-26T03:13:29Z",
      "updated_at": "2021-11-26T03:13:29Z"
    },
    {
      "author": "rkeithhill",
      "author_association": "COLLABORATOR",
      "body": "It's not that it \"looks bad\".  The concern is whether it would cause confusion to users who don't know or care what System Wide vs Global tool even means.  \r\n\r\nThat said, if we went the Python route and displayed multiple attributes in parens then it might not be as confusing i.e. I think the more \"info\" in the parens, the more likely folks will TL;DR. 😄   For example:\r\n\r\n```\r\nPowerShell 7.3.0 (system, x64, Jun 7 2022, type 'help' to get help)\r\nPS C:\\Users\\Keith>\r\n```\r\nAnd there's also the issue of what other values are there besides `system` and `global tool`?  `snap`, `store`, ??",
      "created_at": "2021-11-26T18:48:14Z",
      "updated_at": "2021-11-26T18:53:40Z"
    },
    {
      "author": "kilasuit",
      "author_association": "COLLABORATOR",
      "body": "I semi like that @iSazonov but also agree with @rkeithhill that info should also be in `$PSVersionTable`",
      "created_at": "2021-11-26T20:02:09Z",
      "updated_at": "2021-11-26T20:02:09Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "> The concern is whether it would cause confusion to users who don't know or care what System Wide vs Global tool even means.\r\n\r\nThere is an important conception - PowerShell host. Every PS host can have custom config. I think this is important to point out whether an user understands these concepts or not.\r\n\r\n> And there's also the issue of what other values are there besides `system` and `global tool`? `snap`, `store`, ??\r\n\r\nLogon shell on Unix.\r\n\r\n> that info should _also_ be in $PSVersionTable\r\n\r\nAlso. :-)",
      "created_at": "2021-11-27T17:45:09Z",
      "updated_at": "2021-11-27T17:47:18Z"
    },
    {
      "author": "rkeithhill",
      "author_association": "COLLABORATOR",
      "body": "> Every PS host can have custom config\r\n\r\n@iSazonov  Do you really mean `host` or are you referring to different types of PS installation?  Because different hosts can pick their own startup banners - like PSES does in Visual Studio Code:\r\n\r\n![image](https://user-images.githubusercontent.com/5177512/143792052-3327d585-1644-497b-8ddb-59b78ee2098f.png)\r\n\r\nAbout twelve years ago, I wrote a `Make-PS1ExeWrapper.ps1` script that created a PS host to run a script extracted from an embedded resource in the compiled exe.  That host, for obvious reasons, did not print any startup banner.\r\n",
      "created_at": "2021-11-29T00:25:44Z",
      "updated_at": "2021-11-29T00:25:44Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "> Do you really mean host or are you referring to different types of PS installation?\r\n\r\nI generalize. I think it is useful to see which pwsh is actually running - in logs, in traces, in a remote session and in the console too. It doesn't make sense to distinguish between host apps for system-wide and user-wide installations, but for global tools it does.\r\n",
      "created_at": "2021-11-29T02:54:33Z",
      "updated_at": "2021-11-29T02:54:33Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "@PowerShell/powershell-committee discussed this.  We looked at other shells like `zsh`, `csh`, `bash` and each of them simply show a prompt without additional information as the user explicitly started those shells and should know what they are using.  We agreed to have the default not show any logo information.  However, upgrade information will still be shown unless suppressed by existing means.  A new `-Logo` switch will be added to retain current behavior (or just `PowerShell <version>`).  Waiting on legal and marketing approval before finalizing.  We would have this as an Experimental feature pending user feedback.",
      "created_at": "2021-12-02T15:25:19Z",
      "updated_at": "2021-12-02T15:26:31Z"
    },
    {
      "author": "daxian-dbw",
      "author_association": "MEMBER",
      "body": "@SteveL-MSFT I think having `version` information at startup is useful, especially given that many users uses both stable and preview versions of PowerShell at the same time.",
      "created_at": "2021-12-08T02:46:32Z",
      "updated_at": "2021-12-08T02:46:32Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "@daxian-dbw perhaps preview version should default to `-logo` with simplified `PowerShell <version>`?",
      "created_at": "2021-12-08T04:39:12Z",
      "updated_at": "2021-12-08T04:39:12Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "> @SteveL-MSFT I think having `version` information at startup is useful, especially given that many users uses both stable and preview versions of PowerShell at the same time.\r\n\r\nIt is true for global tools, VS Code and others.\r\nMoreover, we will most likely be asked to implement a separate configuration for such scenarios, host applications.\r\nPerhaps they (every) should be specific host application and this will be the correct answer to this issue?",
      "created_at": "2021-12-08T16:04:45Z",
      "updated_at": "2021-12-08T16:04:45Z"
    },
    {
      "author": "daxian-dbw",
      "author_association": "MEMBER",
      "body": "I think both stable and preview PowerShell should keep `PowerShell <version>`. Some users may need to keep both an LTS and a latest stable version at the same time.",
      "created_at": "2021-12-08T18:35:11Z",
      "updated_at": "2021-12-08T18:36:29Z"
    },
    {
      "author": "dancojocaru2000",
      "author_association": "NONE",
      "body": "Looking through this issue, I'm not sure if this is considered: is there a way for the user to change the \"logo\" in the same way the prompt can be changed?\r\n\r\n`fish`, for example, allows the user to define a `fish_greeting` function. If that function exists, `fish` doesn't output anything anymore, and instead calls the function, and the function should output the greeting.\r\n\r\nIf such a feature would be implemented in PowerShell, disabling the logo would be as simple as defining an empty function.",
      "created_at": "2021-12-08T19:07:01Z",
      "updated_at": "2021-12-08T19:07:01Z"
    },
    {
      "author": "JustinGrote",
      "author_association": "CONTRIBUTOR",
      "body": "@dancojocaru2000 a problem with that approach is currently the logo is emitted well before the runspace is available to keep the appearance of being \"snappy\", it might feel sluggish if implemented that way.",
      "created_at": "2021-12-08T21:57:07Z",
      "updated_at": "2021-12-08T21:57:07Z"
    },
    {
      "author": "dancojocaru2000",
      "author_association": "NONE",
      "body": "@JustinGrote The only thing a user wants to do upon starting PowerShell is run a command (since PowerShell is a shell), which a user cannot do until the runspace is available. As such, how quick the first text appears is rather irrelevant, considering the prompt or the characters typed don't appear.\r\n\r\nEdit: Also, I think people who want to use a shell are knowledgeable enough to not need deception about how quickly the shell loads.\r\n\r\nCurrently, PowerShell prints \"Loading personal and system profiles took 532ms.\", so it's also in plain sight that it takes half a second for PowerShell to be ready. This \"snappy\" appearance is just essentially either deception or a simpler loading screen, and I think neither is needed for someone who knows how to work with a shell.\r\n\r\nEdit 2: If this default is still desired (a default which I consider an insult to the user, but it's probably just my uninformed opinion), then perhaps a switch that toggles from \"print logo then load runspace\" to \"load runspace then run Logo function\" would be the best way to please everyone? The default would still be there, and anyone not pleased with it can switch to having a custom function that prints just what they please.\r\n\r\nThat \"switch\" I'm talking about should be something that can be toggled once and saved forever, perhaps in a configuration file.",
      "created_at": "2021-12-08T22:00:13Z",
      "updated_at": "2021-12-08T22:09:32Z"
    },
    {
      "author": "brwilkinson",
      "author_association": "NONE",
      "body": "commenting to follow... \r\n\r\nAlso, this is what I always configure in all of my shortcuts \r\n- nologo on startup argument\r\n- profile has some message of what ps version I am in and which profile loaded.\r\n\r\n### pwsh\r\n![image](https://user-images.githubusercontent.com/3605266/145306195-094a48d8-ff9a-49d6-865d-a78d45693485.png)\r\n\r\n### powershell\r\n- I assume I will still need this customization, since this thread is just for pwsh\r\n\r\n![image](https://user-images.githubusercontent.com/3605266/145306245-5d2c03d6-a3d3-48c2-912e-c09a9bdc2be1.png)\r\n\r\n#### Terminal configuration\r\n\r\n![image](https://user-images.githubusercontent.com/3605266/145306276-59cc9d60-6f06-4584-a16f-7ae90e558e59.png)\r\n\r\n#### vscode configuration\r\n\r\n![image](https://user-images.githubusercontent.com/3605266/145306387-44ea49d4-b55f-43c5-98b3-50a575a23ca0.png)\r\n\r\nSo if i can achieve this with less custom settings, I would be fine with that change.",
      "created_at": "2021-12-08T23:21:59Z",
      "updated_at": "2021-12-08T23:21:59Z"
    },
    {
      "author": "rkeithhill",
      "author_association": "COLLABORATOR",
      "body": "> a problem with that approach is currently the logo is emitted well before the runspace is available to keep the appearance of being \"snappy\", it might feel sluggish if implemented that way.\r\n\r\nI agree. I have my Windows Terminal profile for PWSH set to use `-nologo` and my profile takes about 2-3 seconds to load.  It is a bit disconcerting to see a blank console for that long.",
      "created_at": "2021-12-09T03:18:21Z",
      "updated_at": "2021-12-09T03:18:21Z"
    },
    {
      "author": "rkitover",
      "author_association": "CONTRIBUTOR",
      "body": "I had an idea, we already have `$env:POWERSHELL_UPDATECHECK`, we could also add `$env:POWERSHELL_LOGO` or perhaps `$env:POWERSHELL_SILENT` for both or some such.",
      "created_at": "2021-12-19T22:22:38Z",
      "updated_at": "2021-12-19T22:22:38Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "@PowerShell/powershell-committee discussed this again and we agreed to default to:\r\n\r\n```\r\nPowerShell <version>\r\n```\r\n\r\nFor the startup logo.  `-Nologo` retains its current behavior.  In the case of preview, we would expect:\r\n\r\n```\r\nPowerShell 7.3-preview.2\r\n```\r\n\r\nas an example. ",
      "created_at": "2022-01-05T23:17:01Z",
      "updated_at": "2022-01-05T23:17:01Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "@SteveL-MSFT Did you discuss https://github.com/PowerShell/PowerShell/issues/15644#issuecomment-981244436?\r\nIt seems we need to take back ShellId in Engine (see DefaultPowerShellShellID in code).",
      "created_at": "2022-01-06T05:13:13Z",
      "updated_at": "2022-01-06T05:13:13Z"
    },
    {
      "author": "kilasuit",
      "author_association": "COLLABORATOR",
      "body": "I've been thinking that on first ever execution of pwsh (inc new versions) the current logo (or any updates per version inc a link to the changelog) should be ok, but every other execution the slim one as per @SteveL-MSFT comment above would be desirable\r\n\r\nany thoughts on that as an approach?\r\n",
      "created_at": "2022-01-06T19:54:22Z",
      "updated_at": "2022-01-06T19:54:22Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "> any thoughts on that as an approach?\r\n\r\nThis is always easy to do on Windows using Registry but the PowerShell team prefers config file and this causes unreasonable startup delay.",
      "created_at": "2022-01-07T05:54:30Z",
      "updated_at": "2022-01-07T05:54:30Z"
    },
    {
      "author": "kilasuit",
      "author_association": "COLLABORATOR",
      "body": "This was closed by #16516 incase anyone reading thought it had just been closed and not actually fixed ",
      "created_at": "2022-01-11T14:55:16Z",
      "updated_at": "2022-04-04T22:30:35Z"
    },
    {
      "author": "dancojocaru2000",
      "author_association": "NONE",
      "body": "Well, it wasn't exactly fixed. The logo is smaller, but still there. \r\n\r\nI'm not sure yet if there is an option to disable the logo when passing command line arguments is not possible.",
      "created_at": "2022-01-11T15:21:05Z",
      "updated_at": "2022-01-11T15:21:05Z"
    },
    {
      "author": "terrajobst",
      "author_association": "NONE",
      "body": "Agreed. Until there is a user wide setting to disable the logo entirely I personally don’t think my issue was addressed. ",
      "created_at": "2022-01-11T19:01:31Z",
      "updated_at": "2022-01-11T19:01:31Z"
    },
    {
      "author": "rkitover",
      "author_association": "CONTRIBUTOR",
      "body": "What about my idea of having an environment variable for this? \r\n\r\nThere is already `$env:POWERSHELL_UPDATECHECK` which is definitely nice to have.\r\n\r\nMaybe we don't want to have 20 environment variables, and maybe we don't want to have `$env:POWERSHELL_OPTIONS` for security reasons, but this seems like a good solution for this particular problem.\r\n\r\nOn Linux this would allow putting this environment variable in pam or systemd environment definitions and use pwsh as a login shell with no options and no startup banner.\r\n\r\nOn Windows it would allow setting one machine env var and not have to tweak a bunch of different things to pass `-nologo`.",
      "created_at": "2022-01-12T21:31:16Z",
      "updated_at": "2022-01-12T21:31:16Z"
    },
    {
      "author": "kilasuit",
      "author_association": "COLLABORATOR",
      "body": "@dancojocaru2000 / @terrajobst - I didn't say I agreed with the close resolution (as I don't) but thoufht it worth mentioning incase it was lost in the midst\r\n\r\n@rkitover - whilst env vars can work, personally I dislike them and I'd like to see them and [this implemented too](https://github.com/PowerShell/PowerShell/issues/15796)",
      "created_at": "2022-01-13T14:34:49Z",
      "updated_at": "2022-01-13T14:35:41Z"
    },
    {
      "author": "m1karii",
      "author_association": "NONE",
      "body": "@rkitover agreed. At least something like `$env:POWERSHELL_DISPLAYLOGO` would be nice, if nothing else.",
      "created_at": "2022-01-16T15:00:46Z",
      "updated_at": "2022-01-16T15:00:46Z"
    }
  ],
  "created_at": "2021-06-22T23:32:07Z",
  "labels": [
    "WG-Interactive-Console",
    "Issue-Discussion",
    "Resolution-Fixed",
    "Committee-Reviewed"
  ],
  "number": 15644,
  "state": "closed",
  "title": "`-nologo` should be the default",
  "updated_at": "2022-04-04T22:30:35Z"
}