{
  "_url": "https://github.com/PowerShell/PowerShell/issues/15652",
  "author": "MartinGC94",
  "body": "## Summary of the new feature/enhancement\r\nTab-completing commands while in a slow provider (VMware datastore, SCCM, etc.) is painfully slow.\r\n\r\nDemonstration:\r\n\r\n```\r\ncd C:\\\r\nMeasure-Command -Expression {TabExpansion2 -inputScript Get-ChildItem -cursorColumn 1}\r\nDays              : 0\r\nHours             : 0\r\nMinutes           : 0\r\nSeconds           : 0\r\nMilliseconds      : 35\r\n\r\ncd vmstores:\\vcenter01@443\\test\\datastore01\r\nMeasure-Command -Expression {TabExpansion2 -inputScript Get-ChildItem -cursorColumn 1}\r\nDays              : 0\r\nHours             : 0\r\nMinutes           : 0\r\nSeconds           : 8\r\nMilliseconds      : 254\r\n```\r\nI think this is because it looks for commands to execute in the current path, which makes sense on a filesystem with commands like ping.exe but not in many/any other providers. For example even if you cd into the Function provider and try to tab complete a function you will get something like `.\\prompt` which isn't even a valid command.\r\n\r\n\r\n## Proposed technical implementation details (optional)\r\nThere are a few options:\r\n\r\n- Don't look for commands in the current path if the current path isn't from a filesystem provider.\r\n- Don't look for commands in the current path unless the user has typed in something that looks like a path like .\\\r\n- Add either an opt-in or opt-out system for providers so they can control this behavior.",
  "closed_at": null,
  "comments": [
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "I remember I did a proposal to add new attribute to mark parameters where it make sense to fallback to FileSystem provider. This could resolve issue. And I believe it would be acceptable breaking change.",
      "created_at": "2021-06-24T03:29:43Z",
      "updated_at": "2021-06-24T03:29:43Z"
    },
    {
      "author": "MartinGC94",
      "author_association": "CONTRIBUTOR",
      "body": "That's a different (but highly desirable feature). What I'm talking about is tab-completing commands, not their parameters or parameter values. If you CD into a slow location you don't get a noticeable slowdown when tab completing parameters or parameter values (unless they have to fall back to path completion).",
      "created_at": "2021-06-24T06:15:33Z",
      "updated_at": "2021-06-24T06:15:33Z"
    }
  ],
  "created_at": "2021-06-23T20:48:54Z",
  "number": 15652,
  "state": "open",
  "title": "Command tab completion should not look for commands in current path if not in FileSystem provider",
  "updated_at": "2021-06-24T06:15:33Z"
}