{
  "_url": "https://github.com/PowerShell/PowerShell/issues/15666",
  "author": "SteveL-MSFT",
  "body": "## Summary of the new feature/enhancement\r\n\r\nSimilar to how Chrome and VSCode have a self-updating feature that informs the user a new version is available and that a restart will run the new version, we should have something similar for pwsh.  Some things we need to work through:\r\n\r\n- Is this a new package or something that could/should be supported by our existing packages? (MSI, Snap, zip, etc...) Sandboxed packages like Snap and msix wouldn't be self-updating, but they already have their own updating model.\r\n- What about LTS, stable, and preview channel support?\r\n- From a size perspective, we would need to lay down a side-by-side copy of PS7 and perhaps just update symlinks, but would there be a concern about disk usage?\r\n- Need to think about configuration so user can opt-out.\r\n- Also need to consider which remote source is being used and how that impacts enterprises which have restrictions on remote network locations that are allowed.\r\n- Presumably, this is built into the Console host.",
  "closed_at": null,
  "comments": [
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": ">  we should have something similar for pwsh\r\n\r\nWhy for? Who will be the consumer? Are there really so many that a special update channel is required?\r\nUsually you say that this should be a separate community project. :-)\r\n\r\n> What about LTS, stable, and preview channel support?\r\n\r\nIn general it doesn't matter. This is the concern of the update service.\r\n\r\n> Presumably, this is built into the Console host.\r\n\r\nLet's look how other applications do (on Windows):\r\n1. Need specific update service with installer elevated permissions and permissions to download new version.\r\n2. Need schedule tasks to trigger checks, notifications and install/update/upgrade\r\n3. Application it self trigger p.2.\r\n\r\nIf an application has not the elevated update service the update process will ask user to elevate.\r\n\r\n> Presumably, this is built into the Console host.\r\n\r\nI hope this doesn't happen in pwsh itself. There are already many means for updating applications. Now also winget. It is their task to implement the required update model.\r\n\r\nThis can most likely only be implemented on the basis of links and my main concern is that it is completely incompatible with WindowsUpdate.",
      "created_at": "2021-06-25T03:12:57Z",
      "updated_at": "2021-06-25T03:12:57Z"
    },
    {
      "author": "WSLUser",
      "author_association": "NONE",
      "body": "Bash updates itself through a package manager.  You could have multiple terminal panes/tabs/windows using the same host and the other bash sessions will continue working while the updates continue. and either require sourcing bash or restarting the host. Pwsh could do similar but I'm presuming this request is to help users of WinGet more than users on other systems. Not sure this approach will work as well on Windows. I'd use Chocolately as example in this case as it updates choco as it's utilizing choco. ",
      "created_at": "2021-07-06T18:14:28Z",
      "updated_at": "2021-07-06T18:15:52Z"
    },
    {
      "author": "theJasonHelmick",
      "author_association": "CONTRIBUTOR",
      "body": "@iSazonov - I see your point about the various update channels. I think having a notification and upgrade within PowerShell would serve linux customers already accustomed to the experience - and it gives an additional option to Windows users.  ",
      "created_at": "2021-07-29T15:46:04Z",
      "updated_at": "2021-07-29T15:46:04Z"
    },
    {
      "author": "Almagnus1",
      "author_association": "NONE",
      "body": "IMO a command like update-powershell would do wonders for usability.",
      "created_at": "2021-08-21T02:57:57Z",
      "updated_at": "2021-08-21T02:57:57Z"
    }
  ],
  "created_at": "2021-06-24T23:14:28Z",
  "labels": [
    "Issue-Enhancement",
    "WG-Interactive-Console",
    "Needs-Triage"
  ],
  "number": 15666,
  "state": "open",
  "title": "Support self-updating pwsh",
  "updated_at": "2021-08-21T02:57:58Z"
}