{
  "_url": "https://github.com/PowerShell/PowerShell/issues/15929",
  "author": "matcha1024",
  "body": "### Summary of the new feature / enhancement\n\nin cmd, we can execute a file path that contains spaces.  \r\nFor example, `'C:\\Program Files\\Java\\jdk-16.0.2\\bin\\java.exe' -version`  \r\nbut in powershell, can't this.  \r\nTo do this you will need to do something like this. `&\"C:\\Program Files\\Java\\jdk-16.0.2\\bin\\java.exe\" -version`  \r\nI think that PowerShell should be able to type the same commands as CMD.\n\n### Proposed technical implementation details (optional)\n\nWhen the file path to be executed is enclosed in quotation marks, `&` is automatically added internally.",
  "closed_at": null,
  "comments": [
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "This would be a rather large breaking change, and would prevent users from outputting strings that happen to contain paths from a function.\r\n\r\nI very much doubt this would ever be an acceptable change.",
      "created_at": "2021-08-14T18:59:25Z",
      "updated_at": "2021-08-14T18:59:25Z"
    },
    {
      "author": "BrucePay",
      "author_association": "COLLABORATOR",
      "body": "Yeah - this would be a really  big breaking change. PowerShell is an expression oriented language. A literal value (string, number or whatever) is simply echoed to the output. If you want to execute an arbitrary value, then you must prefix it with '&' (the call operator). This addresses a variety of scenarios: executing entities having invalid characters in their names,  scripblocks, commandinfos,  and module specific command names.  Remote contexts where considered but never, unfortunately, implemented. Changing the requirement for '&' is unlikely however there may at be things we can do from a  pedagogical perspective that would help (new) users.",
      "created_at": "2021-08-15T06:28:32Z",
      "updated_at": "2021-08-15T06:28:32Z"
    }
  ],
  "created_at": "2021-08-14T10:36:55Z",
  "labels": [
    "Issue-Enhancement",
    "WG-Language",
    "Needs-Triage"
  ],
  "number": 15929,
  "state": "open",
  "title": "Execute a file path that contains spaces",
  "updated_at": "2021-08-15T07:00:58Z"
}