{
  "_url": "https://github.com/PowerShell/PowerShell/issues/15952",
  "author": "chrisbachmann",
  "body": "### Summary of the new feature / enhancement\n\nWe are working on a script that installs the Ubuntu distro for WSL. While the appx is downloading, another intune process is restarting the computer, therefore interrupting the download and the install doesn't happen. What we'd like to do is to be able to tell windows \"I need you to not reboot while I'm running. Wait until I'm done.\"\n\n### Proposed technical implementation details (optional)\n\nI don't know the windows internals, but calling it with a command like 'Postpone-Restart' would be sufficent.",
  "closed_at": "2021-08-20T12:00:47Z",
  "comments": [
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "I'm not even sure Windows itself has a functionality to provide this, short of the process refusing to close when asked (and even then, you/Windows can force it to close anyway)... had a bit of a search around, but didn't find anything promising. 😕 \r\n\r\nNot sure if there's a way to deliberately trigger that behaviour. 🤔 ",
      "created_at": "2021-08-18T20:38:29Z",
      "updated_at": "2021-08-18T20:38:55Z"
    },
    {
      "author": "jborean93",
      "author_association": "COLLABORATOR",
      "body": "> I'm not even sure Windows itself has a functionality to provide this\r\n\r\nI'm fairly confident there is not. You can abort a shutdown request that is in place with `shutdown.exe /a`. So theorectically you could have a loop that continues to run that (or at least the Win32 API equivalent) but this won't catch things that are shutting the host down immediately with no time to wait.",
      "created_at": "2021-08-18T21:15:04Z",
      "updated_at": "2021-08-18T21:15:04Z"
    },
    {
      "author": "thezim",
      "author_association": "CONTRIBUTOR",
      "body": "For Windows I believe there are some registry keys you can set but I believe this only guarded against Windows updates.",
      "created_at": "2021-08-18T22:56:58Z",
      "updated_at": "2021-08-18T22:56:58Z"
    },
    {
      "author": "msftbot[bot]",
      "author_association": "NONE",
      "body": "This issue has been marked as answered and has not had any activity for **1 day**. It has been closed for housekeeping purposes.",
      "created_at": "2021-08-20T12:00:37Z",
      "updated_at": "2021-08-20T12:00:37Z"
    }
  ],
  "created_at": "2021-08-18T20:16:45Z",
  "number": 15952,
  "state": "closed",
  "title": "Disable/postpone another process from restarting the computer while the script is running.",
  "updated_at": "2021-08-20T12:00:47Z"
}