{
  "_url": "https://github.com/PowerShell/PowerShell/issues/16053",
  "author": "hgkamath",
  "body": "### Prerequisites\r\n\r\n- [X] Write a descriptive title.\r\n- [X] Make sure you are able to repro it on the [latest released version](https://github.com/PowerShell/PowerShell/releases)\r\n- [X] Search the existing issues.\r\n- [X] Refer to the [FAQ](https://github.com/PowerShell/PowerShell/blob/master/docs/FAQ.md).\r\n- [X] Refer to [Differences between Windows PowerShell 5.1 and PowerShell](https://docs.microsoft.com/powershell/scripting/whats-new/differences-from-windows-powershell).\r\n\r\n### Steps to reproduce\r\n\r\n\r\n\r\n1. - login as unprivileged non-adminstrator user (or administrative user, does not matter, for administrative user UAC only warns without needing authentication )\r\n2. - press windows start-key/click on windows start button\r\n2. - start typing \"power...\"' or \"pw...\" . This switches the start menu to the type-to-search, which shortlists the powershell programs available in the startmenu/windows-system\r\n3. - For each search-result found, the right-half-pane of the start menu, shows additional actions. Clicking on \">\" sign of other \"powershell versions\" changes the right-half-pane to their additional actions.\r\n4. - After choosing whichever powershell application, click on \"Run as Administrator\" action that shows up in the right-half-pane.\r\n5. - UAC starts minimized (background), blinking orange on taskbar. IMHO the UAC should have foregrounded. This should happen only when background processes or not-in-focus applications request elevation. However, in this case the user is actively/intentfully starting an application.\r\n\r\n\r\nWindows-10 ver 21H1, OS build 19043.1202\r\nversion of \"windows powershell\" : 5.1.19041.1202\r\nversion of \"pwsh/powershell\" 7.1.3 installed via chocolatey to C:\\Program Files\\PowerShell\\7 (choco install powershell-core)\r\nUAC level setting for ordinary user on highest \r\nUAC level setting for admin user is on second highest. \r\n\r\nNormally for most other apps, like cmd, cleanmgr, compmgmt, diskmgmt, the UAC dims screen and shows up in the foreground. One only needs to press Escape, or click-OK/press-spacebar to dismiss the UAC\r\nThe issue is, that for the above given procedure, one is forced to additionally click on orange blinking minimized UAC in taskbar to dismiss it.\r\n\r\nBehavior/issue happens \r\n* ~~for \"windows powershell\", \"windows powershell (x86)\" and \"Powershell 7 (x64)/pwsh\"~~ [see comment](https://github.com/PowerShell/PowerShell/issues/16053#issuecomment-913086154)\r\n* when logged in as a ordinary non-administrative user or as user with administrative privileges\r\n\r\nBehavior/Issue does not happen for the following cases\r\n* ~~Does not happen for \"powershell 7 preview (x64)\" and \"Windows Powershell ISE\"~~ [see comment](https://github.com/PowerShell/PowerShell/issues/16053#issuecomment-913086154)\r\n* when \"powershell\" or \"Windows powershell\" is scrolled to in the start menu, right click, \"run as administrator\"\r\n* when \"windows powershell (Admin)\" is started from right click of windows start button\r\n* when \"Open file location\" is used to show shortcut locations in explorer, and run by \"right click - run as administrator\" .\r\n* when \"powershell exe\" locations are located in windows-explorer and run by \"right click - run as administrator\"\r\nIn the above cases, UAC is foregrounded as expected.\r\n\r\nIt is somewhat disconcerting to move mouse to click on taskbar to maximize UAC just for powershell.\r\n\r\nThe question boils down to why does powershell elevated start behave differently when started it is started using windows-type-to-search.\r\n\r\n### Expected behavior\r\n\r\n```console\r\nUAC should come in the foreground, dim rest of screen.\r\nShould not start as orange blinking minimized UAC in taskbar .\r\nOne only needs to press Escape, or click-OK/press-spacebar to dismiss the UAC\r\n```\r\n\r\n\r\n### Actual behavior\r\n\r\n```console\r\nStarts as orange blinking minimized UAC in taskbar. One is forced to additionally click on orange blinking minimized UAC in taskbar to dismiss it.\r\n```\r\n\r\n\r\n### Error details\r\n\r\n```console\r\nNA\r\n```\r\n\r\n\r\n### Environment data\r\n\r\n```powershell\r\nPS C:\\Users\\admin> # pwsh / Powershell 7 (x64)\r\nPS C:\\Users\\admin> echo $PSVersionTable\r\n\r\nName                           Value\r\n----                           -----\r\nPSVersion                      7.1.3\r\nPSEdition                      Core\r\nGitCommitId                    7.1.3\r\nOS                             Microsoft Windows 10.0.19043\r\nPlatform                       Win32NT\r\nPSCompatibleVersions           {1.0, 2.0, 3.0, 4.0…}\r\nPSRemotingProtocolVersion      2.3\r\nSerializationVersion           1.1.0.1\r\nWSManStackVersion              3.0\r\n\r\n\r\nPS C:\\WINDOWS\\system32> # windows powershell\r\nPS C:\\WINDOWS\\system32> echo $PSVersionTable\r\n\r\nName                           Value\r\n----                           -----\r\nPSVersion                      5.1.19041.1202\r\nPSEdition                      Desktop\r\nPSCompatibleVersions           {1.0, 2.0, 3.0, 4.0...}\r\nBuildVersion                   10.0.19041.1202\r\nCLRVersion                     4.0.30319.42000\r\nWSManStackVersion              3.0\r\nPSRemotingProtocolVersion      2.3\r\nSerializationVersion           1.1.0.1\r\n\r\n\r\n\r\nPS C:\\Users\\admin> # powershell 7 preview (x64)\r\nPS C:\\Users\\admin> echo $PSVersionTable\r\n\r\nName                           Value\r\n----                           -----\r\nPSVersion                      7.2.0-preview.9\r\nPSEdition                      Core\r\nGitCommitId                    7.2.0-preview.9\r\nOS                             Microsoft Windows 10.0.19043\r\nPlatform                       Win32NT\r\nPSCompatibleVersions           {1.0, 2.0, 3.0, 4.0…}\r\nPSRemotingProtocolVersion      2.3\r\nSerializationVersion           1.1.0.1\r\nWSManStackVersion              3.0\r\n\r\n```\r\n\r\n\r\n### Visuals\r\n\r\n[see comment](https://github.com/PowerShell/PowerShell/issues/16053#issuecomment-913086154)\r\n\r\n### Ref\r\n[] \"...The UAC elevation mechanism uses the HWND as part of determining whether the elevation is a background or foreground elevation...\" https://answers.microsoft.com/en-us/windows/forum/all/how-do-you-maximize-user-account-controluac-window/b5c96c91-08a6-4c8c-8c7a-571ed5ea74b4  , also https://social.msdn.microsoft.com/Forums/windowsdesktop/en-US/07cf27b0-ac60-4469-a440-34c0b1a4a73f/uac-elevation-dialog-minimized?forum=windowssecurity ",
  "closed_at": null,
  "comments": [
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "This sounds more like a Windows issue than a powershell issue to me. 😕 ",
      "created_at": "2021-09-04T19:57:38Z",
      "updated_at": "2021-09-04T19:57:38Z"
    },
    {
      "author": "hgkamath",
      "author_association": "NONE",
      "body": "I felt so too, but powershell is so tightly coupled to windows, that windows-type-to-search might be treating powershell differently, or powershell reacting differently to being started by windows-type-to-search. \r\nI also confirmed that same happens on my other widows device (SP3), but I do appinstall/setup/configure things similarly on both devices. So I wonder if this reproducible on any window machine. Either way, as powershell is affected, powershell developers may need to follow it up.",
      "created_at": "2021-09-04T20:23:53Z",
      "updated_at": "2021-09-04T20:27:37Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "The fact it's still happening for PowerShell 7, which is entirely separate from Windows, would indicate to me that whatever the issue is, it's something in Windows. Doubly so because it seems to be pretty situational, from your description. I've not seen anything similar myself, though I don't know if that's just because I tend to use Windows Terminal rather than launching pwsh directly.",
      "created_at": "2021-09-04T20:39:01Z",
      "updated_at": "2021-09-04T20:39:01Z"
    },
    {
      "author": "hgkamath",
      "author_association": "NONE",
      "body": "okay, I noticed something. \r\n\r\n![image](https://user-images.githubusercontent.com/3323558/132115457-b34619c0-2d7a-4957-a0dd-7630bea9de78.png)\r\n\r\nIn the right-side actions list, for every powershell version, there seems to be two \"Run as A/administrator\" actions\r\n1) one with colored icon (also this has a capital A). \"Run as Administrator\" \r\n2) one with windows-standard outline icon. \"Run as administrator\" \r\nThe first is the one that causes UAC to goto background\r\nThe second brings the UAC normally. \r\n\r\nThe colored icon \"Run as Administrator\" shows up before pressing the \"⌄\" sign in the right hand pane which shows additional actions. In the image above the \"⌄\" has already been pressed and has turned into a \"⌃\" which is to hide the additional actions.\r\n\r\nI think the colored icon \"Run as Administrator\" is populated as a form of quick-access action.\r\n\r\nIf this is correct, the workaround is to just avoid the attention grabbing colored icon \"Run as Administrator\" \r\nIt is troublesome to ignore the quickly accessible one, click the \"⌄\" show more action sign each time to get to the right \"Run as administrator\" .\r\n\r\nSo in the original issue description, issue is not selective by powershell version. It happens for powershell versions (in my case, all versions) including the 'windows powershell ISE', which have this colored icon \"Run as Administrator\" quick-access-action. Strangely, for the 'Windows powershell ISE' the colored icon \"Run as Administrator\" does not appear in its own action list, but is appended to that of \"Window powershell\", which could be another bug.\r\n\r\nOther applications when run as administrator, do not make this extra colored icon \"Run as Administrator\" .\r\nI don't have any other app which has a colored icon \"Run as Administrator\" when they are type-to-search-ed to.\r\n\r\nIn the case of other application, rarely does the need arise to run then as administrator, so they do not require a quick-access action. Powershell is run as administrator frequently. So populating, 'Run as Administrator\" as a quick-access action of the powershell app is a handy feature, only that it should not minimize the UAC.\r\n\r\nSo the question is who is authoring/registering/invoking those quick-access action?\r\npowershell/ powershell installer/ powershell chocolatey installer/ windows-10 ?\r\n\r\nI hope I am not jumping to hasty conclusion.\r\n",
      "created_at": "2021-09-05T04:51:45Z",
      "updated_at": "2021-09-10T17:48:15Z"
    },
    {
      "author": "hgkamath",
      "author_association": "NONE",
      "body": "I uninstalled powershell-core-7.2.0-preview8 and pwsh-7.1.3 and installed powershell-core-7.1.4 ```choco install powershell-core```. As of a fresh install, those accelerated colored-icon actions do not exist. They still exist for the windows-10 pre-bundled \"windows powershell-5\" and \"windows powershell-ISE\". \r\nI'll update here in case I notice something.",
      "created_at": "2021-09-12T11:45:26Z",
      "updated_at": "2021-09-12T12:18:27Z"
    },
    {
      "author": "StevenBucher98",
      "author_association": "COLLABORATOR",
      "body": "Is this still an issue @hgkamath? From reading I do suspect it might be a Windows issue but am curious if recent updates have fixed this.",
      "created_at": "2022-05-23T17:52:59Z",
      "updated_at": "2022-05-23T17:52:59Z"
    },
    {
      "author": "hgkamath",
      "author_association": "NONE",
      "body": "As of 7.2.4, it still is.  Pressing the colored-in-icon-shortcuts, sends UAC-dialog to background as minimized yellow flashing icon on taskbar.\r\n\r\npowershell-core is at version 7.2.4.  I have been upgrading through the minor versions through chocolatey ugrades, since last comment. Both it and the standard-powershell 5.1.19041.1682, have the double standard-outline-icon and the colored-in-icon-shortcuts. Win10 has also been getting its monthly patch Tuesday cumulatives and is now at 21H2 19044.1706 \r\n\r\nI've sort of learned to ignore the colored-in-icon-shortcut and become habituated to extra the extra work of pressing the more-arrow (\"⌄\" sign) and choosing the outline-icon. The colored-in-icon-shortcut is always shown as a quick shortcut before the more-arrow press, though I am sure I click it much less.\r\nAlso, quick and preferable, is to press 'Win-x , a'  , this pops up the standard-powershell-5.1 into the foreground as expected.\r\n\r\nPerhaps, a question to ask, is how those shortcuts got created. The answer to that might also explain why they look and behave differently . I wonder if those colored-in-icon-shortcuts are created on first run.\r\n",
      "created_at": "2022-05-24T04:10:56Z",
      "updated_at": "2022-05-24T04:24:36Z"
    },
    {
      "author": "hello-smile6",
      "author_association": "NONE",
      "body": "Can reproduce this without installing any other copies of PowerShell than the default.\r\n![Screenshot of search UI](https://user-images.githubusercontent.com/73048226/169948634-545c9658-f607-447c-ad74-80f211b399e9.png)\r\n",
      "created_at": "2022-05-24T04:25:34Z",
      "updated_at": "2022-05-24T04:25:34Z"
    },
    {
      "author": "hgkamath",
      "author_association": "NONE",
      "body": "I uninstalled powershell-core-7.2.4 from the settings/apps&features. (did not reboot, nor relogin). Also did a ```choco-uninstall powershell-core``` for any cleanups.\r\n\r\nSame behavior happens with shortcuts of win10 standard-powershell-5.1, (even without installing 7.2.4) with no other powershell-version installed\r\n\r\nCan you confirm to me that the same behavior is seen by you? \r\n\r\nI reinstalled 7.2.4 ```choco install powershell-core```.\r\nUpon this fresh-install, this time, for powershell-7.2.4, the ~~outline~~ colored-in-icon-shortcuts are not present in the menu. \r\nThe ~~colored-in~~ outline-icon-shortcut is bringing the UAC dialog to the foreground as expected. \r\nI am not optimistic that this will prevail for long, at some point that ~~outline~~ colored-in-icon-shortcuts will get generated/populated in the menu and the troublesome behavior may re-appear.  ~~So, maybe, I think it happens when both types of shortcuts are present~~.  So, the blame squarely lies on those colored-in-shortcuts.\r\n\r\nEDIT: some mistypes corrected above ( I misidentified the colored-in and outlined icon styles)",
      "created_at": "2022-05-24T04:31:57Z",
      "updated_at": "2022-05-24T10:39:41Z"
    },
    {
      "author": "hello-smile6",
      "author_association": "NONE",
      "body": "> I uninstalled powershell-core-7.2.4 from the settings/apps&features. (did not reboot, nor relogin). Also did a `choco-uninstall powershell-core` for any cleanups.\r\n> \r\n> Same behavior happens with shortcuts of win10 standard-powershell-5.1, even without installing 7.2.4\r\n> \r\n> Can you confirm to me that the same behavior is seen by you?\r\n> \r\n> I reinstalled 7.2.4 `choco install powershell-core`. Upon this fresh-install, this time, for powershell-7.2.4, the outline-icon-shortcut is not present in the menu. The colored-in-icon-shortcut is bringing the UAC dialog to the foreground as expected. I am not optimistic that this will prevail for long, at some point that outline-icon-shortcut will get generated/populated in the menu and the troublesome behavior may re-appear. So, maybe, I think it happens when both shortcuts are present.\r\n\r\nI can't test it, unfortunately.",
      "created_at": "2022-05-24T04:52:30Z",
      "updated_at": "2022-05-24T04:52:30Z"
    }
  ],
  "created_at": "2021-09-04T18:56:13Z",
  "number": 16053,
  "state": "open",
  "title": "powershell found by windows-start-menu-search, if run as adminstrator, causes UAC to be minimized",
  "updated_at": "2022-05-24T10:39:41Z"
}