{
  "_url": "https://github.com/PowerShell/PowerShell/issues/16127",
  "author": "Tarjei-stavanger",
  "body": "### Summary of the new feature / enhancement\n\nI miss the ISE on Windows. It is a cheap and cheerful environment for quick development of small PowerShell scripts. Nothing fancy, just good enough. And significantly better than notepad and even Notepad++ for this purpose.\r\n\r\nI realize that most developers will use a big fancy IDE. If you are into system management, that is not likely since you usually have to develop on the server which will eventually run the scripts. Visual Studio is a dramatic overkill for these jobs and it takes far too long to install.\r\n\r\nSo give us back the PowerShell ISE for Windows, please!\n\n### Proposed technical implementation details (optional)\n\nI suspect that you know how to resurrect the PowerShell ISE since it is a past product.",
  "closed_at": "2021-09-23T12:00:42Z",
  "comments": [
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "PowerShell ISE is frozen project. New project is Visual Studio Code with PowerShell Extension.",
      "created_at": "2021-09-21T06:45:19Z",
      "updated_at": "2021-09-21T06:45:19Z"
    },
    {
      "author": "Tarjei-stavanger",
      "author_association": "NONE",
      "body": "Visual Studio is a dramatic overkill.",
      "created_at": "2021-09-21T06:49:26Z",
      "updated_at": "2021-09-21T06:49:26Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "It is not Visual Studio. It is Visual Studio Code. https://code.visualstudio.com/",
      "created_at": "2021-09-21T06:51:26Z",
      "updated_at": "2021-09-21T06:52:01Z"
    },
    {
      "author": "Tarjei-stavanger",
      "author_association": "NONE",
      "body": "It does not matter what you call it. It is still dramatic overkill.",
      "created_at": "2021-09-21T06:55:26Z",
      "updated_at": "2021-09-21T06:55:26Z"
    },
    {
      "author": "SeeminglyScience",
      "author_association": "COLLABORATOR",
      "body": "To be clear there are two very different products with similar names.  One is Visual Studio, which I would tend to agree it would be overkill.  The other is VSCode (Visual Studio Code) which is pretty lightweight. The only thing that is really the same is that they are named very similarly (which is confusing) and that you write code with both.",
      "created_at": "2021-09-21T13:08:16Z",
      "updated_at": "2021-09-21T13:08:16Z"
    },
    {
      "author": "doctordns",
      "author_association": "COLLABORATOR",
      "body": "> It does not matter what you call it. It is still dramatic overkill.\r\n\r\nI would strongly disagree. Consider the purpose of an IDE - it is to help folks write, test, and release great code and the artifacts associated (eg readme.MD files, etc). The Windows PowerShell ISE was a great product for its day and was a tool I loved and used extensively.  But then along came VS Code. For me, the early versions were sub-optimal. As a _user_ of an IDE, having to hand-edit JSON to change fonts was a bit too much of an ask. But then, month by month it improved. And today, it is a great product and one I recommend for both users of Windows PowerShell and PowerShell 7. The various add-ins are all excellent and help me to write code.  I personally think that recommending VS Code is the right approach. The ISE is feature complete and is not going to be improved. \r\n\r\nI am curious., as someone who has used PowerShell for nearly 20 years, why you feel VS Code is overkill?",
      "created_at": "2021-09-21T13:11:06Z",
      "updated_at": "2021-09-21T13:11:06Z"
    },
    {
      "author": "rkeithhill",
      "author_association": "COLLABORATOR",
      "body": "Perhaps give VSCode a try: https://code.visualstudio.com/.  It's free and also open source (on GItHub https://github.com/microsoft/vscode).\r\n\r\n<blockquote><img src=\"https://code.visualstudio.com/opengraphimg/opengraph-home.png\" width=\"48\" align=\"right\"><div><strong><a href=\"https://code.visualstudio.com/\">Visual Studio Code - Code Editing. Redefined</a></strong></div><div>Visual Studio Code is a code editor redefined and optimized for building and debugging modern web and cloud applications.  Visual Studio Code is free and available on your favorite platform - Linux, macOS, and Windows.</div></blockquote>",
      "created_at": "2021-09-21T15:35:41Z",
      "updated_at": "2021-09-21T15:36:25Z"
    },
    {
      "author": "MartinGC94",
      "author_association": "CONTRIBUTOR",
      "body": "I also wish they would add the ISE to this repository and revive it but apparently it shares some common controls with Visual Studio and that team doesn't want that code to be open source.  \r\nIf you really want to continue using ISE you can try following the instructions here: https://old.ironmansoftware.com/using-powershell-core-6-and-7-in-the-windows-powershell-ise/ it's not 100% perfect, for example the syntax highlighting will still be based on the 5.1 syntax and you can't use commands like Out-GridView because it's a remote session.\n\n<blockquote><div><strong><a href=\"https://old.ironmansoftware.com/using-powershell-core-6-and-7-in-the-windows-powershell-ise/\">Just a moment...</a></strong></div></blockquote>",
      "created_at": "2021-09-21T16:02:09Z",
      "updated_at": "2021-09-21T16:02:11Z"
    },
    {
      "author": "Tarjei-stavanger",
      "author_association": "NONE",
      "body": "Most of you are trying to sell me a pack elephant when the need is a carrier bag.\r\n\r\nThe PowerShell IDE is ideal for doing small work on a server. It **works well** right out of the box.  It handles characters set used very well. Tab handling is excellent. I can write the code wih syntax help and then run with F5. And possibly save. It is ideal for the job.\r\n\r\nI'm thoroughly unimpressed with Visual Studio Code. I don't like editors which I have to program before they work sensibly. It does not handle characte sets or tabs in a sensible manner out of the box. It is a shitty product for my needs.\r\n\r\nI can live fine with 5.1 syntax checking in the IDE for the time being.",
      "created_at": "2021-09-22T05:57:14Z",
      "updated_at": "2021-09-22T05:57:14Z"
    },
    {
      "author": "msftbot[bot]",
      "author_association": "NONE",
      "body": "This issue has been marked as answered and has not had any activity for **1 day**. It has been closed for housekeeping purposes.",
      "created_at": "2021-09-23T12:00:41Z",
      "updated_at": "2021-09-23T12:00:41Z"
    }
  ],
  "created_at": "2021-09-21T06:35:14Z",
  "labels": [
    "Issue-Enhancement",
    "Resolution-Answered"
  ],
  "number": 16127,
  "state": "closed",
  "title": "The PowerShell ISE",
  "updated_at": "2021-09-23T12:00:42Z"
}