{
  "_url": "https://github.com/PowerShell/PowerShell/issues/16256",
  "author": "mathysie",
  "body": "### Summary of the new feature / enhancement\n\nIn bash shell and other shells regularly found on Ubuntu systems, there is a shortcut CTRL + D to close the shell. In Powershell you have to enter the command `exit` or close the shell by a mouse click.\r\n\r\nAs I work with both bash shells and Powershell, my muscle memory first hits CTRL + D. Then, when there is no reaction from Powershell, I have to do additionally 5 keypresses to type `exit` and hit enter.\r\n\r\nIt's a minor annoyance, but it would help the quality of life for people working with both shells.\n\n### Proposed technical implementation details (optional)\n\nAfter hitting CTRL + D in Powershell, the shell must close. Just like bash shells.",
  "closed_at": null,
  "comments": [
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "Related #16236",
      "created_at": "2021-10-15T12:09:56Z",
      "updated_at": "2021-10-15T12:09:56Z"
    },
    {
      "author": "jhoneill",
      "author_association": "NONE",
      "body": "just add this to your PowerShell profile\r\n```\r\nSet-PSReadLineKeyHandler -Chord 'Ctrl+d' -ScriptBlock { [System.Environment]::Exit(0) }\r\n```",
      "created_at": "2021-10-18T23:46:42Z",
      "updated_at": "2021-10-18T23:47:05Z"
    },
    {
      "author": "MrFly72",
      "author_association": "NONE",
      "body": "Its working for me on 7.1.5 and Raspian Debian, starting pwsh inside of a bash.\r\nCTRL+D will first exit PWSH and second press will exit the bash.\r\nBut funny enough, the KeyHandler describes it as \"Delete the character under the cursor, or if the line is empty, exit the process.\", so this will only work on an empty line",
      "created_at": "2021-10-20T05:26:47Z",
      "updated_at": "2021-10-20T05:34:34Z"
    },
    {
      "author": "teknoraver",
      "author_association": "NONE",
      "body": "Yes, this works on Linux, it just have a small glitch described here: #16466",
      "created_at": "2021-11-14T01:32:12Z",
      "updated_at": "2021-11-14T01:32:12Z"
    },
    {
      "author": "mathysie",
      "author_association": "NONE",
      "body": "@jhoneill thank you for the command! However as the command is not trivial, it feels like a workaround. Especially the less experienced PowerShell users who switch often between bash and PS will appreciate CTRL + D as a standard shortcut, as they have no means of knowing adding a key handler to the profile is possible.",
      "created_at": "2021-11-14T09:23:44Z",
      "updated_at": "2021-11-14T09:24:10Z"
    },
    {
      "author": "jhoneill",
      "author_association": "NONE",
      "body": "IIRC, in the Unix world Ctrl +D is the end of file marker  so ctrl + D will tell many programs from the unix world \"no more input\" and they terminate. \r\nEnd-of-file does that on Windows too, but  CP/M used Ctrl+Z , DOS copied that and so did Windows so  Ctrl Z [enter] gets you out of nslookup and similar programs that take piped input \r\nCMD and Windows PowerShell don't work that way, and I'm guessing the  behaviour carried over into pwsh.  So end of file won't close things, but you can make any key combo a  short cut for exit. (Much childish fun can be had with _that_)\r\n\r\nShould ctrl D ==> exit be a  default if PS-Readline sees it's on linux ? I can see the case for that on the grounds it's what a linux users expects of a a shell, but I wouldn't change what Windows users are used to. \r\n ",
      "created_at": "2021-11-14T16:14:29Z",
      "updated_at": "2021-11-14T23:17:59Z"
    }
  ],
  "created_at": "2021-10-15T12:04:11Z",
  "number": 16256,
  "state": "open",
  "title": "Enable shortcut CTRL + D to close Powershell",
  "updated_at": "2021-11-14T23:17:59Z"
}