{
  "_url": "https://github.com/PowerShell/PowerShell/issues/16321",
  "author": "Nino-kun",
  "body": "### Prerequisites\n\n- [X] Write a descriptive title.\n- [X] Make sure you are able to repro it on the [latest released version](https://github.com/PowerShell/PowerShell/releases)\n- [X] Search the existing issues.\n- [X] Refer to the [FAQ](https://github.com/PowerShell/PowerShell/blob/master/docs/FAQ.md).\n- [X] Refer to [Differences between Windows PowerShell 5.1 and PowerShell](https://docs.microsoft.com/powershell/scripting/whats-new/differences-from-windows-powershell).\n\n### Steps to reproduce\n\nIf I run Robocopy, or other program with similar status/progress update, in interactive remote session to WinPC, it's output is broken.\r\n\r\netsn user@remote-pc -ssh (with WinRM-connection problem persist)\r\nRobocopy.exe d:\\downloads e:\\pictures *.jpg /J (copy all JPEG files from d:\\downloads to e:\\pictures)\n\n### Expected behavior\n\n```console\nUpdating percentages on screen should be like when running locally - in one line.\n```\n\n\n### Actual behavior\n\n```console\nEach percentage update showing on new line.\n```\n\n\n### Error details\n\n_No response_\n\n### Environment data\n\n```powershell\nBoth local and remote PC have same $PSVersionTable:\r\nName                           Value\r\n----                           -----\r\nPSVersion                      7.1.5\r\nPSEdition                      Core\r\nGitCommitId                    7.1.5\r\nOS                             Microsoft Windows 10.0.19043\r\nPlatform                       Win32NT\r\nPSCompatibleVersions           {1.0, 2.0, 3.0, 4.0…}\r\nPSRemotingProtocolVersion      2.3\r\nSerializationVersion           1.1.0.1\r\nWSManStackVersion              3.0\n```\n\n\n### Visuals\n\n_No response_",
  "closed_at": "2021-11-01T09:42:18Z",
  "comments": [
    {
      "author": "jborean93",
      "author_association": "COLLABORATOR",
      "body": "The issue here as I understand it is that when you start a process locally without capturing output the program will write directly to the console buffer so things like progress percentages is handled by that app. When you start a process like this through a remoted session PowerShell will always redirect and capture the `stdout` so now it's being processed by PowerShell and output line by line. This is similar to doing something like `robocopy.exe ... | Out-String` as now the output is process by PowerShell itself and output as string objects per line.\r\n\r\nI'm not sure if this can really be changed to progress records, similar to `Write-Progress` as each executable would have it's own method of displaying progress. Potentially PowerShell could somehow handle the backspace the native app will be writing but even then I don't think it's really possible or feasible to do this.  You see a similar problem when running tools like this in CI with progress indicators spamming the output because the CI log is not an actual console output.\r\n\r\nThere are some people who have implemented a wrapper around robocopy to read the output itself and convert it to a progress record which is most likely going to be the best way forward if you want progress records https://stackoverflow.com/questions/13883404/custom-robocopy-progress-bar-in-powershell. Also just as an FYI while you have an \"interactive\" PSSession when you use `Enter-PSSession` the actual session isn't going to work when calling binaries that have interactive prompts like `sudo`, `diskpart`, etc. These binaries expect an interactive console that is streamed to the client and requires input whereas a PSSession doesn't work in a way where that's possible.\n\n<blockquote><img src=\"https://cdn.sstatic.net/Sites/stackoverflow/Img/apple-touch-icon@2.png?v=73d79a89bded\" width=\"48\" align=\"right\"><div>Stack Overflow</div><div><strong><a href=\"https://stackoverflow.com/questions/13883404/custom-robocopy-progress-bar-in-powershell\">Custom RoboCopy Progress Bar in PowerShell</a></strong></div><div>I'm interested in a PowerShell script that copies a large amount of files from a server daily and I'm interested in implementing a in-console progress bar like\n\nFile copy status - XX% complete.\n\nwh...</div></blockquote>",
      "created_at": "2021-11-01T05:22:05Z",
      "updated_at": "2021-11-01T05:22:07Z"
    },
    {
      "author": "Nino-kun",
      "author_association": "NONE",
      "body": "Last sentence in your post make me try pure SSH remoting, not PS-Remoting with SSH transport. And it display copy progress like I want it.\r\n\r\nIt will be sad if PS-Remoting couldn't work like SSH in the future, but I can live with that.\r\n\r\nI close issue, thank you all.",
      "created_at": "2021-11-01T09:42:18Z",
      "updated_at": "2021-11-01T09:42:18Z"
    }
  ],
  "created_at": "2021-10-28T15:45:00Z",
  "number": 16321,
  "state": "closed",
  "title": "Program output with progress updates in interactive remote session is broken",
  "updated_at": "2021-11-01T09:42:22Z"
}