{
  "_url": "https://github.com/PowerShell/PowerShell/issues/16360",
  "author": "doctordns",
  "body": "### Summary of the new feature / enhancement\r\n\r\nWith PowerShell, you sometimes get objects which have properties that are actually an array of objects. The Threads and Modules Properties on System.Diagnostics.Process object. When Format-List/Format-Table formats these parameters, they only include up to a certain number of occurrences, by default 4. The number of enumerations shown is determined by the automatic variable $FormatEnumerationLimit. So if you want more, you just update that variable, typically in a $Profile.\r\n\r\nHere is the current behaviour:\r\n\r\n```powershell\r\nPS> $FormatEnumerationLimit\r\n4\r\nPS> Get-Process | Select-Object -Property Name, Threads -First 4\r\n\r\nName                    Threads\r\n----                    -------\r\nAggregatorHost          {5240}\r\nApplicationFrameHost    {16968, 2848, 18728}\r\nAppVShNotify            {9164}\r\nAtom.SDK.WindowsService {4064, 4908, 4912, 19144…}\r\n\r\nPS> $FormatEnumerationLimit = 1\r\nPS> Get-Process | Select-Object -Property Name, Threads -First 4\r\n\r\nName                    Threads\r\n----                    -------\r\nAggregatorHost          {5240}\r\nApplicationFrameHost    {16968…}\r\nAppVShNotify            {9164}\r\nAtom.SDK.WindowsService {4064…}\r\n```\r\n\r\nI propose adding a new parameter to both Format-List and Format-Table, -FormatEnumerationLimit which overrdes the value of $FormatEnumerationLimit, but just for this command. Like this:\r\n\r\n```powershell\r\nPS> Get-Process | Select-Object -First 4 | Format-Table Name, Threads -FormatEnumerationLimit 2\r\n\r\nName                    Threads\r\n----                    -------\r\nAggregatorHost          {5240}\r\nApplicationFrameHost    {16968, 2848…}\r\nAppVShNotify            {9164}\r\nAtom.SDK.WindowsService {4064, 4908…}\r\n```\r\n\r\n### Proposed technical implementation details (optional)\r\n\r\n* Update each cmdlet with the extra parameter\r\n* Change the logic for handling enumeration limit by using the parameter value if it is specified.\r\n* Retain the default value and default variable handling.",
  "closed_at": null,
  "comments": [
    {
      "author": "jhoneill",
      "author_association": "NONE",
      "body": "Two thoughts. \r\nOne would be to have this as a custom item property. That way it could be different in different columns. \r\n\r\nThe other is I'm certain that at one time FormatEnumerationLimit decided the number of columns PowerShell would go to before it switched from a table view to a list view when it had nothing else to guide it \r\n It doesn't do that _now_ it did it change ? ",
      "created_at": "2021-11-02T22:22:32Z",
      "updated_at": "2021-11-02T22:22:32Z"
    },
    {
      "author": "doctordns",
      "author_association": "COLLABORATOR",
      "body": "Thanks @jhoneill.\r\n\r\nNot about a custom item property - not sure what it would look like?\r\n\r\nI'd like to see this to enable a format-Table/Format-List to format a different number of iterations without having to change `$FormatEnumerationLimit`. Just like you can, on a cmdlet by cmdlet basis, override ErrorAction (e.g. `-ErrorAction Stop`).\r\n\r\nRegarding your last point - I am pretty sure FormatEnumerationLimit was there from V1. I could be wrong. But whatever it was, enumeration on a cmdlet by cmdlet basis would be useful. I know it was this way in V2 in 2011 when I gave a [talk at the PowerShell Deep dive in Frankfurt](https://devblogs.microsoft.com/powershell/powershell-deep-dive-lineup). Later [Jeff Hicks posted an article about that talk](https://mcpmag.com/articles/2012/01/05/powershell-enum-limit.aspx).",
      "created_at": "2021-11-03T12:49:25Z",
      "updated_at": "2021-11-03T12:49:25Z"
    },
    {
      "author": "jhoneill",
      "author_association": "NONE",
      "body": "I think my misunderstanding  of the number of columns, vs the number of items in a column goes back to then.  \r\nAs for a custom property  you can have this today \r\n`dir | ft @{n='Time'; e='LastWriteTime'; f=\"ddd dd MM yyyy\";w=20},name `\r\n\r\nSo why not have `i[tems]=`  \r\n",
      "created_at": "2021-11-03T20:33:03Z",
      "updated_at": "2021-11-03T20:33:03Z"
    },
    {
      "author": "doctordns",
      "author_association": "COLLABORATOR",
      "body": "Well - a simple parameter would work in the cases I see and be pretty simple I think.\r\n\r\nAs an aside, where IS the code for the Format-List and Format-Table commands. My google fu must be weak because I can't find the actual code where the formatenumerationlimit variable is actually obtained and used. ",
      "created_at": "2021-11-05T14:32:34Z",
      "updated_at": "2021-11-05T14:32:34Z"
    },
    {
      "author": "sdwheeler",
      "author_association": "COLLABORATOR",
      "body": "@doctordns `$FormatEnumerationLimit` is a preference variable. It is documented at https://docs.microsoft.com/powershell/module/microsoft.powershell.core/about/about_preference_variables#formatenumerationlimit\r\n\r\nYour suggestion to add a parameter would affect the enumeration for all properties in the output. The suggestion from @jhoneill allows you to specify a different enumeration limit for each property.   \n\n<blockquote><img src=\"https://docs.microsoft.com/media/logos/logo-powershell-social.png\" width=\"48\" align=\"right\"><div><strong><a href=\"https://docs.microsoft.com/en-us/powershell/module/microsoft.powershell.core/about/about_preference_variables\">about Preference Variables - PowerShell</a></strong></div><div>Variables that customize the behavior of PowerShell.</div></blockquote>",
      "created_at": "2021-11-05T15:26:18Z",
      "updated_at": "2021-11-05T15:26:20Z"
    },
    {
      "author": "jhoneill",
      "author_association": "NONE",
      "body": "@sdwheeler  I think I first learned of FormatEnumerationLimit  from a talk @doctordns  did 10+ years ago, but I've had it my head ever since that it controls how many columns there were, not how many items there were in a column, I'm sure I blogged something to that effect. What's in the help definitely matches the current behaviour (items per column, no effect on number of columns)  I'm wondering now if that was ever true, or if Thomas needs to tell me off for not listening in class :-) \r\n\r\n@doctordns  yes a parameter would work, but I've been doing something this week where if I could customize it I would want all 10 items in one column, but a maximum of 2 or 3 items in another, hence the custom property idea.  ",
      "created_at": "2021-11-05T15:45:04Z",
      "updated_at": "2021-11-05T15:45:04Z"
    },
    {
      "author": "doctordns",
      "author_association": "COLLABORATOR",
      "body": "I presented this at the Experts Conference in 2011 (wish I could find the slides!!). I am pretty sure I was clear that the variable just handled the number of objects enumerated. In all my work-around that time delivered the same message. I apologise if I did not explain that clearly enough.\r\n\r\nI _hope_ we both agree that the ability to control the enumeration limit on a cmdlet by cmdlet basis would be a useful addition to PowerShell.  I prefer a simple parameter but like the addition of using a hash table with a new key.\r\n\r\nHaving a `-FormatEnumerationLimit` parameter would be easy for both the cmdlet developer and the user.  And probably covers most use cases. But controlling it on a property by property basis is a great solution too.\r\n\r\nHow about both?",
      "created_at": "2021-11-06T19:15:48Z",
      "updated_at": "2021-11-06T19:15:48Z"
    },
    {
      "author": "jhoneill",
      "author_association": "NONE",
      "body": "@doctordns  you know me, not listening properly in class. I've been scrabbling round to find out if I've passed on that error, or if I've just been carrying it silently.   \r\n\r\nHaving  both a switch and a custom object would work,  (switch is simpler to use and implement,  custom object has more flexibility) if it can only be one - there are arguments on both sides. \r\n",
      "created_at": "2021-11-06T20:33:50Z",
      "updated_at": "2021-11-06T20:33:50Z"
    },
    {
      "author": "rkeithhill",
      "author_association": "COLLABORATOR",
      "body": "Given that this proposal is limited to the `Format-List|Table` commands, `Format` in the parameter name seems redundant.  You could shorten the parameter name to `-EnumerationLimit`.",
      "created_at": "2021-11-06T21:44:09Z",
      "updated_at": "2021-11-07T00:43:28Z"
    },
    {
      "author": "jhoneill",
      "author_association": "NONE",
      "body": "@doctordns  stumbling around I've found that the default number of columns goes in types.xml, and I'll write a blog post about it ( I see you recently posted on format enumeration limit :-)  ) \r\n",
      "created_at": "2021-11-11T11:38:02Z",
      "updated_at": "2021-11-11T11:38:02Z"
    },
    {
      "author": "doctordns",
      "author_association": "COLLABORATOR",
      "body": "Yes indeed - you can do that, although editing types.xml is not a good practice. Create your own MYtypes.type.ps1xml file and import it in your $profile file.\r\n\r\nAlso, types.xml does not exist, as such, in PowerShell 7 so you have to import it manually.\r\n\r\nIf you DO do a blog post, consider posting it to the [PowerShell Community Blog]( https://devblogs.microsoft.com/powershell-community).  :-)",
      "created_at": "2021-11-11T11:50:02Z",
      "updated_at": "2021-11-11T11:50:02Z"
    },
    {
      "author": "jhoneill",
      "author_association": "NONE",
      "body": "@doctordns   \"a\" types.xml, not \"the types.xml\" :-)  \r\nThe default isn't actually present in the PS5 Types.xml, I always tell people to to **read** the file and note the warning \"Don't edit this it's signed\". Most modules I ship have their own types.ps1xml file. \r\n \r\nOf course with the 6 and 7 you need to use the v5 file or export the type information - I suspect because people would leave the one on $pshome alone ! \r\nMuch blogable content there and I've got a not to offer stuff to the PS community blog. \r\n",
      "created_at": "2021-11-11T12:32:51Z",
      "updated_at": "2021-11-11T12:32:51Z"
    },
    {
      "author": "daxian-dbw",
      "author_association": "MEMBER",
      "body": "Reassign the issue to the Cmdlet WG to decide if the new parameter is desired.",
      "created_at": "2021-11-11T23:59:45Z",
      "updated_at": "2021-11-11T23:59:45Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "Having this in FormatData would be better.",
      "created_at": "2021-11-12T05:28:04Z",
      "updated_at": "2021-11-12T05:28:04Z"
    },
    {
      "author": "jhoneill",
      "author_association": "NONE",
      "body": "> Having this in FormatData would be better.\r\n\r\nIf it is also added to the XML schema for `format.ps1xml` files that would be good in work I am doing at the moment. \r\n\r\nThere is one caveat. Unexpected XML isn't ignored at present so that means a module which ships a format file which specifies this won't load on older PowerShell; someone trying to adapt such a module for a down-level version of PowerShell can fix \"error at line x\" when an extra  parameter or an extra key in a custom property hash table is the issue, but mending format or types files will be too daunting. That's a very weak argument against the improvement.\r\n ",
      "created_at": "2021-11-12T08:41:09Z",
      "updated_at": "2021-11-12T08:41:09Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "> That's a very weak argument against the improvement.\r\n\r\nOur only policy is to keep backward compatibility. And even this is already unbelievable ",
      "created_at": "2021-11-12T10:58:23Z",
      "updated_at": "2021-11-12T10:58:23Z"
    },
    {
      "author": "doctordns",
      "author_association": "COLLABORATOR",
      "body": "> Having this in FormatData would be better.\r\n\r\nThis is a ‘scripting wall’ kind of issue. You can write your own XML,  but for most IT Pros, that is way too hard.  Just like -errorAction over rides -ErrorActionPreference. Yes by all means allow the XML to be imported, but also expose enumeration on the Format cmdlets.",
      "created_at": "2021-11-12T11:11:17Z",
      "updated_at": "2021-11-12T11:11:17Z"
    },
    {
      "author": "jhoneill",
      "author_association": "NONE",
      "body": "> > That's a very weak argument against the improvement.\r\n> \r\n> Our only policy is to keep backward compatibility. And even this is already unbelievable\r\nIt has limits. Any new switch for an existing cmdlet breaks things. Old scripts run on new PWSH (with relatively few exceptions)  but I've used things from PS 5 and found the customer's servers hadn't been upgraded from 4, I'm writing today in 7.2 and testing in 5 because it's Windows PowerShell only on these machines, so I can't use convertFrom-Secure string or the new operators etc. etc. \r\n\"Don't use X if you want the script to work down-level\" is OK advice. It's certainly better than \"You can't have X because then you can't run the script somewhere that you wouldn't want to :-) \r\n \r\n",
      "created_at": "2021-11-12T14:13:55Z",
      "updated_at": "2021-11-12T14:13:55Z"
    },
    {
      "author": "pencoe",
      "author_association": "NONE",
      "body": "I do like the idea from @jhoneill with the additional formatting property on custom properties the most: maximum flexibility, minimum impact on existing cmdlets.",
      "created_at": "2021-11-24T09:04:16Z",
      "updated_at": "2021-11-24T09:04:16Z"
    },
    {
      "author": "doctordns",
      "author_association": "COLLABORATOR",
      "body": "It sounds like there is agreement over extending `Format-List` and `Format-Table` to have a format enumeration limit overriding the default set in the `$FormatEnumerationLImit` automatic variable.  \r\n\r\nThere are TWO ideas on the table: A SIMPLE one (adding an *-EnumerationLimit* parameter to the cmdlets that override the auto variable. The second one, more complex, is to extend the hash table used to form a column to specify the enumeration limit for just one property.\r\n\r\nI can live with either. But in keeping with the best traditions of PowerShell, can we have both?",
      "created_at": "2021-11-24T12:24:42Z",
      "updated_at": "2021-11-24T12:24:42Z"
    },
    {
      "author": "doctordns",
      "author_association": "COLLABORATOR",
      "body": "Any more suggestions here?\r\n\r\nIs there any interest in improving the Format-* cmdlet. Sadly, I do not have the skills to do the coding.",
      "created_at": "2021-11-27T10:29:11Z",
      "updated_at": "2021-11-27T10:29:11Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "@doctordns This code is too confusing and poorly covered by tests. The creation of new features there is most likely unjustified due to the complexity. Perhaps it is worth rethinking the accumulated experience and new ideas (like PSMore) and design a new more flexible formatting subsystem.\r\n\r\n",
      "created_at": "2021-11-27T17:34:52Z",
      "updated_at": "2021-11-27T17:34:52Z"
    }
  ],
  "created_at": "2021-11-02T14:41:22Z",
  "number": 16360,
  "state": "open",
  "title": "Add -FormatEnumerationLimit parameter to Format-List and Format-Table",
  "updated_at": "2021-11-27T17:34:52Z"
}