{
  "_url": "https://github.com/PowerShell/PowerShell/issues/1639",
  "author": "andschwa",
  "body": "- [x] Resolves issue #954.\n- [x] Code is [rebased](https://github.com/PowerShell/PowerShell/blob/master/docs/git/README.md#sync-your-local-repo) on `origin/master`.\n- [ ] Add tests that fail without your changes. **Pending**\n- [ ] Update all relevant [documentation](https://github.com/PowerShell/PowerShell/tree/master/docs). **Pending**\n\nEnable path globbing for native commands\n\nE.g. `ls *.md` expands to `ls /path/to/README.md /path/to/CHANGELOG.md`\n\nIf expansion fails, the argument is sent literally, so `ls foo*` results in `/usr/bin/ls: cannot access foo*: No such file or directory`.\n\nDon't glob expand if the verbatim marker was used.\n\n/cc @lzybkr @JamesWTruher \n\nAfter tracing what the native command parameter binder does, it seems most reasonable to add this logic to `appendOneNativeArgument`. I know that doesn't sound right, but in fact it already deals with being sent an argument that gets expanded to a list. However I could be completely wrong, as the code around here is a bit strange.\n\nWhen a `parameter.ParameterNameSpecified` is true, we don't want to glob, as this correlates to `-flag`. Moreover, the `CommandParameterInternal` should probably be updated to interpret `--flag` as a `Parameter` (instead of an `Argument`); as it does not currently.\n\nWe want to glob when `parameter.ArgumentSpecified` is true, and only once it's been converted to a string (or expanded to a set of strings) (which happens in the poorly named `appendOneNativeArgument` function).\n\nWe do not want to glob if the `--%` verbatim marker was seen.\n\nI need to add tests, but figured I'd get this up for review.\n\nAlso I already have one known bug: globbing doesn't appear to work for `.dotfiles`. So although `*.md` works, `.gi*` and `*git*` does not work. But it doesn't have anything to do with these changes, it fails similarly for `Get-ChildItem` too. I'll file a bug report tomorrow.\n",
  "closed_at": "2016-08-06T01:23:14Z",
  "comments": [
    {
      "author": "andschwa",
      "author_association": "MEMBER",
      "body": "The globber doesn't appear to be handling escapes.\n",
      "created_at": "2016-08-04T01:52:02Z",
      "updated_at": "2016-08-04T01:52:02Z"
    },
    {
      "author": "lzybkr",
      "author_association": "MEMBER",
      "body": "The failures are legit - in some cases we can't glob.\n\nAt a minimum, I think we can't do globbing on Windows at all - Windows tools implement globbing themselves, so even if we did something, it might work differently than the tool we're calling.\n\nThat said, we still need to be smarter somehow as the test failure demonstrates (basically `powershell -command \"[Console]::WriteLine(1)\"`.  I think we're treating the left of `::` as a provider (like filesystem) and don't recognize it as a provider.\n\nAt a minimum, I think we need a way to escape globbing characters, but that's messy.  `--%` helps here, the test failure wouldn't be a problem in this implementation if it used `--%`, but that's half the solution because you may want to mix arguments with globbing and no globbing, hence the need for some escape.\n\nThe question is - where do process escapes?  If it was just in the native command processor, it's less risky, but also less useful.  If we do it in the globbing code, we also run a greater risk of breaking something.\n\nI'm fine with punting the escape character for now, make that an issue, but put the globbing under `#if UNIX` and fix the test to use `--%`.\n",
      "created_at": "2016-08-05T02:18:28Z",
      "updated_at": "2016-08-05T02:18:28Z"
    },
    {
      "author": "TravisEz13",
      "author_association": "MEMBER",
      "body": "Removed review needed since tests are failing...\n",
      "created_at": "2016-08-06T00:50:30Z",
      "updated_at": "2016-08-06T00:50:30Z"
    },
    {
      "author": "andschwa",
      "author_association": "MEMBER",
      "body": "Closing until I get back to this. Thanks for the review!\n",
      "created_at": "2016-08-06T01:23:13Z",
      "updated_at": "2016-08-06T01:23:13Z"
    }
  ],
  "created_at": "2016-08-04T01:32:47Z",
  "number": 1639,
  "state": "closed",
  "title": "Enable path globbing for native commands",
  "updated_at": "2020-05-27T20:45:00Z"
}