{
  "_url": "https://github.com/PowerShell/PowerShell/issues/16522",
  "author": "schittli",
  "body": "### Summary of the new feature / enhancement\r\n\r\nGood morning\r\n\r\nit's great to have many PowerShell users - it's a great 'tool', thanks a lot for your great work!\r\n\r\n### … but it's **very** annoying, that all those PowerShell users get this notification:\r\n```\r\n   A new PowerShell stable release is available: …\r\n   Upgrade now, or check out the release page at:\r\n   https://aka.ms/PowerShell-Release?tag=…\r\n```\r\n\r\n### The problem is, that most Users will start this process:\r\n1. _\"A new release? - great!\"_\r\n2. But: _\"How can I upgrade PowerShell??\"_\r\n3. _\"… ok, I'll upgrade it anytime later, I don't have time to ask google\"_\r\n\r\n### Therefore: please tell how PowerShell can be upgraded in the upgrade notification!\r\n\r\nSomething like this:\r\n```\r\n   A new PowerShell stable release is available: …\r\n   Start upgrade by calling: …\r\n   The Release Notes: https://aka.ms/PowerShell-Release?tag=…\r\n```\r\n\r\nThanks a lot, kind regards,\r\nThomas\r\n\r\n### Proposed technical implementation details (optional)\r\n\r\n_No response_",
  "closed_at": "2021-11-28T20:00:42Z",
  "comments": [
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "It is not clear that you ask. The link in the notice open a page where you can download PowerShell distributive from.",
      "created_at": "2021-11-26T16:26:13Z",
      "updated_at": "2021-11-26T16:26:13Z"
    },
    {
      "author": "rkeithhill",
      "author_association": "COLLABORATOR",
      "body": "As @iSazonov points out, that link takes you to the downloads page (scroll past the release notes) for the updated version of PowerShell.  However, there are a number of ways PowerShell could be installed.  So the upgrade process isn't really a single upgrade process as it depends on how you installed PowerShell: direct MSI download, Windows Store, winget, Chocolatey, dotnet global tool, apt, yum, snap, homebrew, etc.  \r\n\r\nRelated to #8663",
      "created_at": "2021-11-26T18:31:11Z",
      "updated_at": "2021-11-26T18:32:44Z"
    },
    {
      "author": "msftbot[bot]",
      "author_association": "NONE",
      "body": "This issue has been marked as duplicate and has not had any activity for **1 day**. It has been closed for housekeeping purposes.",
      "created_at": "2021-11-28T20:00:41Z",
      "updated_at": "2021-11-28T20:00:41Z"
    },
    {
      "author": "ap-waaijenberg",
      "author_association": "NONE",
      "body": "The given PowerShell-Release page is quite confusing. I've eventually found the (huge) table of links to download the many version of installers somewhere in the middle. \r\nI would expect to run the command \"upgrade\" and the smart software that knows I need an upgrade, knows the version I am running, and knows where to find the new stuff just ask if I want Latest, Stable or Preview and start the download itself. That would have been neat.\r\nWhy not dream that it tells me \"there is a new stable version X.Y.Z available, do you want to install it [Y/N]?\"?",
      "created_at": "2022-05-11T16:02:23Z",
      "updated_at": "2022-05-11T16:02:23Z"
    },
    {
      "author": "doctordns",
      "author_association": "COLLABORATOR",
      "body": "We can do better. ",
      "created_at": "2022-05-11T16:25:35Z",
      "updated_at": "2022-05-11T16:25:35Z"
    },
    {
      "author": "m4heshd",
      "author_association": "NONE",
      "body": "Can't remember how I installed it in the first place _(since there are 100 million ways to install powershell)_ and have no idea how to update it now. 😔",
      "created_at": "2022-08-14T23:56:28Z",
      "updated_at": "2022-08-14T23:56:44Z"
    },
    {
      "author": "doctordns",
      "author_association": "COLLABORATOR",
      "body": "Google is your friend! \r\n\r\nYou have options. You can go to github to download the install-powershelll.ps1 script and  use that. Or, assuming you enabled update by MS update just wait. It seems to take MSFT to get the updates from GitHub go MU (do they use the USPS??) So be patient.",
      "created_at": "2022-08-15T09:38:56Z",
      "updated_at": "2022-08-15T09:39:54Z"
    },
    {
      "author": "m4heshd",
      "author_association": "NONE",
      "body": "> Or, assuming you enabled update by MS update just wait\r\n\r\nI actually realized this right after I left the comment because I downloaded the installer from the latest release and my previous download was there. Then when I ran the installer once more, I've realized I enabled updates via WU the last time I've installed it. PS seems to have updated once or twice since then. 😁 So all good. Thanks for the response.",
      "created_at": "2022-08-15T11:59:10Z",
      "updated_at": "2022-08-15T11:59:10Z"
    },
    {
      "author": "leonheess",
      "author_association": "NONE",
      "body": "How can I upgrade??",
      "created_at": "2022-10-19T09:22:26Z",
      "updated_at": "2022-10-19T09:22:26Z"
    },
    {
      "author": "doctordns",
      "author_association": "COLLABORATOR",
      "body": "> How can I upgrade??\r\n\r\nYou have two main options.\r\nIf you have the ```Install-PowerShell.ps1``` script (you can find it here in this repo), just run it - the script downloads and runs the latest MSI. Note when you run it, you have the option of updating via MS Update (ensure it's checked).\r\nIf you have enabled updating via MU, then can just wait. It takes a couple of weeks after release to GitHub before MSFT can get it over to MU. I am not sure WHY it takes so long, but it does work. ",
      "created_at": "2022-10-19T13:50:05Z",
      "updated_at": "2022-10-19T13:50:05Z"
    }
  ],
  "created_at": "2021-11-26T12:01:49Z",
  "number": 16522,
  "state": "closed",
  "title": "Notification: \"A new PowerShell stable release is available: …\" - a small but most useful improvement",
  "updated_at": "2022-10-19T13:50:05Z"
}