{
  "_url": "https://github.com/PowerShell/PowerShell/issues/16845",
  "author": "reaching-for-libra",
  "body": "### Summary of the new feature / enhancement\n\nIt would be great to have more control over the results from the Select-String cmdlet.  \r\n\r\nOne use case would be to colorize the Path that is shown. Presently - the matched value is emphasized, which is great. However, if there are long paths in the results - then it can be difficult to separate the Path from the Line that displays in the output.\r\n\r\nIt would be nice to customize the color of the Emphasis, as well. \r\n\r\nIt seems like leveraging PSStyle would be a great way to put this into action, similar to how the FileInfo options are used.\r\n\n\n### Proposed technical implementation details (optional)\n\n_No response_",
  "closed_at": null,
  "comments": [
    {
      "author": "jhoneill",
      "author_association": "NONE",
      "body": "These are all good points. \r\nFor background: \r\nThe `matchinfo` objects that `Select-String` returns have properties for the match (giving the range to emphasize), the  line,  context either side of the line, the line number, the full path, and filename.   \r\nTurning these into what you see displayed isn't done via the formatting data where it it would be easier to modify; but was originally in the `ToString()` method and when emphasis was added so was `ToEmphasizedString()`    \r\nAnd the formatting info says to display a MatchInfo Object  use the  `ToEmphasizedString()` method.  - you can see this with \r\n```\r\nGet-FormatData   Microsoft.PowerShell.Commands.MatchInfo | % FormatViewDefinition | % control | % entries | % customitems | % expression | %  value\r\n```\r\n\r\nCustomizing what is in those methods isn't really practical, but putting what they do into the format data would work.  So I've done that. \r\n\r\n![image](https://user-images.githubusercontent.com/16209593/152678641-683da5d3-dfcb-472d-b82f-c394a28f6de9.png)\r\n\r\nYou can download the format xml file  from https://gist.github.com/jhoneill/84150b5ab5fe3317b0b7104e15ce3e5f \r\nLoad it with `Update-formatData -PrependPath MatchInfo.format.ps1xml`  (Append path didn't work, to over-ride what's there it needs to be prepend). \r\nIn an ideal world the options would extend `$PsStyle` but for now they're standalone. A PSobject should work but I use a hash-table  **in the screen shot part of this was cropped out** :-)  \r\n```\r\n$MatchInfoPreference =@{Prefix='--> '; MatchVTSeq=$PSStyle.Underline; PathVTSeq=$PSStyle.Foreground.Yellow; NumberVTSeq=''; ContextVTSeq=$PSStyle.Foreground.BrightBlack}\r\n```\r\n\r\n \r\n\r\n<blockquote><img src=\"https://github.githubassets.com/images/modules/gists/gist-og-image.png\" width=\"48\" align=\"right\"><div><img src=\"https://github.githubassets.com/favicons/favicon.svg\" height=\"14\"> Gist</div><div><strong><a href=\"https://gist.github.com/jhoneill/84150b5ab5fe3317b0b7104e15ce3e5f\">MatchInfo.format.ps1xml</a></strong></div><div>GitHub Gist: instantly share code, notes, and snippets.</div></blockquote>",
      "created_at": "2022-02-06T11:31:37Z",
      "updated_at": "2022-02-06T11:34:55Z"
    },
    {
      "author": "reaching-for-libra",
      "author_association": "NONE",
      "body": "that's a pretty effective workaround, I hadn't thought of overriding the format files. i used to something similar in the past by overriding out-default, but that had some performance issues.",
      "created_at": "2022-02-07T13:52:09Z",
      "updated_at": "2022-02-07T13:52:09Z"
    },
    {
      "author": "237dmitry",
      "author_association": "NONE",
      "body": ">  I hadn't thought of overriding the format files\r\n\r\n`Update-FormatData` does not override any files. Formatting just prepends with custom data for current session.",
      "created_at": "2022-02-07T15:04:28Z",
      "updated_at": "2022-02-07T15:04:28Z"
    },
    {
      "author": "reaching-for-libra",
      "author_association": "NONE",
      "body": "fair enough - poor wording on my part.",
      "created_at": "2022-02-07T15:06:23Z",
      "updated_at": "2022-02-07T15:06:23Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "WG-Engine discussed this today (5/12/2022).\r\n\r\nWe agree having the ability to customise this in $PSStyle makes a lot of sense. Our opinion is that limiting this just for customising MatchInfo itself is probably a bit too narrow-scoped given the general scope of $PSStyle, but it does seem to be the correct place to put this kind of customisation.\r\n\r\nAs a result, our suggestion is that:\r\n\r\n- $PSStyle should be augmented to include a setting for `TextEmphasis` which can be customised by users\r\n- The default value for this property should match the current formatting sequence for MatchInfo emphasis\r\n- MatchInfo's formatting should be updated to use the formatting sequence from $PSStyle in its formatting to permit the customisations from users to take effect there.\r\n\r\nIt is well within the realm of possibility that other cmdlets, even community modules, would be able to make use of this emphasis and get by default a level of customisability from this kind of change, which we think would be valuable.\r\n\r\nHowever, the PowerShell team may not currently have the resources to take on the implementation of this change directly. As such, we've marked it Up for Grabs and would be more than happy to accept a contribution for this change if interested parties are willing to look at making the changes themselves. 🙂 \r\n\r\n/ccing @SteveL-MSFT here as well as it falls under some of the code he's most familiar with and he may be able to provide more specific pointers on implementation details. ",
      "created_at": "2022-05-12T21:23:25Z",
      "updated_at": "2022-05-12T21:23:25Z"
    },
    {
      "author": "jhoneill",
      "author_association": "NONE",
      "body": "I agree with the opening point that PS style having a different emphasis for this, that and the other is probably not the way to go and I like that suggestion.  \r\n\r\nIf the resources _can_ be found so that people can start using this new `TextEmphasis`  asap - instead of doing 101 forms of emphasis of their own design - that would be a positive.   ",
      "created_at": "2022-05-13T08:53:11Z",
      "updated_at": "2022-05-13T08:53:11Z"
    }
  ],
  "created_at": "2022-02-04T18:23:44Z",
  "labels": [
    "Issue-Enhancement",
    "Up-for-Grabs",
    "WG-Engine-Format"
  ],
  "number": 16845,
  "state": "open",
  "title": "Suggestion: PSStyle usage for MatchInfo object",
  "updated_at": "2022-05-13T08:53:11Z"
}