{
  "_url": "https://github.com/PowerShell/PowerShell/issues/16995",
  "author": "jborean93",
  "body": "# PR Summary\r\n\r\nFixes handling on tmp dirs or process names that exceed the 108 character limit of a unix domain socket on non-Windows hosts. This PR ensures that the trimming of socket names take into account:\r\n\r\n* The dir path length it is created in\r\n* The null char at the end of the path\r\n* It always has enough space for unique attributes of the proc and skips creating if it doesn't\r\n\r\n## PR Context\r\n\r\nFixes https://github.com/PowerShell/PowerShell/issues/16994\r\n\r\n## PR Checklist\r\n\r\n- [x] [PR has a meaningful title](https://github.com/PowerShell/PowerShell/blob/master/.github/CONTRIBUTING.md#pull-request---submission)\r\n    - Use the present tense and imperative mood when describing your changes\r\n- [x] [Summarized changes](https://github.com/PowerShell/PowerShell/blob/master/.github/CONTRIBUTING.md#pull-request---submission)\r\n- [x] [Make sure all `.h`, `.cpp`, `.cs`, `.ps1` and `.psm1` files have the correct copyright header](https://github.com/PowerShell/PowerShell/blob/master/.github/CONTRIBUTING.md#pull-request---submission)\r\n- [x] This PR is ready to merge and is not [Work in Progress](https://github.com/PowerShell/PowerShell/blob/master/.github/CONTRIBUTING.md#pull-request---work-in-progress).\r\n    - If the PR is work in progress, please add the prefix `WIP:` or `[ WIP ]` to the beginning of the title (the `WIP` bot will keep its status check at `Pending` while the prefix is present) and remove the prefix when the PR is ready.\r\n- **[Breaking changes](https://github.com/PowerShell/PowerShell/blob/master/.github/CONTRIBUTING.md#making-breaking-changes)**\r\n    - [ ] None\r\n    - **OR**\r\n    - [ ] [Experimental feature(s) needed](https://github.com/MicrosoftDocs/PowerShell-Docs/blob/staging/reference/6/Microsoft.PowerShell.Core/About/about_Experimental_Features.md)\r\n        - [ ] Experimental feature name(s): <!-- Experimental feature name(s) here -->\r\n- **User-facing changes**\r\n    - [ ] Not Applicable\r\n    - **OR**\r\n    - [ ] [Documentation needed](https://github.com/PowerShell/PowerShell/blob/master/.github/CONTRIBUTING.md#pull-request---submission)\r\n        - [ ] Issue filed: <!-- Number/link of that issue here -->\r\n- **Testing - New and feature**\r\n    - [ ] N/A or can only be tested interactively\r\n    - **OR**\r\n    - [ ] [Make sure you've added a new test if existing tests do not effectively test the code changed](https://github.com/PowerShell/PowerShell/blob/master/.github/CONTRIBUTING.md#before-submitting)\r\n- **Tooling**\r\n    - [ ] I have considered the user experience from a tooling perspective and don't believe tooling will be impacted.\r\n    - **OR**\r\n    - [ ] I have considered the user experience from a tooling perspective and opened an issue in the relevant tool repository. This may include:\r\n        - [ ] Impact on [PowerShell Editor Services](https://github.com/PowerShell/PowerShellEditorServices) which is used in the [PowerShell extension](https://github.com/PowerShell/vscode-powershell) for VSCode\r\n        (which runs in a different PS Host).\r\n            - [ ] Issue filed: <!-- Number/link of that issue here -->\r\n        - [ ] Impact on Completions (both in the console and in editors) - one of PowerShell's most powerful features.\r\n            - [ ] Issue filed: <!-- Number/link of that issue here -->\r\n        - [ ] Impact on [PSScriptAnalyzer](https://github.com/PowerShell/PSScriptAnalyzer) (which provides linting & formatting in the editor extensions).\r\n            - [ ] Issue filed: <!-- Number/link of that issue here -->\r\n        - [ ] Impact on [EditorSyntax](https://github.com/PowerShell/EditorSyntax) (which provides syntax highlighting with in VSCode, GitHub, and many other editors).\r\n            - [ ] Issue filed: <!-- Number/link of that issue here -->\r\n",
  "closed_at": null,
  "comments": [
    {
      "author": "pull-request-quantifier[bot]",
      "author_association": "NONE",
      "body": "### ![](https://img.shields.io/static/v1?label=Quantified&message=Extra%20Small&color=green)\r\n\r\nThis PR has `19` quantified lines of changes. In general, a change size of upto `200` lines is ideal for the best PR experience!\r\n\r\n------\r\n\r\n<details >\r\n    <summary display=\"inline\"> <strong>Quantification details</strong></summary>\r\n    <p />\r\n\r\n```\r\nLabel      : Extra Small\r\nSize       : +13 -6\r\nPercentile : 7.6%\r\n\r\nTotal files changed: 1\r\n\r\nChange summary by file extension:\r\n.cs : +13 -6\r\n```\r\n> Change counts above are quantified counts, based on the [PullRequestQuantifier customizations](https://github.com/microsoft/PullRequestQuantifier/blob/main/docs/prquantifier-yaml.md).\r\n    \r\n</details>\r\n\r\n\r\n<details>\r\n    <summary display=\"inline\"> <strong>Why proper sizing of changes matters</strong> </summary>\r\n    <p/>\r\n    <p/>\r\n\r\nOptimal pull request sizes drive a better predictable PR flow as they strike a\r\nbalance between between PR complexity and PR review overhead. PRs within the\r\noptimal size (typical small, or medium sized PRs) mean:\r\n\r\n- Fast and predictable releases to production:\r\n  - Optimal size changes are more likely to be reviewed faster with fewer\r\niterations.\r\n  - Similarity in low PR complexity drives similar review times.\r\n- Review quality is likely higher as complexity is lower:\r\n  - Bugs are more likely to be detected.\r\n  - Code inconsistencies are more likely to be detetcted.\r\n- Knowledge sharing is improved within the participants:\r\n  - Small portions can be assimilated better.\r\n- Better engineering practices are exercised:\r\n  - Solving big problems by dividing them in well contained, smaller problems.\r\n  - Exercising separation of concerns within the code changes.\r\n\r\n#### What can I do to optimize my changes\r\n\r\n- Use the PullRequestQuantifier to quantify your PR accurately\r\n  - Create a context profile for your repo using the [context generator](https://github.com/microsoft/PullRequestQuantifier/releases)\r\n  - Exclude files that are not necessary to be reviewed or do not increase the review complexity. Example: Autogenerated code, docs, project IDE setting files, binaries, etc. Check out the `Excluded` section from your `prquantifier.yaml` context profile. \r\n  - Understand your typical change complexity, drive towards the desired complexity by adjusting the label mapping in your `prquantifier.yaml` context profile.\r\n  - Only use the labels that matter to you, [see context specification](./docs/prquantifier-yaml.md) to customize your `prquantifier.yaml` context profile.\r\n- Change your engineering behaviors\r\n  - For PRs that fall outside of the desired spectrum, review the details and check if:\r\n    - Your PR could be split in smaller, self-contained PRs instead\r\n    - Your PR only solves one particular issue. (For example, don't refactor and code new features in the same PR).\r\n\r\n#### How to interpret the change counts in git diff output\r\n\r\n- One line was added: `+1 -0`\r\n- One line was deleted: `+0 -1`\r\n- One line was modified: `+1 -1` (git diff doesn't know about modified, it will\r\ninterpret that line like one addition plus one deletion)\r\n- Change percentiles: Change characteristics (addition, deletion, modification)\r\nof this PR in relation to all other PRs within the repository.\r\n\r\n</details>\r\n\r\n<p />\r\n\r\n------\r\n\r\nWas this comment helpful? <a href=\"https://pullrequestquantifierfeedback.azurewebsites.net/feedback?payload=eyJBdXRob3JOYW1lIjoiamJvcmVhbjkzIiwiUmVwb3NpdG9yeUxpbmsiOiJodHRwczovL2dpdGh1Yi5jb20vUG93ZXJTaGVsbC9Qb3dlclNoZWxsIiwiUHVsbFJlcXVlc3RMaW5rIjoiaHR0cHM6Ly9naXRodWIuY29tL1Bvd2VyU2hlbGwvUG93ZXJTaGVsbC9wdWxsLzE2OTk1IiwiRXZlbnRUeXBlIjoiVGh1bWJzVXAifQ==&amp;anonymous=True\" target=\"_blank\" title=\"Thumbs up\"><strong>:thumbsup:</strong></a> <a href=\"https://pullrequestquantifierfeedback.azurewebsites.net/feedback?payload=eyJBdXRob3JOYW1lIjoiamJvcmVhbjkzIiwiUmVwb3NpdG9yeUxpbmsiOiJodHRwczovL2dpdGh1Yi5jb20vUG93ZXJTaGVsbC9Qb3dlclNoZWxsIiwiUHVsbFJlcXVlc3RMaW5rIjoiaHR0cHM6Ly9naXRodWIuY29tL1Bvd2VyU2hlbGwvUG93ZXJTaGVsbC9wdWxsLzE2OTk1IiwiRXZlbnRUeXBlIjoiTmV1dHJhbCJ9&amp;anonymous=True\" target=\"_blank\" title=\"Neutral\"><strong>&nbsp;:ok_hand:</strong></a> <a href=\"https://pullrequestquantifierfeedback.azurewebsites.net/feedback?payload=eyJBdXRob3JOYW1lIjoiamJvcmVhbjkzIiwiUmVwb3NpdG9yeUxpbmsiOiJodHRwczovL2dpdGh1Yi5jb20vUG93ZXJTaGVsbC9Qb3dlclNoZWxsIiwiUHVsbFJlcXVlc3RMaW5rIjoiaHR0cHM6Ly9naXRodWIuY29tL1Bvd2VyU2hlbGwvUG93ZXJTaGVsbC9wdWxsLzE2OTk1IiwiRXZlbnRUeXBlIjoiVGh1bWJzRG93biJ9&amp;anonymous=True\" target=\"_blank\" title=\"Thumbs down\"><strong>&nbsp;:thumbsdown:</strong></a> (<a href=\"MAILTO:prquantifier@microsoft.com\" title=\"Mail to prquantifier@microsoft.com\">Email</a>)\r\n[Customize PullRequestQuantifier](https://github.com/PowerShell/PowerShell/blob/master/.github/prquantifier.yaml) for this repository.\r\n\r\n",
      "created_at": "2022-03-14T06:13:49Z",
      "updated_at": "2022-03-14T06:13:49Z"
    },
    {
      "author": "PaulHigin",
      "author_association": "COLLABORATOR",
      "body": "Adding @SeeminglyScience  since I believe the VSCode extension uses this for process attach debugging.  Also, the extension uses custom named pipes, but I don't think this change affects that.",
      "created_at": "2022-03-14T17:39:37Z",
      "updated_at": "2022-03-14T17:39:37Z"
    },
    {
      "author": "jborean93",
      "author_association": "COLLABORATOR",
      "body": "> I don't like this trimming algorithm. We should create a minimum acceptable pipe name, and if it is too long to implement, then throw an error.\r\n\r\nI agree but that is the current implementation today, this PR is just trying to get it working again. If you wish to not even support trimming I'm happy to remove all that code and just rely on the pipe either being created and long paths failing during that phase. The trouble with a minimum acceptable pipe name is that it has 2 parts that can be variable:\r\n\r\n* The pipe path as it relies on whatever `TMPDIR` is set to\r\n* The process name as it relies on whatever the executable is called\r\n\r\nThe rest is quite small today but even attempting to change it will result in a breaking change so there's not much we can do to slim it down more.\r\n\r\n> Name uniqueness is important to prevent spoofing attack, so we don't want to arbitrarily trim it ... I like the addition of required unique length, and I feel 8 digits provides enough uniqueness for non-Windows platforms.\r\n\r\nYea that's why I set the minimum length to include the process start time and pid. I can change it to only do the start time if that is your wish but at that point we are only really saving ~5 characters so it's going to be very limited in it's use. Ultimately a longer pipe path is broken today and if you wish to remove the complexity here I'll be happy with that as well.\r\n\r\n>  Also, the extension uses custom named pipes, but I don't think this change affects that.\r\n\r\nIf I understand correctly that shouldn't be affected by this but more than happy ot have some more reviews.",
      "created_at": "2022-03-14T19:23:22Z",
      "updated_at": "2022-03-14T19:23:22Z"
    },
    {
      "author": "PaulHigin",
      "author_association": "COLLABORATOR",
      "body": "@jborean93  Thanks for looking into this. I am still troubled by this trimming approach (nothing to do with your changes, but the original code is troubling). I will mark this both for WG-Security group review and committee review.",
      "created_at": "2022-03-14T19:38:25Z",
      "updated_at": "2022-03-14T19:38:25Z"
    },
    {
      "author": "jborean93",
      "author_association": "COLLABORATOR",
      "body": "Sounds like a great idea, I do prefer just failing implicitly if it exceeds the path as it will simplify the code in general so if that's the prefer approach based on the WG then I'm happy to remove all of the trimming code.",
      "created_at": "2022-03-14T19:41:04Z",
      "updated_at": "2022-03-14T19:41:04Z"
    },
    {
      "author": "jborean93",
      "author_association": "COLLABORATOR",
      "body": "Looks like the limit will have to be set to 103 (+ NULL char = 104) as that's the limit on macOS. If WG-Security does decide to continue trimming the length then that value would need to be updated in the PR to handle this.",
      "created_at": "2022-03-14T20:22:08Z",
      "updated_at": "2022-03-14T20:22:08Z"
    },
    {
      "author": "PaulHigin",
      "author_association": "COLLABORATOR",
      "body": "@WG-Security  The group discussed this and feel this is not a security issue since connecting with `Enter-PSHostProcess` is broken if the namedpipe pathName is trimmed.  However, the API will allow connection to truncated pipe NamePaths.  \r\n\r\nThe working group recommends:\r\n1.  Named pipe names should not be arbitrarily trimmed.\r\n2.  This pipe name creation code should be re-written to create the smallest name possible, while still having acceptable uniqueness.  If name/path is too long then throw and error (for PowerShell simply do not start a named pipe listener).\r\n3. This will be a breaking change, but can be mitigated by having `Enter-PSHostProcess` check for both old and new naming conventions when attempting to connect to a local PowerShell hosted process.",
      "created_at": "2022-03-14T21:33:48Z",
      "updated_at": "2022-03-14T21:33:48Z"
    },
    {
      "author": "jborean93",
      "author_association": "COLLABORATOR",
      "body": "I'm totally happy with the outcome, would be great to simplify the code.\r\n\r\n> This pipe name creation code should be re-written to create the smallest name possible, while still having acceptable uniqueness. If name/path is too long then throw and error (for PowerShell simply do not start a named pipe listener).\r\n\r\nThis makes sense but brings up the next question, what is considered unique. Right now the pipe is essentially `/tmp/CoreFxPipe_PSHost.{start_time}.{pid}.None.{proc_name}`. Can we safely remove any of those parts (Culture/None would be one of them) but the process name will always lead to some variable length potentially exceeding the max length.\r\n\r\nA potential option is to hash the same name format and just have `/tmp/CoreFxPipe_{hash}`. This allows pwsh to have a name as long as it wants for uniqueness with a fixed pipe name length. The only variable part here would be if someone has changed their `TMPDIR` env var to something other than `/tmp`. If this is desired the question would be what algorithm to use, here is what they would look like\r\n\r\n|Algorithm|Value|Length|\r\n|-|-|-|\r\n|None|/tmp/CoreFxPipe_PSHost.D837E104.23097.None.pwsh|47|\r\n|MD5|/tmp/CoreFxPipe_f970e2767d0cfe75876ea857f92e319b|48|\r\n|SHA1|/tmp/CoreFxPipe_a9993e364706816aba3e25717850c26c9cd0d89d|59|\r\n|SHA256|/tmp/CoreFxPipe_ba7816bf8f01cfea414140de5dae2223b00361a396177a9cb410ff61f20015ad|80|\r\n\r\nMD5 while close may not be workable in FIPS enabled hosts + may not be secure enough for what pwsh is trying to avoid. SHA1 is only slightly longer but I'm also unsure if it's ok to use in this type of scenario. SHA256 should be unique enough to avoid collisions but is a bit longer. Considering the variability comes from the `TMPDIR` path maybe that's an acceptable compromise.\r\n\r\nTechnically we could even shorten this even more by defining a rooted path as the pipe name, say `/tmp/PS_{hash}` to avoid the `CoreFxPipe_` prefix if we wanted to eek out a few more characters available for a custom `TMPDIR`. The disadvantages I see this this are:\r\n\r\n* I'm unsure how long .NET supported a rooted path pipe name so older pwsh versions may not work\r\n* A client would also need to pass in a rooted path for the pipe name when connecting to it, today they just need to specify the `PSHost_...` part\r\n* Does the extra complexity really offset the advantages here?\r\n\r\nAnother question that comes up is whether the same change should happen on Windows. Should it also have the same setup or continue being what it does today?",
      "created_at": "2022-03-14T22:01:00Z",
      "updated_at": "2022-03-14T22:01:00Z"
    },
    {
      "author": "PaulHigin",
      "author_association": "COLLABORATOR",
      "body": "Yes, good question about uniqueness.  We did talk about hashing, and that is a possibility.  However, I feel that process start time ticks is probably good enough to prevent spoofing.  Also it would be nice to keep some human readable part of the pipe name.\r\n\r\nIn any case (sorry I forgot to mention this) but please hold off any changes until the committee has reviewed the proposal.\r\n\r\nThe @WG-Security group feels we need to keep backwards compatibility (connecting to older PowerShell Core as well as WindowsPowerShell versions).  But forward compatibility can be broken.",
      "created_at": "2022-03-14T22:09:24Z",
      "updated_at": "2022-03-14T22:18:47Z"
    },
    {
      "author": "jborean93",
      "author_association": "COLLABORATOR",
      "body": "> In any case (sorry I forgot to mention this) but please hold off any changes until the committee has reviewed the proposal.\r\n\r\nNo worries, will wait to hear back when a clearer path is decided.",
      "created_at": "2022-03-14T22:16:38Z",
      "updated_at": "2022-03-14T22:16:38Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "@PowerShell/powershell-committee reviewed this, we are ok with using a hash for the pipename and keeping it as short as possible, but an identifier for PowerShell (like `pwsh`) so that `Get-PSHostProcessInfo` can discover pwsh named pipes to connect to.  We agree to retain backwards compatibility (so a newer PS7 client and discover older host processes) and not forward compatibility.",
      "created_at": "2022-03-16T22:27:17Z",
      "updated_at": "2022-03-16T22:27:17Z"
    },
    {
      "author": "msftbot[bot]",
      "author_association": "NONE",
      "body": "This pull request has been automatically marked as Review Needed because it has been there has not been any activity for **7 days**.\nMaintainer, please provide feedback and/or mark it as `Waiting on Author`",
      "created_at": "2022-03-24T02:00:40Z",
      "updated_at": "2022-03-24T02:00:40Z"
    }
  ],
  "created_at": "2022-03-14T05:56:46Z",
  "number": 16995,
  "state": "open",
  "title": "Improve handling of long named pipe server names on non-Windows hosts",
  "updated_at": "2022-03-24T02:00:41Z"
}