{
  "_url": "https://github.com/PowerShell/PowerShell/issues/17176",
  "author": "Shayan-To",
  "body": "### Summary of the new feature / enhancement\n\nPowerShell now expands the globs when using native commands on Linux. This is very inconvenient to me for a few reasons:\r\n\r\n- I use PowerShell on both Linux and Windows, and I have to always be cautious so that I don't make mistakes. (I can use `git checkout master -- *` on Windows, but I have to quote the `*` on Linux. It was really scary when I once ran `yarn up **` on Linux...)\r\n- When working with `bash`, I know that it will always expand the globs I use. When working with PowerShell on Windows, I know that it will never do that. But on Linux, it has an inconsistent behavior that I have to think about before running commands. (This gets worse when the same command can mean different things on Windows and Linux, like `rm` and `ls` and the likes.)\r\n- PowerShell glob expansion still needs work (#15959 and #13098 for example), and I don't want to get caught in the middle of my work.\r\n- I don't like glob expansion in bash anyways. It is a somewhat scary feature to me. (I almost always quote my wildcards in bash, if the command I'm using recognizes them (like `git`), or switch to PowerShell if it doesn't.)\n\n### Proposed technical implementation details (optional)\n\nAdd a configuration to PowerShell to disable glob expansion on Linux, or if such configuration already exists, include a mention to it in the docs ([here](https://docs.microsoft.com/en-us/powershell/scripting/whats-new/unix-support) for example).",
  "closed_at": null,
  "comments": [
    {
      "author": "andrewhickman",
      "author_association": "NONE",
      "body": "This is particularly annoying with the splat operator. For example,\r\n```\r\n$arguments = @('*')\r\nprintf @arguments\r\n```\r\nOn linux, this is treated as a glob and I don't think there's any way to escape it.",
      "created_at": "2022-07-15T17:29:12Z",
      "updated_at": "2022-07-15T17:29:12Z"
    }
  ],
  "created_at": "2022-04-22T10:00:39Z",
  "labels": [
    "Issue-Enhancement",
    "WG-Engine-Providers",
    "Needs-Triage"
  ],
  "number": 17176,
  "state": "open",
  "title": "Add an option to disable globbing on Linux",
  "updated_at": "2022-07-15T17:29:12Z"
}