{
  "_url": "https://github.com/PowerShell/PowerShell/issues/17242",
  "author": "griesi007",
  "body": "### Prerequisites\n\n- [X] Write a descriptive title.\n- [X] Make sure you are able to repro it on the [latest released version](https://github.com/PowerShell/PowerShell/releases)\n- [X] Search the existing issues.\n- [X] Refer to the [FAQ](https://github.com/PowerShell/PowerShell/blob/master/docs/FAQ.md).\n- [X] Refer to [Differences between Windows PowerShell 5.1 and PowerShell](https://docs.microsoft.com/powershell/scripting/whats-new/differences-from-windows-powershell).\n\n### Steps to reproduce\n\nModifying ExecutionPolicy with PowerShell 7.2.2 does not work correctly. When I set ExecutionPolicy to Unrestricted using \"Set-ExecutionPolicy Unrestricted\" the RegistrySetting Computer\\HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\PowerShell\\1\\ShellIds\\Microsoft.PowerShell\\ExecutionPolicy is still set to \"Restricted\", even after refreshing / rebooting and all ps scripts are blocked. When checking with Get-ExecutionPolicy -List the result is \"Unrestricted\" for local maching and undefined for all other scopes, so obviously the setting is somehow set but does not have any effect\r\n\r\nWhen I do the same using PowerShell 5.1 everything works as expected. \r\n\r\nAlso when running Get-ExecutionPolicy -List in both versions different results are displayed\r\n\r\n![Screenshot 2022-05-02 115035](https://user-images.githubusercontent.com/2854973/166216231-2b35a68c-3960-4e93-a281-01b729894e96.png)\r\n\r\n\n\n### Expected behavior\n\n```console\nPowerShell 7.2.2 should identically work as PowerShell 5 when modifying/Listing ExecutionPolicy\n```\n\n\n### Actual behavior\n\n```console\nPowerShell 7.2.2 not modifies ExecutionPolicy correctly\n```\n\n\n### Error details\n\n_No response_\n\n### Environment data\n\n```powershell\nWindows 10 Professional 19043, Single unmanaged Workstation (not part of a domain or AD)\r\n\r\nName                           Value\r\n----                           -----\r\nPSVersion                      7.2.2\r\nPSEdition                      Core\r\nGitCommitId                    7.2.2\r\nOS                             Microsoft Windows 10.0.19043\r\nPlatform                       Win32NT\r\nPSCompatibleVersions           {1.0, 2.0, 3.0, 4.0…}\r\nPSRemotingProtocolVersion      2.3\r\nSerializationVersion           1.1.0.1\r\nWSManStackVersion              3.0\n```\n\n\n### Visuals\n\n\r\nhttps://user-images.githubusercontent.com/2854973/166218680-bfb3b0a5-290e-4b54-b665-15d3ea0b05da.mp4\r\n\r\n",
  "closed_at": "2022-05-05T06:29:09Z",
  "comments": [
    {
      "author": "jborean93",
      "author_association": "COLLABORATOR",
      "body": "How did you install pwsh? If it was through the Windows Store then I believe this is a known problem https://docs.microsoft.com/en-us/powershell/scripting/install/installing-powershell-on-windows?view=powershell-7.2#installing-from-the-microsoft-store\r\n\r\nA UWP application has a virtualized registry hive and some registry hives, like HKLM, are overlayed on top of the actual hive so changes made in pwsh are not applied globally but to that application's \"sandbox\".\n\n<blockquote><img src=\"https://docs.microsoft.com/media/logos/logo-powershell-social.png\" width=\"48\" align=\"right\"><div><strong><a href=\"https://docs.microsoft.com/en-us/powershell/scripting/install/installing-powershell-on-windows\">Installing PowerShell on Windows - PowerShell</a></strong></div><div>Information about installing PowerShell on Windows</div></blockquote>",
      "created_at": "2022-05-02T19:32:47Z",
      "updated_at": "2022-05-02T19:32:49Z"
    },
    {
      "author": "griesi007",
      "author_association": "NONE",
      "body": "@jborean93 it is installed through winget, which is an MSI Installation as far as I know. So this shouldn´t be the case?",
      "created_at": "2022-05-02T20:24:42Z",
      "updated_at": "2022-05-02T20:26:52Z"
    },
    {
      "author": "jborean93",
      "author_association": "COLLABORATOR",
      "body": "I'm not sure, they seem to have an entry for both msi and msix/appx https://github.com/microsoft/winget-pkgs/blob/master/manifests/m/Microsoft/PowerShell/7.2.3.0/Microsoft.PowerShell.installer.yaml. I have no idea what winget uses to select the package here but this could potentially still apply. The path in the screenshot might indicate you are using just the msi install and my comment doesn't apply though.\n\n<blockquote><img src=\"https://opengraph.githubassets.com/0575cae0e07e96dd38cd3672f7821dee4aa6fad21efb25ac86f36e105515e02a/microsoft/winget-pkgs\" width=\"48\" align=\"right\"><div><img src=\"https://github.githubassets.com/favicons/favicon.svg\" height=\"14\"> GitHub</div><div><strong><a href=\"https://github.com/microsoft/winget-pkgs\">winget-pkgs/Microsoft.PowerShell.installer.yaml at master · microsoft/winget-pkgs</a></strong></div><div>The Microsoft community Windows Package Manager manifest repository - winget-pkgs/Microsoft.PowerShell.installer.yaml at master · microsoft/winget-pkgs</div></blockquote>",
      "created_at": "2022-05-02T20:30:52Z",
      "updated_at": "2022-05-02T20:30:54Z"
    },
    {
      "author": "griesi007",
      "author_association": "NONE",
      "body": "@jborean93 winget states it´s using the wix installer type https://github.com/PowerShell/PowerShell/releases/download/v7.2.3/PowerShell-7.2.3-win-x64.msi",
      "created_at": "2022-05-03T06:13:25Z",
      "updated_at": "2022-05-03T06:14:52Z"
    },
    {
      "author": "jborean93",
      "author_association": "COLLABORATOR",
      "body": "Awesome, thanks for confirming. Scratch my idea, I'm not sure what is happening with your case sorry.",
      "created_at": "2022-05-03T06:28:07Z",
      "updated_at": "2022-05-03T06:28:07Z"
    },
    {
      "author": "jhoneill",
      "author_association": "NONE",
      "body": "I think PowerShell 7 writes the execution Policy to powershell.config.json (machine policy is in the $psHome directory) where Windows PowerShell uses to the registry. \r\nIf I don't have write access to $Pshome I get an error `Access to the path 'C:\\Program Files\\PowerShell\\7\\powershell.config.json' is denied.`  if I try to set execution policy for the machine. \r\n",
      "created_at": "2022-05-03T10:51:02Z",
      "updated_at": "2022-05-03T10:51:02Z"
    },
    {
      "author": "griesi007",
      "author_association": "NONE",
      "body": "@jhoneill of course it must be written to the registry. Anything else would not make any sense",
      "created_at": "2022-05-03T12:03:25Z",
      "updated_at": "2022-05-03T12:03:25Z"
    },
    {
      "author": "jhoneill",
      "author_association": "NONE",
      "body": "Maybe someone else will confirm but as I understand it: 5 is windows only, so it uses the registry.  7 being  cross platform _could_ use the registry on windows, but in practice it uses the same settings files on all platforms. \r\n\r\nYou're seeing the policy change, but no change in the registry , correct ? Is  the change written to `$pshome\\powershell.config.json` ? ",
      "created_at": "2022-05-04T08:25:25Z",
      "updated_at": "2022-05-04T08:25:25Z"
    },
    {
      "author": "griesi007",
      "author_association": "NONE",
      "body": "@jhoneill yes exactly. But this does not make any practical sense? Which sense does it make for the Set-ExecutionPolicy cmdlet to write into powershell.config.json? In that case Set-ExecutionPolicy cmdlet should either be removed from Powershell 7 or write as expected into the registry. I assumed PowerShell 7 is a replacement for PowerShell 5?",
      "created_at": "2022-05-04T08:37:17Z",
      "updated_at": "2022-05-04T08:37:17Z"
    },
    {
      "author": "jhoneill",
      "author_association": "NONE",
      "body": "@griesi007  How would you implement execution policy on Linux ? \r\n\r\nBecause it is possible to have multiple side by side installs for PowerShell core it is also possible that a setup demands signed for the default (on-the-path) version and has something different for testing older / pre-release versions. So a file in the the same directory as the executable is a simple way of getting that. \r\n\r\n64 bit and 32 bit Windows PowerShell put these setting in different parts of the registry so execution policy needs to be changed twice to cover both. So there is a precedent for saying two side by side versions do not interfere with each other. \r\n\r\nYou're right that there is an argument that on Windows the settings should go under `HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\PowerShell\\6` or  `HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\PowerShell\\7` but there is an equal and opposite argument different platforms should avoid special behaviours.  That is the argument which minimizes the amount of work for implementation and testing :-)  If the policies work correctly the storage mechanism isn't important. \r\n \r\n\r\n\r\n \r\n",
      "created_at": "2022-05-04T09:14:20Z",
      "updated_at": "2022-05-04T09:14:20Z"
    },
    {
      "author": "griesi007",
      "author_association": "NONE",
      "body": "@jhoneill Yes you are right. But shouldn´t a default Windows install work similar to PowerShell 5 and write to the registry? As the msi package is platform agnostic this could easily be configured there. Also I understand your argument for other use cases. But shouldn´t this be an optional configuration option? Can PowerShell 7 currently be configured to write into the registry similar as PowerShell 5 does? At least the documentation of PowerShell 7 should mention this different behaviour clearly. I assume most people are not aware of the fact that PowerShell 7 does not write to the registry, so all cmdlets which modify the registry in PowerShell 5 are pretty useless if one uses PowerShell 7 as a replacement for 5.",
      "created_at": "2022-05-04T09:25:23Z",
      "updated_at": "2022-05-04T09:26:30Z"
    },
    {
      "author": "jhoneill",
      "author_association": "NONE",
      "body": "The MSI is Windows specific, you can't install it on Linux, and the 64 bit MSI won't work on 32 bit Windows.   (The 32 bit MSI will work on 64 bit Windows and is needed in a few situations). \r\n\r\n6 and 7 on Windows do have registry providers so (on Windows) registry commands still do what they always did.  It is simply a question of where PowerShell reads current user and local machine configuration information from when it starts.  AIUI group policy still supported so a Windows version of PowerShell 7 does read the registry for _some_ execution policy \r\n\r\nA Windows-only app _should_ keep its configuration in the registry, but the new Windows Terminal app uses a JSON file so parts of Microsoft don't follow that rule. The unix world has never had a central configuration store so apps there use various sorts of text file.    \r\nShould a cross-platform app use the registry on Windows or use the same config files everywhere?  The case for either is roughly as strong as the other.  Since we use the cmdlets to view/change the settings we probably shouldn't care very much about how things are stored - such things can change between versions. \r\n\r\n \r\n\r\n",
      "created_at": "2022-05-04T10:31:56Z",
      "updated_at": "2022-05-04T10:31:56Z"
    },
    {
      "author": "griesi007",
      "author_association": "NONE",
      "body": "@jhoneill I am on Windows and PowerShell 7 registry commands e.g. Set-ExecutionPolicy do not what they always did. As I have shown initially PowerShell 7 does not modify the registry settings in question as it does PowerShell 5. So obviously there is some sort of bug",
      "created_at": "2022-05-04T10:56:55Z",
      "updated_at": "2022-05-04T10:56:55Z"
    },
    {
      "author": "jhoneill",
      "author_association": "NONE",
      "body": "@griesi007  \r\n\r\n1.  `Set-ExecutionPolicy` was not a \"registry command\" nor has it become a \"file command\".  It is a command to set a policy. The implementation changed from storing localmachine and currentuser policies in the registry, to storing them in JSON files.  \r\n2. To the best of my knowledge using the registry to get or set the execution policy was always in the \"works but isn't supported\" category - meaning the registry path could change, value names and the data itself could change,  and there was no guarantee the registry would always be used. \r\n3. PowerShell 7 on Windows has the same ability to work with registry as its predecessors. It just keeps some of its own configuration elsewhere, by design. The PowerShell 7 implementation of any functionality is free to choose not to use the registry, but the ability is still there.\r\n",
      "created_at": "2022-05-04T11:24:27Z",
      "updated_at": "2022-05-04T11:25:52Z"
    },
    {
      "author": "griesi007",
      "author_association": "NONE",
      "body": "@jhoneill \r\n1. I am modifying a policy to have any effect. Storing it in JSON files does not have any effect. So this is pretty useless\r\n2. That´s not true. All official MS Documentation refers to the powershell for configuring the ExecutionPolicy, which implies that this modifies the appropriate registry settings and that this is supported. Otherwise it would not have any effect\r\n3. Could you please advise what needs to be configured so PowerShell 7 ExecutionPolicy cmdlet modifies the appropriate registry settings ",
      "created_at": "2022-05-04T12:00:19Z",
      "updated_at": "2022-05-04T12:01:08Z"
    },
    {
      "author": "jhoneill",
      "author_association": "NONE",
      "body": "> @jhoneill\r\n> \r\n> 1. I am modifying a policy to have any effect. Storing it in JSON files does not have any effect. So this is pretty useless\r\n\r\n**PowerShell 7 reads the JSON and Group Policy Settings**. As you have shown:\r\n\r\n-  When you run Set-ExecutionPolicy in 64 bit PowerShell 5 it sets the policy for 64 bit PowerShell 5, but not for 32 bit PowerShell 5 or Powershell 6 and later.  \r\n- When you run Set-ExecutionPolicy in 32 bit PowerShell 5 it sets the policy for 32 bit PowerShell 5, but not for 64 bit PowerShell 5 or Powershell 6 and later.  \r\n- When you run Set-ExecutionPolicy in PowerShell 6 or 7 it sets the policy for that installation of PowerShell 6/7 (there may be more than one). \r\n\r\nAt no time has Set-ExecutionPolicy been a global setting for all different versions of PowerShell. \r\n\r\nIn PowerShell 5 normal users have read-only access to the Registry key holding the machine setting.    \r\nIn PowerShell 6/7 Normal users have read-only access to the JSON file holding the machine setting. \r\n\r\nAs the image below shows running Set-Execution policy changes the json. Changing the JSON causes an issue with an untrusted file in PSReadline, and won't load my unsigned profile. **Clearly the policy IS effective.**  \r\n\r\n![image](https://user-images.githubusercontent.com/16209593/166689845-6b387e58-03ab-406d-a1cd-fa4e30f40c23.png)\r\n\r\nHere's a second screen shot showing that if you edit the JSON the policy changes - and this is PowerShell 6 \r\n![image](https://user-images.githubusercontent.com/16209593/166692508-3acfe148-991d-499f-a824-2a4fd431920a.png)\r\n\r\nNote that this is not supported. The text in the JSON might change, the location of the file might change. In version 8 it could be YAML or XML format, or back in the registry.  The only supported way to read or write the policy is with cmdlet for that version of PowerShell. \r\n\r\n> 2. That´s not true. All official MS Documentation refers to the powershell for configuring the ExecutionPolicy, which implies that this modifies the appropriate registry settings and that this is supported. Otherwise it would not have any effect\r\n\r\nAll official documentation  that I am aware of **refers to the `set-ExcutionPolicy` cmdlet.** Which sets the policy (via json) for 6/7 and via registry for 5 and earlier. I'm pretty sure there is no official advice to use `reg.exe  <something>` to set set a policy by merging in a .REG file, nor to run `regedit` and navigate to `HKLM:\\SOFTWARE\\Microsoft\\PowerShell\\1\\ShellIds\\Microsoft.PowerShell\\ExecutionPolicy`,     \r\nnor to use `Get-ItemProperty hklm:\\SOFTWARE\\Microsoft\\PowerShell\\1\\ShellIds\\Microsoft.PowerShell -name ExecutionPolicy`  \r\nbut if you know different please share. \r\n\r\nThere **is** an error in the on-line help which still says the policy is stored in the registry, but does not give a path or recommend accessing the registry directly. \r\n\r\n> 3. Could you please advise what needs to be configured so PowerShell 7 ExecutionPolicy cmdlet modifies the appropriate registry settings\r\n\r\n**PowerShell 7 doesn't get its execution policy from the registry but from a JSON file.**  there is no \"appropriate registry setting\" for execution policy in PS 7.   If the cmdlet changed a registry setting pwsh.exe would still look at the JSON not the registry.  You can hack the registry for the PowerShell 5 policy setting from PowerShell 7 (e.g. with` Set-ItemProperty`)  I don't know how many different ways I can put that. \r\n\r\n\r\n\r\n",
      "created_at": "2022-05-04T15:51:02Z",
      "updated_at": "2022-05-04T15:51:02Z"
    },
    {
      "author": "griesi007",
      "author_association": "NONE",
      "body": "@jhoneill Thanks for clarifying this. My misconception was, that ExecutionPolicy is a global system wide setting. But in fact it is a PowerShell specific setting, which must be configured in each PowerShell used. You can close the issue ",
      "created_at": "2022-05-05T06:27:25Z",
      "updated_at": "2022-05-05T06:27:25Z"
    },
    {
      "author": "jhoneill",
      "author_association": "NONE",
      "body": "@griesi007  - you're welcome.  You're not the first to have that misconception, and I'm sure you won't be the last.",
      "created_at": "2022-05-05T10:14:47Z",
      "updated_at": "2022-05-05T10:14:47Z"
    }
  ],
  "created_at": "2022-05-02T10:11:28Z",
  "labels": [
    "WG-Engine"
  ],
  "number": 17242,
  "state": "closed",
  "title": "ExecutionPolicy cannot be modified with PowerShell 7.2.2 / 7.2.3",
  "updated_at": "2022-05-05T10:14:47Z"
}