{
  "_url": "https://github.com/PowerShell/PowerShell/issues/17369",
  "author": "kilasuit",
  "body": "### Summary of the new feature / enhancement\n\nAs a user/administrator that makes use of MU for updating my pwsh installs, I would like this notification banner to be disabled if the reg keys for MU based updates are present.\r\n\r\nAs a user/administrator that makes use of MU for updating my pwsh installs, I would also like this notification banner text to be configurable by means of additional registry key or other means including in pwsh.config.json/GPO etc\r\n\r\nThis is following on from this [comment](https://github.com/PowerShell/PowerShell/issues/8663#issuecomment-1116459104) originally posted by @TravisEz13 in #8663 & also other issues including #15644 \r\n\r\n`@BrandonBoone  Please open another issue about the language/function of the update prompt.`\r\n\r\n\r\n\n\n### Proposed technical implementation details (optional)\n\nAs above check for MU update reg key, and optionall do not show prompt if it exists & provide an additional reg key/config option so that the text of the banner can be configured if it wanted to be shown by administrators to thier users.",
  "closed_at": null,
  "comments": [
    {
      "author": "VashJuan",
      "author_association": "NONE",
      "body": "It would also be GREAT to allow auto-update as needed, as an option.\r\n No 2 week delays, an evergreen PowerShell!",
      "created_at": "2022-05-19T01:41:08Z",
      "updated_at": "2022-05-19T01:41:08Z"
    },
    {
      "author": "kilasuit",
      "author_association": "COLLABORATOR",
      "body": "This should be assigned to the Engine WG.",
      "created_at": "2022-05-21T11:21:45Z",
      "updated_at": "2022-05-21T11:21:45Z"
    },
    {
      "author": "kilasuit",
      "author_association": "COLLABORATOR",
      "body": "@VashJuan if you install via the Microsoft Store then it should have no delay",
      "created_at": "2022-05-21T11:50:13Z",
      "updated_at": "2022-05-21T11:50:13Z"
    },
    {
      "author": "psr",
      "author_association": "NONE",
      "body": "Surely the issue here is that the JSON endpoint which PowerShell checks is being updated prematurely. It doesn't make sense to say that a new release is available until the new release _is_ available, in all of the important places. I don't mind being notified upon opening a new session, provided visiting Windows Update does have a new release.",
      "created_at": "2022-06-22T16:26:46Z",
      "updated_at": "2022-06-22T16:26:46Z"
    },
    {
      "author": "psr",
      "author_association": "NONE",
      "body": "Part of the problem is that showing the message before Windows Update is ready encourages re-installing with the new MSI - giving a new opportunity to opt-in/out of Windows Update. \"Didn't I click the option to use Windows Update last time around? I guess I must not have done...\" 🤔",
      "created_at": "2022-06-22T16:44:00Z",
      "updated_at": "2022-06-22T16:44:00Z"
    },
    {
      "author": "VashJuan",
      "author_association": "NONE",
      "body": "My (limited) understanding is that there are two destinations for PowerShell updates: 1) MS Store (which I've always avoided like the plague) which gets updated quickly. Then there is also 2) the bundled/verified/slower-updating Windows Update.\r\n\r\nThe PowerShell extension in VS Code doesn't actually check to see which version is installed, but just whether the PowerShell team has released an updated version - whether it is available or not.\r\n\r\nI'm not clear how to switch from option 2) to option 1). I uninstalled PowerShell from Windows Settings/Programs & Features & then went to the Windows Store and installed the PowerShell Preview. But then there are a lot of detailed settings for VS Code/the extension that overwhelmed me: which of the 20 subtly different settings is the right one? tl;dr\r\n\r\nNow I'm getting a notice that there is a new pscore6 available: apparently the store install didn't install that??? \r\n\r\n",
      "created_at": "2022-06-22T16:45:35Z",
      "updated_at": "2022-06-22T16:45:35Z"
    },
    {
      "author": "VashJuan",
      "author_association": "NONE",
      "body": "@psr, Yep, a lot of fiddling/bother for what 'should' be a boring part of the tooling.",
      "created_at": "2022-06-22T16:47:12Z",
      "updated_at": "2022-06-22T16:47:12Z"
    }
  ],
  "created_at": "2022-05-18T01:34:42Z",
  "number": 17369,
  "state": "open",
  "title": "Update when notification text for new release shows & what it says",
  "updated_at": "2022-06-22T16:47:13Z"
}