{
  "_url": "https://github.com/PowerShell/PowerShell/issues/1746",
  "author": "SteveL-MSFT",
  "body": "Build PSRPOverSSH prototype code.\n$s = New-PSSession -HostName \"paulhig-1\" -UserName \"PaulTest\" -KeyPath \"C:\\Program Files\\OpenSSH-Win32\\Debug\\id_rsa\"\n\nResult:\nOccassionally you get a crashing error from launching PowerShell:\n\"The path is not in legal form.\".\nExpected:\nNo error\n\nPaul Higinbotham (POWERSHELL):\nI ran into this while working on the PSRP over SSH prototype.  This happens when PowerShell is launched by the sshd process under the test \"User\" account that has no temp directory.  The error is thrown in the GetAppLockerPolicy() method when running the managed method IO.Path.GetTempPath().\n\nThis looks like a bug in the .Net class since the error only occurs randomly.  The fix is to add an ArgumentException catch block and return the correct policy result when no temp directory is available.\n",
  "closed_at": "2016-12-15T17:07:05Z",
  "comments": [
    {
      "author": "tanin47",
      "author_association": "NONE",
      "body": "I have this problem as well. It only happens maybe 1 out of 5 times.\n\nI am ssh'ing into a remote windows machine with OpenSSH-Win32 (5_30_2016) and powershell (version 5, I believe). Here's the error message:\n\n```\n> powershell -command dir\ndebug2: channel 0: rcvd ext data 72\ndebug2: channel 0: rcvd ext data 34\nThe shell cannot be started. A failure occurred during initialization:\nThe path is not of a legal form.\n```\n\nI'll try ensure that the user has temp directory. If you happen to know how to ensure it through a command line, please let me know. Thanks.\n",
      "created_at": "2016-09-05T00:40:29Z",
      "updated_at": "2016-09-05T00:40:29Z"
    },
    {
      "author": "tanin47",
      "author_association": "NONE",
      "body": "Setting the TMP env seems to solve the problem. Here's the command:\n\nssh .... \"set TMP=%USERPROFILE%\\appdata\\local\\temp\\ && powershell -command $env:tmp\".\n\nI ran this command like 20 times and encountered no error. And, once I removed `set TMP`, I encountered the error every 4-5 times.\n",
      "created_at": "2016-09-05T01:10:06Z",
      "updated_at": "2016-09-05T01:21:06Z"
    },
    {
      "author": "PaulHigin",
      "author_association": "COLLABORATOR",
      "body": "This was fixed as part of PSRP over SSH changes.",
      "created_at": "2016-12-15T17:07:05Z",
      "updated_at": "2016-12-15T17:07:05Z"
    }
  ],
  "created_at": "2016-08-12T17:13:28Z",
  "labels": [
    "WG-Interactive-Console",
    "Resolution-Fixed"
  ],
  "number": 1746,
  "state": "closed",
  "title": "PowerShell crash with \"The path is not in legal form\" error when launched without temp path access",
  "updated_at": "2016-12-15T19:39:06Z"
}