{
  "_url": "https://github.com/PowerShell/PowerShell/issues/17588",
  "author": "iRon7",
  "body": "### Summary of the new feature / enhancement\r\n\r\nJudging from the StackOverflow questions, it appears to me that custom log files implementations are more often used then the native [`Start-Transcript`](https://docs.microsoft.com/powershell/module/microsoft.powershell.host/start-transcript) cmdlet and suspect that this is due to the fact enterprise companies (as the one I am working for) want their own logging facilities which might be a specific log format (e.g. including a specific time stamp per entry) up till writing (specific) entries to a database.\r\n\r\n### Proposed technical implementation details (optional)\r\n\r\nA `-Script <ScriptBlock>` parameter that refers to a script that is called at each logging event. Within the script (which might need to run in a different scope), I would expect to have access to information (via current item (`$_`)?) as:\r\n- A reference to thr output streams since last event\r\n- The timestamp of the event (basically the current time)\r\n- Transcript properties/parameters (as the `Path` if supplied)\r\n- ...",
  "closed_at": null,
  "comments": [
    {
      "author": "PaulHigin",
      "author_association": "COLLABORATOR",
      "body": "This feels like a reasonable request for some kind of logging provider mechanism for transcripts.  But we need to think carefully about how this could be abused for information disclosure.",
      "created_at": "2022-06-27T16:48:59Z",
      "updated_at": "2022-06-27T16:48:59Z"
    },
    {
      "author": "PaulHigin",
      "author_association": "COLLABORATOR",
      "body": "@WG-Security\r\nWorking security group discussed this and have concerns about inadvertently exposing sensitive information to arbitrary providers, that may move the data off-box.  PowerShell transcripts captures all data written to the console, which can include secrets, and therefore it is more sensitive to where that data goes.  If we implemented a transcript collection provider architecture, we would have to also include some sort of encryption scheme. ",
      "created_at": "2022-07-18T21:07:45Z",
      "updated_at": "2022-07-18T21:07:45Z"
    }
  ],
  "created_at": "2022-06-27T13:43:53Z",
  "labels": [
    "Issue-Enhancement",
    "WG-Engine",
    "Needs-Triage"
  ],
  "number": 17588,
  "state": "open",
  "title": "Add callback feature to `Start-Transcript`",
  "updated_at": "2022-07-18T21:07:58Z"
}