{
  "_url": "https://github.com/PowerShell/PowerShell/issues/17585",
  "author": "blueboy90780",
  "body": "### Summary of the new feature / enhancement\n\nThere are a lot of pre-built modules that comes natively with Powershell Core when we install it into our system. These modules are not easy to update, they were not installed from PSGallery, so the \"Update-Module\" cmdlet from PowerShellGet module does not work. If we want to update an built-in module, we have to force install that module, leaving behind the old version which never gets used. Then we have to manually uninstall that same module.\r\n\r\nWhen we scale this up, for example, trying to update every single pre-built module that comes with powershell core, we'd either have to do this manually for each module or we can write a script, though there is limited resources on available scripts that actually work and are reliable.\r\n\r\nIt would be much more convenient if this feature can come pre-built instead.\n\n### Proposed technical implementation details (optional)\n\n_No response_",
  "closed_at": "2022-07-01T03:54:27Z",
  "comments": [
    {
      "author": "PaulHigin",
      "author_association": "COLLABORATOR",
      "body": "The core modules that are not available through PSGallery are updated through PowerShell Core releases.  So to update the core modules you should really update to the latest PowerShell Core release.  I am not sure we would want to separate the two.",
      "created_at": "2022-06-27T17:05:25Z",
      "updated_at": "2022-06-27T17:05:25Z"
    },
    {
      "author": "blueboy90780",
      "author_association": "NONE",
      "body": "Thank you, this has answered my question",
      "created_at": "2022-07-01T03:54:27Z",
      "updated_at": "2022-07-01T03:54:27Z"
    },
    {
      "author": "rokejulianlockhart",
      "author_association": "NONE",
      "body": "I certainly desire this, because having a consistent way to update every module would ease automation.\r\n\r\nConsequently, @blueboy90780, please reopen this, because I do not believe that @PaulHigin's response was entirely negative.\r\n\r\nPython's pip allows this despite its modules being available via alternative repositories.",
      "created_at": "2022-07-01T09:22:01Z",
      "updated_at": "2022-07-01T09:22:01Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "Core modules are highly integrated with Engine, use internal API and can not be distributed individually.",
      "created_at": "2022-07-01T09:28:01Z",
      "updated_at": "2022-07-01T09:28:01Z"
    }
  ],
  "created_at": "2022-06-26T10:06:43Z",
  "number": 17585,
  "state": "closed",
  "title": "Updates for native modules pre-packaged with Powershell",
  "updated_at": "2022-07-01T09:28:01Z"
}