{
  "_url": "https://github.com/PowerShell/PowerShell/issues/17651",
  "author": "jeffythedragonslayer",
  "body": "### Summary of the new feature / enhancement\n\nTo cut down on line noise, I think this error should be suppressed when the alias attempting to be imported already exists and is equivalent to what is being imported:\r\n\r\n> Import-Alias: The alias is not allowed, because an alias with the name ????? already exists.\n\n### Proposed technical implementation details (optional)\n\n_No response_",
  "closed_at": null,
  "comments": [
    {
      "author": "jeffythedragonslayer",
      "author_association": "NONE",
      "body": "Hi Pablo,\r\n\r\nI'd try adding \"if\" and \"continue\" statements to check if the alias that already exists is equivalent to the alias that is trying to be imported around line 154 of this file:\r\n\r\nsrc\\Microsoft.PowerShell.Commands.Utility\\commands\\utility\\ImportAliasCommand.cs",
      "created_at": "2022-07-09T02:23:29Z",
      "updated_at": "2022-07-09T02:23:29Z"
    },
    {
      "author": "jhoneill",
      "author_association": "NONE",
      "body": "@Pablo1q  - speaking to you in my capacity as a member of the PowerShell Working Group, these bot like posts waste the time of others, so be warned that you may be banned from posting if this is all you post.  \r\nIf you have useful contributions to make, those will (of course) be welcome. ",
      "created_at": "2022-07-09T10:23:43Z",
      "updated_at": "2022-07-09T10:23:43Z"
    },
    {
      "author": "jhoneill",
      "author_association": "NONE",
      "body": "Arguably `New-Alias` and `Import-Alias` should report a warning if the alias exists with the same value, as things are in the state the requested, but no change was required. \r\nOne can run with `-errorAction silentlyContinue` but this will hide errors where the alias is different  or with `-force`  but this will over-write items that are different. \r\n\r\nIt should not be silent by default, because warning that the alias exists tells you if you import file A twice, when you intended to import A and then B.   Warnings solve this because you can silence warning and continue to see errors. \r\n\r\n  \r\n",
      "created_at": "2022-07-09T10:37:29Z",
      "updated_at": "2022-07-09T10:37:29Z"
    }
  ],
  "created_at": "2022-07-09T02:09:37Z",
  "number": 17651,
  "state": "open",
  "title": "Import-Alias suppress errors when same exact alias already exists",
  "updated_at": "2022-07-09T10:37:30Z"
}