{
  "_url": "https://github.com/PowerShell/PowerShell/issues/17980",
  "author": "choby",
  "body": "### Summary of the new feature / enhancement\n\nAdd the configuration synchronization function to synchronize the configurations between all devices using the Microsoft account please, thank you\n\n### Proposed technical implementation details (optional)\n\n_No response_",
  "closed_at": null,
  "comments": [
    {
      "author": "dkaszews",
      "author_association": "CONTRIBUTOR",
      "body": "What exactly do you want to synchronize? I was able to successfully sync all my preferences just by keeping the `$PROFILE` on repo. All you need is to add a single line `& \"path/to/my/repo/profile.ps1\"` to `$PROFILE`. Instead of git, you can use OneDrive, Google Drive or anything else that syncs files. ",
      "created_at": "2022-08-28T11:31:19Z",
      "updated_at": "2022-08-28T11:31:19Z"
    },
    {
      "author": "choby",
      "author_association": "NONE",
      "body": "I just want to sync the server's ssh configuration",
      "created_at": "2022-08-28T12:32:28Z",
      "updated_at": "2022-08-28T12:32:28Z"
    },
    {
      "author": "dkaszews",
      "author_association": "CONTRIBUTOR",
      "body": "Please be more precise, describe your usecase and how you go about it right now, so we can understand how it can be implemented and what value it provides, or whether it's a PowerShell specific thing or is this a feature request for some other system like Windows itself. When moving onto a new machine, what do you have to do manually now that would be automated? ssh config is just couple files stored in `~/.ssh`. You can synchronize them yourself using methods describe above, but keep in mind that storing your ssh keys on other servers may be very risky.",
      "created_at": "2022-08-28T13:45:24Z",
      "updated_at": "2022-08-28T13:45:24Z"
    },
    {
      "author": "jhoneill",
      "author_association": "NONE",
      "body": "My profile directory has been on onedrive since 2008 when it was still named \"skydrive\" \r\n\r\nIIRC I needed to run elevated but with the folder moved from documents to onedrive\r\n\r\n```\r\ncd ~\\documents\r\nnew-item -Type SymbolicLink -Name PowerShell -Target C:\\Users\\me\\OneDrive\\PowerShell\r\n```\r\ndoes the job. You replace onedrive with any another provider. It can be done with git, but that needs to be told to sync periodically (e.g. from your profile). \r\n \r\n\r\n",
      "created_at": "2022-08-28T13:51:14Z",
      "updated_at": "2022-08-28T13:51:14Z"
    },
    {
      "author": "dkaszews",
      "author_association": "CONTRIBUTOR",
      "body": "Symlinking on Windows requires elevated prompt or developer mode enabled. In my case, I found that invoking synchronized profile from `$PROFILE` works better, so that I can still have machine-specific code, e.g. setting up proxy on my work machine. Symlinking also can have surprising behavior when using relative paths - if you invoke a script via symlink, is `$PSScriptRoot` the folder of the link, or its target? What if you symlink entire folder?\r\n\r\nBut yeah, symlinks are a decent general solution as they can be used for entire directories regardless of contents, like ssh config, or config of whatever terminal you use.",
      "created_at": "2022-08-28T13:57:33Z",
      "updated_at": "2022-08-28T13:57:33Z"
    },
    {
      "author": "choby",
      "author_association": "NONE",
      "body": "I usually save the SSH login to the server in the Powershell configuration file, such as SSH -t user@ip 'CD /home/xxx; Bash ', or other more complex SSH commands, I would like to have these configurations automatically on other work computers, rather than manually configuring them once\r\n\r\n ",
      "created_at": "2022-08-28T14:49:50Z",
      "updated_at": "2022-08-28T14:49:50Z"
    },
    {
      "author": "choby",
      "author_association": "NONE",
      "body": "Terminal tools such as Termius have similar functionality",
      "created_at": "2022-08-28T14:54:27Z",
      "updated_at": "2022-08-28T14:54:27Z"
    },
    {
      "author": "jhoneill",
      "author_association": "NONE",
      "body": "I'd forgotten that I originally did it using  Windows Live Mesh (R.I.P), and blogged about changing over https://jamesone111.wordpress.com/2013/02/08/getting-skydrive-to-sync-the-way-i-want-like-mesh/ , so I've been sym-linking the whole folder for 9 years.  Every once in a while something would convert to the native path but it didn't seem to have any ill-effects.  I think the behaviour has changed in Windows 11's file explorer, it shows the symlink as a shortcut and at one time I'm sure it navigated to the onedrive directory - possibly I had setup the link differently, but I don't notice myself ending up in the onedrive directory by accident these days. \r\n\r\nThe client I'm working for at present doesn't allow their machines to connect to personal onedrives - although the `My Documents` folder goes to _business_ one drive so my Profile directory is sync'd / backed up and allows me to go back to old versions. On their machine I have a symlink between profile.ps1 in the WindowsPowerShell and PowerShell directories, so yes you can do it it for files or subdirectories if that's more appropriate.  \r\n\r\n\n\n<blockquote><img src=\"https://jamesone111.files.wordpress.com/2013/02/image_thumb.png\" width=\"48\" align=\"right\"><div><img src=\"https://s1.wp.com/i/favicon.ico\" height=\"14\"> James O'Neill's Blog</div><div><strong><a href=\"https://jamesone111.wordpress.com/2013/02/08/getting-skydrive-to-sync-the-way-i-want-like-mesh/\">Getting SkyDrive to sync the way I want (like Mesh)</a></strong></div><div>A few days ago Geekwire ran a story entitled “Microsoft, Let’s be friends” It began Dear Microsoft, Can we just be friends again? Please? It’s been exactly five years now since I left you. During o…</div></blockquote>",
      "created_at": "2022-08-28T15:16:38Z",
      "updated_at": "2022-08-28T15:16:40Z"
    },
    {
      "author": "kilasuit",
      "author_association": "COLLABORATOR",
      "body": "Hi @choby \r\n\r\nFrom what you've written I am not sure that this is something that we would look to consider due to how there is already methods for synchronising data built into to windows.\r\n\r\nI'd recommend if you haven't already looking into the following documentation for [Profile Scripts](https://docs.microsoft.com/en-us/powershell/module/microsoft.powershell.core/about/about_profiles?view=powershell-7.2) and see if that helps your need along with the article that @jhoneill has posted above as I use basically the same process for my needs too.",
      "created_at": "2022-09-01T22:12:35Z",
      "updated_at": "2022-09-01T22:12:35Z"
    }
  ],
  "created_at": "2022-08-28T08:20:12Z",
  "labels": [
    "Issue-Enhancement",
    "Issue-Discussion"
  ],
  "number": 17980,
  "state": "open",
  "title": "Add the configuration synchronization please",
  "updated_at": "2022-09-01T22:18:22Z"
}