{
  "_url": "https://github.com/PowerShell/PowerShell/issues/1806",
  "author": "adamdriscoll",
  "body": "[Roslyn](https://github.com/dotnet/roslyn/wiki/Roslyn%20Overview#syntax-trivia) accomplishes this by having LeadingTrivia and TrailingTrivia collections for each token in the Syntax Tree. PowerShell doesn't maintain this type of trivia in the AST so refactoring algorithms have to take the AST and parsed tokens into account when processing and reordering a script.\n\nI feel like I talked to @lzybkr about this at one point so there may be a good reason for not doing this that I don't remember but I figure it'd be a cool discussion. \n",
  "closed_at": null,
  "comments": [
    {
      "author": "lzybkr",
      "author_association": "MEMBER",
      "body": "Yeah, we've discussed it.  Refactoring is a major design point for Roslyn, so *Trivia collections are pretty much required.\n\nIt might make sense to add *Trivia collections to PowerShell, but probably as a build time option in a stand-alone dll for PowerShell editor services.\n\nThe reason PowerShell doesn't have whitespace trivia yet is that it's not needed at runtime (really the most important scenario for PowerShell) and computing the trivia has a non-zero cost.  It took a lot of work from Roslyn to reach parity with the native compiler, so adding such a feature to PowerShell is expected to be a lot of work to do well.\n\nNow it's certainly reasonable to build the parser as a standalone dll as a tools such as PowerShell editor services - in that build configuration, having *Trivia makes a lot of sense.\n",
      "created_at": "2016-08-15T14:35:34Z",
      "updated_at": "2016-08-15T14:35:34Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "@bergmeister Perhaps it can be interesting for you.",
      "created_at": "2018-08-27T12:56:58Z",
      "updated_at": "2018-11-16T03:55:35Z"
    },
    {
      "author": "rjmholt",
      "author_association": "COLLABORATOR",
      "body": "Having the parser as a standalone DLL would be pretty cool",
      "created_at": "2018-11-16T03:12:27Z",
      "updated_at": "2018-11-16T03:12:27Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "I'd can investigate this but currently we have over 45 open PRs - slow reviews from MSFT team slow down community works 😕 ",
      "created_at": "2018-11-16T03:57:58Z",
      "updated_at": "2018-11-16T03:57:58Z"
    },
    {
      "author": "rjmholt",
      "author_association": "COLLABORATOR",
      "body": "No no, it's just a daydream for now. Tooling would benefit, but we should focus on what's being worked on currently for now.",
      "created_at": "2018-11-16T04:05:19Z",
      "updated_at": "2018-11-16T04:05:19Z"
    },
    {
      "author": "rjmholt",
      "author_association": "COLLABORATOR",
      "body": "The slow reviews are a consequence of driving other work at the moment -- hopefully it will pay dividends so that we can spend more time working on PowerShell itself.",
      "created_at": "2018-11-16T04:07:46Z",
      "updated_at": "2018-11-16T04:07:46Z"
    }
  ],
  "created_at": "2016-08-15T11:46:02Z",
  "labels": [
    "WG-Engine",
    "Up-for-Grabs"
  ],
  "number": 1806,
  "state": "open",
  "title": "Support for SyntaxTrivia in the AST",
  "updated_at": "2018-11-16T04:07:46Z"
}