{
  "_url": "https://github.com/PowerShell/PowerShell/issues/18073",
  "author": "TomaszPograniczny",
  "body": "### Summary of the new feature / enhancement\n\nHey,\r\nI'm using CIM-Sessions to spare resources it works really nice because it is possible to use DCOM (RPC port 135) so i don't need to enable wsman, i used wireshark to look how works sc.exe and i saw that it uses first RPC port 135 when it doesn't work it switch to RPC over SMB at port 445. I Through that it might be possible to use New-CIMSession through RPC over SMB (port 445) but here in New-CIMSession -protocol is not possible to set SMB.\r\n\r\nThanks in advice\n\n### Proposed technical implementation details (optional)\n\n$SessionOption = New-CimSessionOption -Protocol **SMB**\r\nNew-CimSession -ComputerName Server1 -SessionOption $SessionOption\r\n\r\n\r\n",
  "closed_at": "2022-09-13T14:13:28Z",
  "comments": [
    {
      "author": "jborean93",
      "author_association": "COLLABORATOR",
      "body": "A CIM session is different from an RPC over SMB port. They use different protocols to format the messages and aren’t really comparable. The RPC stuff is also not generic across protocols as it requires you to send very specific payloads to specific endpoints depending on what you are talking to. What you are looking for isn’t really possible to do in a session like interface which is why the common method these days is to use Invoke-Command to run whatever PowerShell code you want on the target. This can be done through WinRM on Windows hosts but also now support SSH for non-Windows and Windows hosts with both ssh installed/configured + pwsh 6+.",
      "created_at": "2022-09-12T23:15:27Z",
      "updated_at": "2022-09-12T23:15:27Z"
    },
    {
      "author": "TomaszPograniczny",
      "author_association": "NONE",
      "body": "Thanks for info. \r\nI Through that if sc.exe can communicate through port 135 as RPC and 445 RPC over SMB than maybe it could be possible to send another commands through RPC over SMB to read data or make changes to remote server. Like Invoke-CimMethod or Get-CimInstance. If CIM Sessions can't have so possibility is another command in powershell which can get data from RPC over SMB? \r\nI found that sc.exe and get-printer can use RPC over SMB. RPC over SMB communication could be nice alternative to WinRM or RPC both are mostly blocked with firewall but SMB is in use and RPC over SMB works. ",
      "created_at": "2022-09-13T08:15:34Z",
      "updated_at": "2022-09-13T08:15:34Z"
    },
    {
      "author": "jborean93",
      "author_association": "COLLABORATOR",
      "body": "> I Through that if sc.exe can communicate through port 135 as RPC and 445 RPC over SMB than maybe it could be possible to send another commands through RPC over SMB to read data or make changes to remote server\r\n\r\nIt is possible but those APIs must be exposed through an RPC mechanism. Unlike WMI/CIM/PSRemoting there isn’t a common mechanism. Some things have it while others don’t. For example the API to manipulate services and to get remote processes might both run over RPC through SMB but the actual bytes that are exchanged is not unified and varied based on the API.\r\n\r\n> RPC over SMB communication could be nice alternative to WinRM or RPC both are mostly blocked with firewall but SMB is in use and RPC over SMB works.\r\n\r\nIt is certainly possible to use this through PowerShell, in Windows PowerShell (5.1 and earlier) the service cmdlets could do this with the `-ComputerName` parameter. While this parameter is not longer present on pwsh 6+ you can still use the relevant dotnet APIs instead. Ultimately they aren’t very flexible because the number of things you can do over RPC is far lower than CIM/WSMan. Your best bet is to actually enable the ports needed for PSRemoting/CIM rather than try to use RPC over SMB. You’ll be able to do so much more with it, e.g. run any powershell command you want.",
      "created_at": "2022-09-13T12:13:29Z",
      "updated_at": "2022-09-13T12:13:29Z"
    },
    {
      "author": "jhoneill",
      "author_association": "NONE",
      "body": "> Thanks for info. I Through that if sc.exe can communicate through port 135 as RPC and 445 RPC over SMB than maybe it could be possible to send another commands through RPC over SMB to read data or make changes to remote server\r\n\r\nYes, provided that something is listening there for those remote procedure calls. Things which tie into the original `net` commands (checking services, getting the time, enumerating file and printer shares) would be expected to have something listening wherever you can connect to use a file  \r\n\r\n> possibility is another command in powershell which can get data from RPC over SMB? \r\n\r\nThe things you want to talk to aren't listening on those ports. Making the call from PowerShell would be easy enough, but it wouldn't get an answer. \r\n\r\n> I found that sc.exe and get-printer can use RPC over SMB. \r\n\r\nSee above.  Get-Printer is probably not doing its own remoting, but calling something in .NET which calls the underlying Windows API which does the remoting.  \r\n\r\n> RPC over SMB communication could be nice alternative to WinRM or RPC both are mostly blocked with firewall but SMB is in use and RPC over SMB works.\r\n\r\nIf  firewalls are preventing remote management, sadly that's a local configuration issue. Asking software vendors for work-rounds for what your IT team does may be the wrong answer. \r\n",
      "created_at": "2022-09-13T14:05:54Z",
      "updated_at": "2022-09-13T14:06:14Z"
    },
    {
      "author": "TomaszPograniczny",
      "author_association": "NONE",
      "body": "Ok, thanks for info, so i need to look at .NET and Windows API ",
      "created_at": "2022-09-13T14:13:28Z",
      "updated_at": "2022-09-13T14:13:28Z"
    }
  ],
  "created_at": "2022-09-12T20:01:15Z",
  "number": 18073,
  "state": "closed",
  "title": "CIM-Session through SMB port 445 (RPC over SMB)",
  "updated_at": "2022-09-13T14:13:33Z"
}