{
  "_url": "https://github.com/PowerShell/PowerShell/issues/18117",
  "author": "hmmwhatsthisdo",
  "body": "### Prerequisites\r\n\r\n- [X] Write a descriptive title.\r\n- [X] Make sure you are able to repro it on the [latest released version](https://github.com/PowerShell/PowerShell/releases)\r\n- [X] Search the existing issues.\r\n- [X] Refer to the [FAQ](https://github.com/PowerShell/PowerShell/blob/master/docs/FAQ.md).\r\n- [X] Refer to [Differences between Windows PowerShell 5.1 and PowerShell](https://docs.microsoft.com/powershell/scripting/whats-new/differences-from-windows-powershell).\r\n\r\n### Steps to reproduce\r\n\r\nPiping output from `ssh` (more specifically `cat`ing some syslogs) into a cmdlet with a breakpoint set causes PowerShell to crash as soon as the breakpoint is hit.\r\n\r\nI hit this while trying to debug my [`ConvertFrom-RegEx` module](https://github.com/hmmwhatsthisdo/ConvertFrom-RegEx), but given that I have a 100% crash-rate no matter where the breakpoint is I don't think this is something to do with my code. (Even then, the debugger/pwsh executable crashing isn't ideal.)\r\n\r\nStoring `ssh` output into a variable and piping that variable into the cmdlet with breakpoints works normally. Perhaps `ssh` is preventing the debugger from calling ReadKey()?\r\n\r\n### Expected behavior\r\n\r\n```console\r\nPS> pushd $HOME\\source\\repos\r\nPS> ipmo .\\ConvertFrom-RegEx\\ConvertFrom-RegEx # repo hmmwhatsthisdo/ConvertFrom-RegEx, commit f18a0a46\r\nPS> Set-PSBreakpoint -Script .\\ConvertFrom-RegEx\\ConvertFrom-RegEx\\Public\\ConvertFrom-RegEx.ps1 -Line 135 \r\nPS> ssh $remoteuser@$remoteip -i $HOME\\.ssh\\$remoteuser-id_rsa cat /var/log/syslog | ConvertFrom-RegEx -Pattern '^(?<month>\\S+)'\r\n# [PowerShell hits debugger breakpoint]\r\n```\r\n\r\n\r\n### Actual behavior\r\n\r\n```console\r\nDebugger crashes upon hitting breakpoint\r\n```\r\n\r\n\r\n### Error details\r\n\r\n```console\r\nAn error has occurred that was not properly handled. Additional information is shown below. The PowerShell process will exit.\r\nUnhandled exception. System.InvalidOperationException: Cannot read keys when either application does not have a console or when console input has been redirected. Try Console.Read.\r\n   at System.ConsolePal.ReadKey(Boolean intercept)\r\n   at Microsoft.PowerShell.PSConsoleReadLine.ReadOneOrMoreKeys()\r\n   at Microsoft.PowerShell.PSConsoleReadLine.ReadKeyThreadProc()\r\n   at System.Threading.Thread.StartHelper.Callback(Object state)\r\n   at System.Threading.ExecutionContext.RunInternal(ExecutionContext executionContext, ContextCallback callback, Object state)\r\n--- End of stack trace from previous location ---\r\n   at System.Threading.ExecutionContext.RunInternal(ExecutionContext executionContext, ContextCallback callback, Object state)\r\n   at System.Threading.Thread.StartCallback()\r\n```\r\n\r\n\r\n### Environment data\r\n\r\n```powershell\r\nPS C:\\> $PSVersionTable\r\n\r\nName                           Value\r\n----                           -----\r\nPSVersion                      7.2.6\r\nPSEdition                      Core\r\nGitCommitId                    7.2.6\r\nOS                             Microsoft Windows 10.0.19044\r\nPlatform                       Win32NT\r\nPSCompatibleVersions           {1.0, 2.0, 3.0, 4.0…}\r\nPSRemotingProtocolVersion      2.3\r\nSerializationVersion           1.1.0.1\r\nWSManStackVersion              3.0\r\n```\r\n\r\n\r\n### Visuals\r\n\r\n![image](https://user-images.githubusercontent.com/2093321/190854706-7279366b-1618-4b09-8726-dae23e57ea21.png)\r\n",
  "closed_at": null,
  "comments": [
    {
      "author": "dkaszews",
      "author_association": "CONTRIBUTOR",
      "body": "Have you tried saving the ssh output to a variable and then piping that variable into your script? I would guess the issue is that ssh intercepts your input, and because you are piping it's output into the script, it is still active when the breakpoint hits, causing the issue. By saving to a variable first, you ensure that only one interactive process runs at a time.\r\n\r\nIf that is indeed the case, I don't see how PowerShell can handle it, it's the same why I don't expect `vim | vim -` to ever work. Though you may raise a bug in ssh that they shouldn't do any terminal intercepts when running a command instead of interactive prompt. ",
      "created_at": "2022-09-17T17:15:51Z",
      "updated_at": "2022-09-17T17:15:51Z"
    },
    {
      "author": "hmmwhatsthisdo",
      "author_association": "NONE",
      "body": "> Have you tried saving the ssh output to a variable and then piping that variable into your script?\r\n\r\nI did, and it worked as expected.\r\n\r\n> If that is indeed the case, I don't see how PowerShell can handle it, \r\n\r\nI agree with you that the situation leading this behavior is non-ideal, but the impetus behind filing an issue is that there are several more-graceful ways to handle the situation than crashing the PowerShell process. For comparison, PS 5.1 is able to enter the debugger (and accept keyboard debugger input) at the specified breakpoint without crashing.\r\n\r\nIf the debugger can't attach to the console input due to another process, then there should be a [non-fatal] error indicating the debugger cannot be initialized in that manner. Alternatively, if an external debugger is attached via PSES/etc., then it's possible (maybe even likely) the console debugger interface isn't being used at all.\r\n\r\n> you may raise a bug in ssh\r\n\r\nAgain, I don't think this is ssh's \"fault\" - any other process could lock stdin. The issue here is that when the debugger is running alongside, PowerShell crashes.",
      "created_at": "2022-09-17T21:52:57Z",
      "updated_at": "2022-09-17T21:52:57Z"
    },
    {
      "author": "hmmwhatsthisdo",
      "author_association": "NONE",
      "body": "@iSazonov, would this be more appropriate for `WG-Interactive-Debugging` instead of `WG-Remoting`? I know the screenshot mentions `ssh`, but PowerShell is running entirely locally and it's highly unlikely this is germane to `ssh` itself (versus any other process that captures terminal input).",
      "created_at": "2022-09-17T21:54:08Z",
      "updated_at": "2022-09-18T04:50:38Z"
    },
    {
      "author": "dkaszews",
      "author_association": "CONTRIBUTOR",
      "body": "> there are several more-graceful ways to handle the situation than crashing the PowerShell process\r\n\r\n@hmmwhatsthisdo Fair point, even if some process locks input, debugger could try to detect it and show an error \"Unable to debug interactive process\" instead. ",
      "created_at": "2022-09-18T05:14:53Z",
      "updated_at": "2022-09-18T05:14:53Z"
    },
    {
      "author": "jhoneill",
      "author_association": "NONE",
      "body": "> there are several more-graceful ways to handle the situation than crashing the PowerShell process.\r\n\r\nThere are.  `An error has occurred that was not properly handled... The PowerShell process will exit.` Is the generic \"we didn't anticipate this...\", now it's been pointed out, something that causes PowerShell to crash should be trapped. . \r\n\r\n> For comparison, PS 5.1 is able to enter the debugger (and accept keyboard debugger input) \r\n\r\nI'm surprised that something has changed so that it stopped working - I would have expected never to have worked. Possibly whatever 5.1 did can be brought into 7 to allow you to enter the debugger, possibly there has been a change where the best you'll get is the error being properly handled.\r\n\r\n> If the debugger can't attach to the console input due to another process, then there should be a [non-fatal] error indicating the debugger cannot be initialized in that manner. \r\n\r\nThis sounds ideal, but as you said, there's more than one way.  \r\n\r\n> I don't think this is ssh's \"fault\" \r\n\r\nYou're correct.  The unhandled error is \"Cannot read keys when either application does not have a console or when console input has been redirected\" so this could come from _anything_. ssh is **unusual** in doing this for one scenario (a terminal session) where you wouldn't have output to pipe, AND supporting running a command whose output might go into a pipeline. But I doubt if it is **unique**.  \r\nChanging ssh to work differently, is a large change that is difficult to make, changing PowerShell to not crash is smaller, easier to change and applies to other things. No prizes for guessing what the right thing to do is, this isn't a common scenario so I don't see it jumping to the front of the queue, but it should be accepted that it's a bug. \r\n\r\n",
      "created_at": "2022-09-18T11:06:26Z",
      "updated_at": "2022-09-18T11:06:26Z"
    }
  ],
  "created_at": "2022-09-17T11:47:40Z",
  "labels": [
    "WG-Interactive-Debugging",
    "WG-Remoting",
    "Needs-Triage"
  ],
  "number": 18117,
  "state": "open",
  "title": "Piping ssh output to cmdlet with debug breakpoint crashes PowerShell",
  "updated_at": "2022-09-18T17:56:52Z"
}