{
  "_url": "https://github.com/PowerShell/PowerShell/issues/18148",
  "author": "kilasuit",
  "body": "### Summary of the new feature / enhancement\n\nAs a user (not always using Windows Terminal) I would find it beneficial to easily run PowerShell without a profile, choosing whether or not as admin from a right click on taskbar/start menu entry\n\n### Proposed technical implementation details (optional)\n\nadditional entries added to the jumplist tasks that call PowerShell with the -noprofile flag",
  "closed_at": null,
  "comments": [
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "The only concern I have would be if we do this for everyone.  I can see it being useful, but I would also guess that 90% of users wouldn't need it.  It could be something we have in powershell.config.json to enable.",
      "created_at": "2022-09-26T18:07:45Z",
      "updated_at": "2022-09-26T18:07:45Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "User can run `pwsh -noprofile` from current PowerShell session.",
      "created_at": "2022-09-26T18:10:32Z",
      "updated_at": "2022-09-26T18:10:32Z"
    },
    {
      "author": "dkaszews",
      "author_association": "CONTRIBUTOR",
      "body": "For a taskbar/desktop shortcut, you can just create a shortcut with the `--noprofile` flag. For shell context menu, you can also create \"Open PowerShell here (without profile)\" by editing registry.\r\n\r\n> 90% of users wouldn't need it\r\n\r\nIt's also Windows-specific, Linux users (myself included) had to remind themselves what is this jumpmenu thing",
      "created_at": "2022-09-28T21:36:29Z",
      "updated_at": "2022-09-28T21:36:29Z"
    },
    {
      "author": "MartinGC94",
      "author_association": "CONTRIBUTOR",
      "body": "Why would it need to be hidden by default just because 90% of the users don't use it? I can't imagine those 90% would be negatively affected by it so why would they care if it's enabled by default?  \r\nI understand that cluttering up the jumplist could be annoying if you use it for other things but PowerShell doesn't have recent files or any other interesting tasks in the jumplist.",
      "created_at": "2022-09-30T00:09:21Z",
      "updated_at": "2022-09-30T00:09:21Z"
    },
    {
      "author": "kilasuit",
      "author_association": "COLLABORATOR",
      "body": "> User can run `pwsh -noprofile` from current PowerShell session.\r\n\r\n>For a taskbar/desktop shortcut, you can just create a shortcut with the --noprofile flag.\r\n\r\nTrue can do either of these, but both are slower for the user and ideally shouldn't need additional shortcut or direct registry editing\r\n\r\n>For shell context menu, you can also create \"Open PowerShell here (without profile)\" by editing registry.\r\n\r\nThis ideally should IMO be an additional tick box option in the installer (or perhaps a powershell.config.json option like Steve suggested if it could be more easily managed there)\r\n\r\nThis is definitely a nice to have, not a critical need",
      "created_at": "2022-09-30T01:19:12Z",
      "updated_at": "2022-09-30T01:19:25Z"
    }
  ],
  "created_at": "2022-09-22T22:56:58Z",
  "labels": [
    "Issue-Enhancement",
    "WG-Interactive-Console",
    "Needs-Triage"
  ],
  "number": 18148,
  "state": "open",
  "title": "Add options for running with no profile to jumplist",
  "updated_at": "2022-09-30T01:19:25Z"
}