{
  "_url": "https://github.com/PowerShell/PowerShell/issues/18233",
  "author": "michaeljones",
  "body": "### Summary of the new feature / enhancement\n\nI am writing a completion hook for a native command and there are situations where there are no reasonable suggestions to make for a particular point on the command line. Either the position on the command line requires something that cannot be reasonably suggested - eg. the version number for some report that is being generated or something - or there is no good suggestion for what the user has already written - eg. wanting to suggest a subcommand name but they've already typed 'b' and there are no subcommands beginning with 'b'.\r\n\r\nIn that case, my script block doesn't generate any suggestions and so PowerShell falls back to suggesting files in the current directory. Either the first file or any files matching the partial string already written.\r\n\r\nIn this situations described, suggesting files is less useful than suggesting nothing. Is there a way I can turn off the file suggestions? And if not, could that be treated as a feature request?\r\n\r\nIf it is possible then I would have thought it would be documented on https://learn.microsoft.com/en-us/powershell/module/microsoft.powershell.core/register-argumentcompleter?view=powershell-7.2 but I don't think it is.\n\n### Proposed technical implementation details (optional)\n\n_No response_",
  "closed_at": "2022-10-08T17:01:21Z",
  "comments": [
    {
      "author": "MartinGC94",
      "author_association": "CONTRIBUTOR",
      "body": "Duplicate of this: https://github.com/PowerShell/PowerShell/issues/7215",
      "created_at": "2022-10-07T15:56:05Z",
      "updated_at": "2022-10-07T15:56:05Z"
    },
    {
      "author": "michaeljones",
      "author_association": "NONE",
      "body": "Looks like it! Sorry, I didn't find that. I searched for `Register-ArgumentCompleter` before making this.",
      "created_at": "2022-10-07T16:07:47Z",
      "updated_at": "2022-10-07T16:07:47Z"
    },
    {
      "author": "msftbot[bot]",
      "author_association": "NONE",
      "body": "This issue has been marked as duplicate and has not had any activity for **1 day**. It has been closed for housekeeping purposes.",
      "created_at": "2022-10-08T17:01:20Z",
      "updated_at": "2022-10-08T17:01:20Z"
    }
  ],
  "created_at": "2022-10-07T08:13:38Z",
  "number": 18233,
  "state": "closed",
  "title": "Provide a way to stop \"Register-ArgumentCompleter -Native\" from falling back to suggesting files when there are no suggestions",
  "updated_at": "2022-10-08T17:01:21Z"
}