{
  "_url": "https://github.com/PowerShell/PowerShell/issues/18473",
  "author": "kadenro",
  "body": "## Changes Summary\r\nAdded PSModuleAutoLoadingPreference to initial session state vars, added description for the variable to the runspaceinit.resx file, added tests which cover expected functionality. \r\n\r\nThe PSModuleAutoLoadingPreference variable now only accepts values All, ModuleQualified, None. All other variable assignments will error out as shown through the tests. Intended to resolve https://github.com/PowerShell/PowerShell/issues/12037\r\n\r\n## Slight User Experience Change\r\n\r\nI've marked this pull request as WIP as there is a bit of a hidden behavior change that will occur as a result of the change:\r\n\r\n\r\n<img width=\"1020\" alt=\"Screen Shot 2022-11-05 at 12 54 59 PM\" src=\"https://user-images.githubusercontent.com/66397912/200131938-4f7c70ab-efd8-48d1-8e8e-af716ca3dbfa.png\">\r\n\r\nShown above is the GetCommandDiscoveryPreference which is used for all accesses to the PSModuleAutoloadingPreference variable in the codebase. With my new change, the PSModuleAutoloadingPreference variable will be set by default. So the result variable in the code above will never be null and we will always enter the first if block and return the preference. The dilemma here is that, with this new change, we would now longer be checking the user’s environment variables to see if they already had the preference set before setting the default value to “All” when the pwsh terminal starts up. This is a behavior change that could potentially break things for some users.\r\n\r\nI see two paths forward: \r\n- Continue with the change as is, setting the initial value for PSModuleAutoloadingPreference to “All” regardless of the user’s current environment variable when the shell starts up. This is ultimately what the documentation here https://learn.microsoft.com/en-us/powershell/module/microsoft.powershell.core/about/about_preference_variables?view=powershell-7.2#psmoduleautoloadingpreference suggests the behavior should be and that is the change I recommend. \r\n- When setting the initial value for the PSModuleAutoloadingPreference variable, first check the environment variable and, if the user doesn’t have it set, set it to “All” otherwise defer to what they've already set. This will keep the current behavior exactly identical to what it is now and potentially prevent breaking changes in case some users are still depending on their autoloadingpreference being set via their current environment variables. However, this behavior would not be consistent with what is stated in the documentation above. \r\n\r\n",
  "closed_at": null,
  "comments": [
    {
      "author": "pull-request-quantifier[bot]",
      "author_association": "NONE",
      "body": "### ![](https://img.shields.io/static/v1?label=Quantified&message=Extra%20Small&color=green)\r\n\r\nThis PR has `21` quantified lines of changes. In general, a change size of upto `200` lines is ideal for the best PR experience!\r\n\r\n------\r\n\r\n<details >\r\n    <summary display=\"inline\"> <strong>Quantification details</strong></summary>\r\n    <p />\r\n\r\n```\r\nLabel      : Extra Small\r\nSize       : +21 -0\r\nPercentile : 8.4%\r\n\r\nTotal files changed: 3\r\n\r\nChange summary by file extension:\r\n.cs : +7 -0\r\n.resx : +3 -0\r\n.ps1 : +11 -0\r\n```\r\n> Change counts above are quantified counts, based on the [PullRequestQuantifier customizations](https://github.com/microsoft/PullRequestQuantifier/blob/main/docs/prquantifier-yaml.md).\r\n    \r\n</details>\r\n\r\n\r\n<details>\r\n    <summary display=\"inline\"> <strong>Why proper sizing of changes matters</strong> </summary>\r\n    <p/>\r\n    <p/>\r\n\r\nOptimal pull request sizes drive a better predictable PR flow as they strike a\r\nbalance between between PR complexity and PR review overhead. PRs within the\r\noptimal size (typical small, or medium sized PRs) mean:\r\n\r\n- Fast and predictable releases to production:\r\n  - Optimal size changes are more likely to be reviewed faster with fewer\r\niterations.\r\n  - Similarity in low PR complexity drives similar review times.\r\n- Review quality is likely higher as complexity is lower:\r\n  - Bugs are more likely to be detected.\r\n  - Code inconsistencies are more likely to be detected.\r\n- Knowledge sharing is improved within the participants:\r\n  - Small portions can be assimilated better.\r\n- Better engineering practices are exercised:\r\n  - Solving big problems by dividing them in well contained, smaller problems.\r\n  - Exercising separation of concerns within the code changes.\r\n\r\n#### What can I do to optimize my changes\r\n\r\n- Use the PullRequestQuantifier to quantify your PR accurately\r\n  - Create a context profile for your repo using the [context generator](https://github.com/microsoft/PullRequestQuantifier/releases)\r\n  - Exclude files that are not necessary to be reviewed or do not increase the review complexity. Example: Autogenerated code, docs, project IDE setting files, binaries, etc. Check out the `Excluded` section from your `prquantifier.yaml` context profile. \r\n  - Understand your typical change complexity, drive towards the desired complexity by adjusting the label mapping in your `prquantifier.yaml` context profile.\r\n  - Only use the labels that matter to you, [see context specification](./docs/prquantifier-yaml.md) to customize your `prquantifier.yaml` context profile.\r\n- Change your engineering behaviors\r\n  - For PRs that fall outside of the desired spectrum, review the details and check if:\r\n    - Your PR could be split in smaller, self-contained PRs instead\r\n    - Your PR only solves one particular issue. (For example, don't refactor and code new features in the same PR).\r\n\r\n#### How to interpret the change counts in git diff output\r\n\r\n- One line was added: `+1 -0`\r\n- One line was deleted: `+0 -1`\r\n- One line was modified: `+1 -1` (git diff doesn't know about modified, it will\r\ninterpret that line like one addition plus one deletion)\r\n- Change percentiles: Change characteristics (addition, deletion, modification)\r\nof this PR in relation to all other PRs within the repository.\r\n\r\n</details>\r\n\r\n<p />\r\n\r\n------\r\n\r\nWas this comment helpful? <a href=\"https://pullrequestquantifierfeedback.azurewebsites.net/feedback?payload=eyJBdXRob3JOYW1lIjoia2FkZW5ybyIsIlJlcG9zaXRvcnlMaW5rIjoiaHR0cHM6Ly9naXRodWIuY29tL1Bvd2VyU2hlbGwvUG93ZXJTaGVsbCIsIlB1bGxSZXF1ZXN0TGluayI6Imh0dHBzOi8vZ2l0aHViLmNvbS9Qb3dlclNoZWxsL1Bvd2VyU2hlbGwvcHVsbC8xODQ3MyIsIkV2ZW50VHlwZSI6IlRodW1ic1VwIn0=&amp;anonymous=True\" target=\"_blank\" title=\"Thumbs up\"><strong>:thumbsup:</strong></a> <a href=\"https://pullrequestquantifierfeedback.azurewebsites.net/feedback?payload=eyJBdXRob3JOYW1lIjoia2FkZW5ybyIsIlJlcG9zaXRvcnlMaW5rIjoiaHR0cHM6Ly9naXRodWIuY29tL1Bvd2VyU2hlbGwvUG93ZXJTaGVsbCIsIlB1bGxSZXF1ZXN0TGluayI6Imh0dHBzOi8vZ2l0aHViLmNvbS9Qb3dlclNoZWxsL1Bvd2VyU2hlbGwvcHVsbC8xODQ3MyIsIkV2ZW50VHlwZSI6Ik5ldXRyYWwifQ==&amp;anonymous=True\" target=\"_blank\" title=\"Neutral\"><strong>&nbsp;:ok_hand:</strong></a> <a href=\"https://pullrequestquantifierfeedback.azurewebsites.net/feedback?payload=eyJBdXRob3JOYW1lIjoia2FkZW5ybyIsIlJlcG9zaXRvcnlMaW5rIjoiaHR0cHM6Ly9naXRodWIuY29tL1Bvd2VyU2hlbGwvUG93ZXJTaGVsbCIsIlB1bGxSZXF1ZXN0TGluayI6Imh0dHBzOi8vZ2l0aHViLmNvbS9Qb3dlclNoZWxsL1Bvd2VyU2hlbGwvcHVsbC8xODQ3MyIsIkV2ZW50VHlwZSI6IlRodW1ic0Rvd24ifQ==&amp;anonymous=True\" target=\"_blank\" title=\"Thumbs down\"><strong>&nbsp;:thumbsdown:</strong></a> (<a href=\"MAILTO:prquantifier@microsoft.com\" title=\"Mail to prquantifier@microsoft.com\">Email</a>)\r\n[Customize PullRequestQuantifier](https://github.com/PowerShell/PowerShell/blob/master/.github/prquantifier.yaml) for this repository.\r\n\r\n",
      "created_at": "2022-11-05T17:02:05Z",
      "updated_at": "2022-11-05T17:02:05Z"
    },
    {
      "author": "microsoft-github-policy-service[bot]",
      "author_association": "NONE",
      "body": "<!-- Policy app identification https://img.shields.io/static/v1?label=ContributorLicenseAgreement. -->\n@kadenro please read the following Contributor License Agreement(CLA). If you agree with the CLA, please reply with the following information.\n\n```\n@microsoft-github-policy-service agree [company=\"{your company}\"]\n```\n\n> Options:\n> - (default - no company specified) I have sole ownership of intellectual property rights to my Submissions and I am not making Submissions in the course of work for my employer.\n> - (when company given) I am making Submissions in the course of work for my employer (or my employer has intellectual property rights in my Submissions by contract or applicable law). I have permission from my employer to make Submissions and enter into this Agreement on behalf of my employer. By signing below, the defined term “You” includes me and my employer.\n\n<details>\n    <summary>Contributor License Agreement</summary>\n    \n### Contribution License Agreement\nThis Contribution License Agreement (**“Agreement”**) is agreed to by the party signing below (**“You”**),\nand conveys certain license rights to Microsoft Corporation and its affiliates (“Microsoft”) for Your\ncontributions to Microsoft open source projects. This Agreement is effective as of the latest signature\ndate below.\n1. **Definitions**.\n**“Code”** means the computer software code, whether in human-readable or machine-executable form,\nthat is delivered by You to Microsoft under this Agreement.\n**“Project”** means any of the projects owned or managed by Microsoft and offered under a license\napproved by the Open Source Initiative (www.opensource.org).\n**“Submit”** is the act of uploading, submitting, transmitting, or distributing code or other content to any\nProject, including but not limited to communication on electronic mailing lists, source code control\nsystems, and issue tracking systems that are managed by, or on behalf of, the Project for the purpose of\ndiscussing and improving that Project, but excluding communication that is conspicuously marked or\notherwise designated in writing by You as “Not a Submission.”\n**“Submission”** means the Code and any other copyrightable material Submitted by You, including any\nassociated comments and documentation.\n2. **Your Submission**. You must agree to the terms of this Agreement before making a Submission to any\nProject. This Agreement covers any and all Submissions that You, now or in the future (except as\ndescribed in Section 4 below), Submit to any Project.\n3. **Originality of Work**. You represent that each of Your Submissions is entirely Your original work.\nShould You wish to Submit materials that are not Your original work, You may Submit them separately\nto the Project if You (a) retain all copyright and license information that was in the materials as You\nreceived them, (b) in the description accompanying Your Submission, include the phrase “Submission\ncontaining materials of a third party:” followed by the names of the third party and any licenses or other\nrestrictions of which You are aware, and (c) follow any other instructions in the Project’s written\nguidelines concerning Submissions.\n4. **Your Employer**. References to “employer” in this Agreement include Your employer or anyone else\nfor whom You are acting in making Your Submission, e.g. as a contractor, vendor, or agent. If Your\nSubmission is made in the course of Your work for an employer or Your employer has intellectual\nproperty rights in Your Submission by contract or applicable law, You must secure permission from Your\nemployer to make the Submission before signing this Agreement. In that case, the term “You” in this\nAgreement will refer to You and the employer collectively. If You change employers in the future and\ndesire to Submit additional Submissions for the new employer, then You agree to sign a new Agreement\nand secure permission from the new employer before Submitting those Submissions.\n5. **Licenses**.\n  * **Copyright License**. You grant Microsoft, and those who receive the Submission directly or\nindirectly from Microsoft, a perpetual, worldwide, non-exclusive, royalty-free, irrevocable license in the\nSubmission to reproduce, prepare derivative works of, publicly display, publicly perform, and distribute\nthe Submission and such derivative works, and to sublicense any or all of the foregoing rights to third\nparties.\n  * **Patent License**. You grant Microsoft, and those who receive the Submission directly or\nindirectly from Microsoft, a perpetual, worldwide, non-exclusive, royalty-free, irrevocable license under\nYour patent claims that are necessarily infringed by the Submission or the combination of the\nSubmission with the Project to which it was Submitted to make, have made, use, offer to sell, sell and\nimport or otherwise dispose of the Submission alone or with the Project.\n  * **Other Rights Reserved**. Each party reserves all rights not expressly granted in this Agreement.\nNo additional licenses or rights whatsoever (including, without limitation, any implied licenses) are\ngranted by implication, exhaustion, estoppel or otherwise.\n6. **Representations and Warranties**. You represent that You are legally entitled to grant the above\nlicenses. You represent that each of Your Submissions is entirely Your original work (except as You may\nhave disclosed under Section 3). You represent that You have secured permission from Your employer to\nmake the Submission in cases where Your Submission is made in the course of Your work for Your\nemployer or Your employer has intellectual property rights in Your Submission by contract or applicable\nlaw. If You are signing this Agreement on behalf of Your employer, You represent and warrant that You\nhave the necessary authority to bind the listed employer to the obligations contained in this Agreement.\nYou are not expected to provide support for Your Submission, unless You choose to do so. UNLESS\nREQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING, AND EXCEPT FOR THE WARRANTIES\nEXPRESSLY STATED IN SECTIONS 3, 4, AND 6, THE SUBMISSION PROVIDED UNDER THIS AGREEMENT IS\nPROVIDED WITHOUT WARRANTY OF ANY KIND, INCLUDING, BUT NOT LIMITED TO, ANY WARRANTY OF\nNONINFRINGEMENT, MERCHANTABILITY, OR FITNESS FOR A PARTICULAR PURPOSE.\n7. **Notice to Microsoft**. You agree to notify Microsoft in writing of any facts or circumstances of which\nYou later become aware that would make Your representations in this Agreement inaccurate in any\nrespect.\n8. **Information about Submissions**. You agree that contributions to Projects and information about\ncontributions may be maintained indefinitely and disclosed publicly, including Your name and other\ninformation that You submit with Your Submission.\n9. **Governing Law/Jurisdiction**. This Agreement is governed by the laws of the State of Washington, and\nthe parties consent to exclusive jurisdiction and venue in the federal courts sitting in King County,\nWashington, unless no federal subject matter jurisdiction exists, in which case the parties consent to\nexclusive jurisdiction and venue in the Superior Court of King County, Washington. The parties waive all\ndefenses of lack of personal jurisdiction and forum non-conveniens.\n10. **Entire Agreement/Assignment**. This Agreement is the entire agreement between the parties, and\nsupersedes any and all prior agreements, understandings or communications, written or oral, between\nthe parties relating to the subject matter hereof. This Agreement may be assigned by Microsoft.\n\n</details>",
      "created_at": "2022-11-05T17:02:06Z",
      "updated_at": "2022-11-05T17:02:06Z"
    },
    {
      "author": "msftbot[bot]",
      "author_association": "NONE",
      "body": "This pull request has been automatically marked as Review Needed because it has been there has not been any activity for **7 days**.\nMaintainer, please provide feedback and/or mark it as `Waiting on Author`",
      "created_at": "2022-11-13T02:00:58Z",
      "updated_at": "2022-11-13T02:00:58Z"
    }
  ],
  "created_at": "2022-11-05T17:02:01Z",
  "number": 18473,
  "state": "open",
  "title": "WIP:PSModuleAutoLoadingPreference No Longer Accepts Bogus Values",
  "updated_at": "2022-11-13T02:00:58Z"
}