{
  "_url": "https://github.com/PowerShell/PowerShell/issues/1932",
  "author": "sdaugherty",
  "body": "Might want to update documentation. The Ubuntu 14.04 package will work on Debian (or Devuan) jessie.\n",
  "closed_at": "2016-09-13T18:39:50Z",
  "comments": [
    {
      "author": "ghost",
      "author_association": "NONE",
      "body": "Yes, but this isn't recommended (on the Debian side). See https://wiki.debian.org/DontBreakDebian#Don.27t_make_a_FrankenDebian\n\nThere's work both here and in Debian to get powershell available as an official package. I'd hope Devuan doesn't duplicate any work but I have no contact with anyone in that project.\n\nhttps://bugs.debian.org/cgi-bin/bugreport.cgi?bug=834756\n",
      "created_at": "2016-08-21T05:40:30Z",
      "updated_at": "2016-08-21T05:40:30Z"
    },
    {
      "author": "sdaugherty",
      "author_association": "NONE",
      "body": "@voltagex That specifically refers to _repositories_ not individual packages. Repositories not meant for Debian can break a system because they can pull in packages as dependencies that conflict with, or are newer than Debian packages. (and therefore, won't automatically receive security updates.\n",
      "created_at": "2016-08-21T07:18:47Z",
      "updated_at": "2016-08-21T07:18:47Z"
    },
    {
      "author": "sdaugherty",
      "author_association": "NONE",
      "body": "As an aside, despite what Debian may claim, packages in \"stable\" often _are_ too old to be useful, at least if you expect any support from upstream maintainers or communities. Ruby, nodejs, and the like are all practically useless as packaged by Debian because of the glacially slow release cycles in Debian.\n",
      "created_at": "2016-08-21T07:24:34Z",
      "updated_at": "2016-08-21T07:24:34Z"
    },
    {
      "author": "ghost",
      "author_association": "NONE",
      "body": "I agree with you on stable packages being too old. I'd still like to try to get things done the \"right\" way.\n",
      "created_at": "2016-08-21T07:57:07Z",
      "updated_at": "2016-08-21T07:57:07Z"
    },
    {
      "author": "sdaugherty",
      "author_association": "NONE",
      "body": "@voltagex There's plenty of software that simply maintains a single current, third party package compatible with both Ubuntu and Debian - this is the approach used by Visual Studio Code and with Google Chrome., so it's nothing really new. \n",
      "created_at": "2016-08-21T17:02:46Z",
      "updated_at": "2016-08-21T17:02:46Z"
    },
    {
      "author": "andschwa",
      "author_association": "MEMBER",
      "body": "Until we're actually supported Debian (as in, added its RID to our build scripts, run tests on it, and ship a package, regardless of it being the Ubuntu package or not), we're not going to claim support in documentation. Thanks for investigating though!\n",
      "created_at": "2016-09-13T18:10:26Z",
      "updated_at": "2016-09-13T18:10:26Z"
    }
  ],
  "created_at": "2016-08-19T03:46:36Z",
  "labels": [],
  "number": 1932,
  "state": "closed",
  "title": "Ubuntu 14.04 packages are installable on Debian/Devuan Jessie as well.",
  "updated_at": "2016-09-13T18:39:50Z"
}