{
  "_url": "https://github.com/PowerShell/PowerShell/issues/2015",
  "author": "AndrewGaspar",
  "body": "It would be useful for PowerShell sessions to be restored to some degree after a Windows Update. I'll often have several PowerShell windows open with different contexts for different projects and lose all that state whenever my Windows OS updates.\n\nAs a Windows Insider, my machine frequently takes OS updates. After update, only applications that register for [\"Application Restart\"](https://msdn.microsoft.com/en-us/library/aa373347%28v=vs.85%29.aspx) are restarted. This includes a hodge podge of Visual Studio, Office, and some in-box apps. Currently PowerShell is a notable exception.\n\nI'm not asking for full state restoration - I understand that it would probably be impossible to preserve variables faithfully enough to attempt that. I just want enough context to allow me to quickly re-orient myself to what I was working on, say, the previous Friday. It would be useful for each shell to be re-opened to the same working directory as when it closed and with a copy of the previous session's console output displayed before the prompt, with a clear demarcation that the output is a different session.\n\nMock-up:\n![image](https://cloud.githubusercontent.com/assets/2292643/17860985/1ea5eb98-6844-11e6-9a08-097032ad3d33.png)\n",
  "closed_at": null,
  "comments": [
    {
      "author": "joeyaiello",
      "author_association": "CONTRIBUTOR",
      "body": "Yeah, I'd find this super useful as well. I didn't realize that \"Application Restart\" was a thing until Outlook started itself a few updates in a row without being registered as a Startup app.\n\nMight be as simple as capturing the buffer and sticking it back in without reloading any assemblies or state. \n",
      "created_at": "2016-09-06T19:01:59Z",
      "updated_at": "2016-09-06T19:01:59Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "Perhaps it should be PSReadline feature.",
      "created_at": "2018-08-27T14:36:08Z",
      "updated_at": "2018-08-27T14:36:08Z"
    },
    {
      "author": "lzybkr",
      "author_association": "MEMBER",
      "body": "This definitely wouldn't be a `PSReadLine` specific feature, but `PSReadLine` could participate. I'm imagining PowerShell would give each module an opportunity to persist some state which then gets restored on restart.\r\n\r\n[Yori](https://github.com/malxau/yori) is an example of a shell that implements application restart, see [restart.c](https://github.com/malxau/yori/blob/c64034de5517d37df4682b3ba028ed123116a754/sh/restart.c) for implementation details.",
      "created_at": "2018-08-27T20:28:41Z",
      "updated_at": "2018-08-27T20:28:41Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "My comment was about \"Might be as simple as capturing the buffer and sticking it back in without reloading any assemblies or state.\"\r\nSave/restore state for AD or Azure module I believe is very problematic. In particular, we can save/restore a credentials to Windows but not yet on Unix-es.\r\n",
      "created_at": "2018-08-28T03:12:42Z",
      "updated_at": "2018-08-28T03:12:42Z"
    },
    {
      "author": "lzybkr",
      "author_association": "MEMBER",
      "body": "I don't think many modules would opt-in, but I'm not a fan of pretending to restore minimal state in PSReadLine, I'd much rather it be a core PowerShell feature that PSReadLine extends.\r\n\r\nAnd folks would definitely want expect some state restored, like environment variables, and global variables (probably with serialization, so they won't be live objects on restore, but might still be useful.)",
      "created_at": "2018-08-28T04:18:50Z",
      "updated_at": "2018-08-28T04:18:50Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "Eh, I would be happy if AD module could restore the previous state, but I believe that most AD cmdlets/scripts will not work with objects restored using serialization. It seems the command history and the trace log are the best that we can get here.\r\nAlso as user I'd expect that PowerShell save/restore state for _all_ loaded in current session modules.",
      "created_at": "2018-08-28T04:30:24Z",
      "updated_at": "2018-08-28T04:30:24Z"
    },
    {
      "author": "lzybkr",
      "author_association": "MEMBER",
      "body": "And there lies the dilemma - if you restore some state but not what the user expects, are you providing value? Is it all or nothing, or is some in between valuable?\r\n\r\nIf restoring some but not all state is reasonable, then I'd start with what I suggested instead of just the screen and the maybe the current command line. ",
      "created_at": "2018-08-28T05:38:38Z",
      "updated_at": "2018-08-28T05:38:38Z"
    },
    {
      "author": "kilasuit",
      "author_association": "COLLABORATOR",
      "body": "Adding the engine WG to this issue",
      "created_at": "2022-09-06T23:56:47Z",
      "updated_at": "2022-09-06T23:56:47Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "I think the terminal should be responsible for preserving the scroll buffer contents on restart (iTerm2 sort of does this).  However, pwsh could preserve the current working directory location.  I would hesitate on trying to provide full fidelity as people may come to expect it and bad behaviors can happen if it's not 100%.  Instead, make it clear it's NOT anything more than scroll buffer (which PowerShell won't have and can't restore) and working directory.",
      "created_at": "2022-09-19T20:21:51Z",
      "updated_at": "2022-09-19T20:21:51Z"
    },
    {
      "author": "dkaszews",
      "author_association": "CONTRIBUTOR",
      "body": "Agreed with @SteveL-MSFT , if you want to preserve the buffer and not variables, then it's a feature for the terminal and PowerShell. I can see it being useful, it's just not responsibility of the shell.",
      "created_at": "2022-09-20T19:01:16Z",
      "updated_at": "2022-09-20T19:01:16Z"
    }
  ],
  "created_at": "2016-08-22T15:43:25Z",
  "number": 2015,
  "state": "open",
  "title": "Windows: Preserve shell state across PC restarts initiated by WU",
  "updated_at": "2022-09-20T19:01:16Z"
}