{
  "_url": "https://github.com/PowerShell/PowerShell/issues/2049",
  "author": "sevenam",
  "body": "I realise that Powershell is not c#, and this is probably asking a lot, but:\nI think Powershell code would be less awkward to write, if it had aliases/support for the following:\n\nCan -lt also be: <\nCan -gt also be: >\nCan $true also be: true\nCan $false also be: false\nCan -eq also be: ==\nCan -ne also be: !=\nCan -le also be: <=\nCan -ge also be: >=\nCan -or also be: ||\nCan -and also be: &&\n\nPS (no pun intended): Every time I write Powershell scripts I have to think really hard to remember if -lt is LargerThan or LessThan :)\n",
  "closed_at": "2016-12-08T00:55:22Z",
  "comments": [
    {
      "author": "ygra",
      "author_association": "NONE",
      "body": "`<` and `>` are redirection operators. They already have a meaning in a shell.\n\n`true` and `false` would probable have to become yet another class of literals. Currently they aren't supported by the grammar in that way, but variables are. Furthermore, there is rarely a need for them in most scripts (except maybe for passing a boolean value to a .NET method).\n\n`||` and `&&` have different semantics than `-or` and `-and` regarding return values and what happens with output. PowerShell not having `||` and `&&` can be annoying, but I'm fairly sure it doesn't exist so far because people haven't found a viable way how to make it work in an object-based shell where program output is the result of the expression running said program, for example.\n",
      "created_at": "2016-08-24T13:44:53Z",
      "updated_at": "2016-08-24T13:44:53Z"
    },
    {
      "author": "sevenam",
      "author_association": "NONE",
      "body": "This request is only for convenience of course, to make it quicker to write Powershell.\n- `<` and `>` should’t have a meaning inside a statement even in a shell though?\n- Looking in my script \"history\", I tend to use true/false quite frequently in scripts (mostly boolean functions), but maybe I’m doing it wrong.\n\nMaybe a better way for this productivity change would be an extension for Visual Studio Code or similar, that would simply fix typos (e.g. replace `<` with `-lt` if used inside a statement).\n",
      "created_at": "2016-08-25T07:19:52Z",
      "updated_at": "2016-08-25T07:19:52Z"
    },
    {
      "author": "jpsnover",
      "author_association": "CONTRIBUTOR",
      "body": "We tired to do this many times in the early days of PS but the only way we could disambiguate the syntax was by changing the redirection operators.  We proposed changing them (we might have actually released a beta) to :> and :<\n\ne.g.\ninstead of:\nPS> GPS > t.txt\nyou would type\nPS> GPS :> t.txt\n\nThe feedback from the community was EXTREMELY VOLUMINOUS AND CLEAR - NFW!\n\nThat's how we ended up keeping -lt -gt etc.\n",
      "created_at": "2016-08-25T15:02:05Z",
      "updated_at": "2016-08-25T15:02:05Z"
    },
    {
      "author": "rkeithhill",
      "author_association": "COLLABORATOR",
      "body": "And, as C# dev switching back and forth between C# & PowerShell, I will occasionally use the wrong operator.  But I fix it and move on.  \n\nWhat I really like about the `-<operator>` approach is that PowerShell can (and does) provide a very rich set of operators.  Many more than the set of available special characters on a typical keyboard. :-)  \n\nPlus this approach is consistent with other shells like [Bash](http://www.tldp.org/LDP/abs/html/comparison-ops.html).  Remember, PowerShell is a `shell scripting language` and not a general purpose programming language.\n",
      "created_at": "2016-08-25T16:21:02Z",
      "updated_at": "2016-08-25T16:21:02Z"
    },
    {
      "author": "joeyaiello",
      "author_association": "CONTRIBUTOR",
      "body": "I'm also in the camp that we should close this as \"by design\", as I don't see a way of supporting this without changing the existing redirection operators or their behavior.\n\n/cc @PowerShell/powershell-committee to give them a chance to disagree with me before we close it.\n",
      "created_at": "2016-09-06T18:52:50Z",
      "updated_at": "2016-09-06T18:52:50Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "I think @rkeithhill touched upon an important data point which is the current syntax allows for many more operators.  Adding an optional secondary way to represent a subset of the operators may make reading scripts more confusing.  Agree with \"by design\".  I think if the community wants to pursue this further, someone should author a RFC.\n",
      "created_at": "2016-09-06T19:10:38Z",
      "updated_at": "2016-09-06T19:10:38Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "@PowerShell/powershell-committee reviewed this and agreed that this is by-design.  we don't want to introduce multiple ways to do the same thing which leads to confusion\n",
      "created_at": "2016-11-02T23:41:34Z",
      "updated_at": "2016-11-02T23:41:34Z"
    }
  ],
  "created_at": "2016-08-24T11:57:23Z",
  "number": 2049,
  "state": "closed",
  "title": "Extended operators support",
  "updated_at": "2016-12-08T00:55:22Z"
}