{
  "_url": "https://github.com/PowerShell/PowerShell/issues/2176",
  "author": "jhclark",
  "body": "Problem: Native (non-object) pipes between native processes are ~1000X faster versus PowerShell object pipes. This is especially problematic for us systems people who like to work on 500MB-5GB files routinely.\n\nProposed solution: Automatically detect 2 native processes (neither is a function nor commandlet), and use a direct system pipe.\n\nTimings from my box:\n\n1) Powershell object pipe\n\n```\nPS> time { cat bigfile.txt | measure -line }\nMinutes           : 15\nSeconds           : 14\nTotalSeconds      : 914.4296154\n```\n\n2) Using cygwin utilities\n\n```\nPS> time { FastPipe { C:\\cygwin\\bin\\cat.exe bigfile.txt | c:\\cygwin\\bin\\wc -l } }\nTotalSeconds      : 1.7950218\n```\n\n*FastPipe is a hack I wrote that stringifies the scriptblock and passes it to cmd.exe for its faster raw pipes. Perhaps this is the best solution for now?\n",
  "closed_at": "2016-09-06T16:07:38Z",
  "comments": [
    {
      "author": "GeeLaw",
      "author_association": "NONE",
      "body": "No. There is NOT pipes between native commands.\n\nWhen invoking a native command, PowerShell runs the command, interprets the `stdout` of it and make it a typed output.\n\nIf you are sending an object to a native command, PowerShell outputs it into the `stdin` of that command.\n\nWith those two combined, if you do `native | native` on PowerShell, PowerShell will \"help\" you corrupt the `stdout` of the first native and of course, the `stdin` of the second native.\n\nUse `Start-Process` or `System.Diagnostics.Process` to invoke native commands.\n",
      "created_at": "2016-09-05T07:07:00Z",
      "updated_at": "2016-09-05T07:07:00Z"
    },
    {
      "author": "jhclark",
      "author_association": "NONE",
      "body": "I am aware that this is not the current implementation and that is what I would like changed.\n\nThe object in the middle model makes sense for functions and commandlets, but not native processes, both in terms of efficiency and possible data corruption.\n\nIf you believe this is a feature and not a deficiency, could you provide a concrete user case?\n\nGet Outlook for Android\n\nOn Mon, Sep 5, 2016 at 12:07 AM -0700, \"Gee Law\" notifications@github.com wrote:\n\nNo. There is NOT pipes between native commands.\n\nWhen invoking a native command, PowerShell runs the command, interprets the stdout of it and make it a typed output.\n\nIf you are sending an object to a native command, PowerShell outputs it into the stdin of that command.\n\nWith those two combined, if you do native | native on PowerShell, PowerShell will \"help\" you corrupt the stdout of the first native and of course, the stdin of the second native.\n\nUse Start-Process or System.Diagnostics.Process to invoke native commands.\n\n—\nYou are receiving this because you authored the thread.\nReply to this email directly, view it on GitHub, or mute the thread.\n",
      "created_at": "2016-09-05T16:00:00Z",
      "updated_at": "2016-09-05T16:00:00Z"
    },
    {
      "author": "GeeLaw",
      "author_association": "NONE",
      "body": "I don't believe that this is a useful feature. There is already an issue addressing this. See #559. This issue is mostly a duplicate/sunset of that issue.\n\n---\n\nAnd do note my sarcasm on this \"smart oo pipe between native utilities\", I said PS \"helped\" you currput the streams.\n",
      "created_at": "2016-09-05T16:55:02Z",
      "updated_at": "2016-09-05T16:56:54Z"
    },
    {
      "author": "jhclark",
      "author_association": "NONE",
      "body": "I could go for better language than \"this is not a useful feature\" -- I'm quite certain that it is.\n\nHowever, I do buy that it is a duplicate of #1908, which appears to be discussed in #559 now and actively worked on by @vors on the PowerShell team.\n",
      "created_at": "2016-09-06T16:07:38Z",
      "updated_at": "2016-09-06T16:07:38Z"
    }
  ],
  "created_at": "2016-09-03T16:29:57Z",
  "labels": [
    "Resolution-Duplicate",
    "Issue-Enhancement",
    "WG-Engine"
  ],
  "number": 2176,
  "state": "closed",
  "title": "Pipes between native processes are too slow",
  "updated_at": "2016-09-06T16:07:38Z"
}