{
  "_url": "https://github.com/PowerShell/PowerShell/issues/2198",
  "author": "SteveL-MSFT",
  "body": "Need to investigate how to implement JEA (Just Enough Administratio) on Linux\n",
  "closed_at": null,
  "comments": [
    {
      "author": "ArieHein",
      "author_association": "NONE",
      "body": "General question: \nWhy would a Linux sysadmin stop using BASH with remote commands and swap to a JEA endpoint ?\n\nI mean on a windows machine, I can stop RDP, create a JEA endpoint, and give my NOC team a script to do a specific job using specific cmdlets that I pre-configured in the JEA endpoint. This way I closed the GUI way, didn't give them local admin to the box so they cant use the other methods to remotely run commands.\n\nWhat's the equivalent in Linux world ? Wouldn't a SSH with BASH just override the JEAL ( JEA on Linux :)  )\n",
      "created_at": "2016-09-06T21:00:13Z",
      "updated_at": "2016-09-06T21:00:13Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "Good question.  From my perspective, this backlog item isn't to copy JEA as it exists on Windows today to Linux, but to investigate scenarios that necessitated JEA and see how it applies to Linux and what experience makes sense on Linux (ideally updating the Windows experience if it makes sense to have it consistent).  A possible outcome is that existing Linux tools are fine and this is just a documentation thing.\n",
      "created_at": "2016-09-06T21:12:31Z",
      "updated_at": "2016-09-06T21:12:31Z"
    },
    {
      "author": "ArieHein",
      "author_association": "NONE",
      "body": "Can you elevate a powershell script to act as if one used sudo root or similar ?\nIf I wanted my NOC to run a remote command on a Linux box and I didn't want to give them admin rights but the command itself necessitated higher permission, would PS be able to do it via JEA ?\n\nWhat tools do Linux Sysadmins have today to carry such delegation tasks ?\n",
      "created_at": "2016-09-06T21:32:14Z",
      "updated_at": "2016-09-06T21:34:57Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "Currently you can elevate the entire powershell session via sudo.  There is an existing issue to get sudo working within a PowerShell session https://github.com/PowerShell/PowerShell/issues/1527\n",
      "created_at": "2016-09-06T21:35:47Z",
      "updated_at": "2016-09-06T21:35:47Z"
    }
  ],
  "created_at": "2016-09-06T17:53:41Z",
  "labels": [
    "WG-Engine",
    "Issue-Discussion"
  ],
  "number": 2198,
  "state": "open",
  "title": "JEA on Linux",
  "updated_at": "2019-03-30T14:56:52Z"
}