{
  "_url": "https://github.com/PowerShell/PowerShell/issues/2235",
  "author": "bielawb",
  "body": "When attempting to use ssh key file with incorrect permissions, PowerShell falls back to user/password authentication without any information why key file was ignored. I would expect warning message instead (perhaps even an error) to notify me about issue with the key file.\n## Steps to reproduce\n\n``` powershell\nchmod 764 KeyFile\nNew-PSSession -HostName NameOfHost -UserName User -KeyPath KeyFile\n```\n## Expected behavior\n\n``` powershell\nWARNING: Permissions 0764 for './jea-test' are too open.\nIt is required that your private key files are NOT accessible by others.\nThis private key will be ignored.\nUser@NameOfHost's password:\n```\n## Actual behavior\n\n``` powershell\nUser@NameOfHost's password:\n```\n## Environment data\n\n``` powershell\n> $PSVersionTable\nName                           Value\n----                           -----\nPSVersion                      6.0.0-alpha\nPSEdition                      Core\nPSCompatibleVersions           {1.0, 2.0, 3.0, 4.0...}\nBuildVersion                   3.0.0.0\nGitCommitId                    v6.0.0-alpha.9\nCLRVersion\nWSManStackVersion              3.0\nPSRemotingProtocolVersion      2.3\nSerializationVersion           1.1.0.1\n```\n",
  "closed_at": "2016-09-16T18:12:28Z",
  "comments": [
    {
      "author": "PaulHigin",
      "author_association": "COLLABORATOR",
      "body": "Note that if you are not building the latest branch binaries you don't have a recent fix (PR 1856) that handles errors returned by the ssh.exe client.  The latest build packages do not have this fix.  However this fix is not complete since it currently suppresses ssh.exe WARNINGs and only handles errors.  This needs to be fixed.\n\nBut I notice that ssh.exe client does not return any warning information for me if a key is invalid, it just goes to the next allowed authentication mechanism:\n\n``` powershell\nssh <userName>@<hostName> -i ./InvalidKey\n<userName>@<hostName>'s password:\n```\n\nYou can get verbose debugging information by using the -vv switch but it is still not very revealing, probably for security reasons.  I think New-PSSession should be updated to support verbose output from ssh, maybe by enhancing the -verbose common parameter.\n\nAlso I noticed that New-PSSession does not correctly handle partial key paths and I have a PR coming shortly to fix this.\n",
      "created_at": "2016-09-12T15:03:57Z",
      "updated_at": "2016-09-12T15:03:57Z"
    },
    {
      "author": "PaulHigin",
      "author_association": "COLLABORATOR",
      "body": "PR 2249 partial path resolution and path validation key paths.\n",
      "created_at": "2016-09-16T18:12:28Z",
      "updated_at": "2016-09-16T18:12:28Z"
    }
  ],
  "created_at": "2016-09-12T06:53:50Z",
  "number": 2235,
  "state": "closed",
  "title": "New-PSSession fails silently when key file has incorrect permissions.",
  "updated_at": "2016-09-16T18:12:28Z"
}