{
  "_url": "https://github.com/PowerShell/PowerShell/issues/2289",
  "author": "be5invis",
  "body": "",
  "closed_at": null,
  "comments": [
    {
      "author": "lzybkr",
      "author_association": "MEMBER",
      "body": "I don't think doing that by default is a good idea. Writing objects to the pipe while measuring would change how that script block performs.\n\nYou might think we could turn off the stopwatch while writing objects to downstream pipes, but downstream code that isn't measured could still have a significant impact on the code being measured. \n\nFormat and output is not always efficient. It may allocate a lot of memory. We could trigger garbage collection in ways that make measuring the performance of the script block harder.\n\nGiven this, I think it's reasonable to require `Out-Host` if you really want to measure the impact of formatting.\n",
      "created_at": "2016-09-17T16:07:22Z",
      "updated_at": "2016-09-17T18:24:02Z"
    },
    {
      "author": "jpsnover",
      "author_association": "CONTRIBUTOR",
      "body": "All that is true and why we wouldn't want to change the default behavior but it seems reasonable to have a SWITCH parameter would would enable this.  \nI've wanted to do this myself a number of times.\n",
      "created_at": "2016-09-17T17:36:44Z",
      "updated_at": "2016-09-17T17:36:44Z"
    },
    {
      "author": "vors",
      "author_association": "COLLABORATOR",
      "body": "@be5invis it would be great if you can provide more details, i.e. the motivation example.\n\nMy best guess is that request is not about a downstream pipeline, but about native commands. \n\n``` powershell\nMeasure-Command { ping ya.ru }\n```\n\ncurrently, the output of ping is collected and not passed down.\n\nThe reason I think that's the request is because the original title said STDOUT and STDERR, so I immediately think about native executables.\n\nUPD: note that stderr is already behaves as requested, and the behavior for stdout can be achived with \n\n``` powershell\nMeasure-Command { ping ya.ru | Write-Host }\n```\n",
      "created_at": "2016-09-17T17:56:30Z",
      "updated_at": "2016-09-17T18:02:14Z"
    },
    {
      "author": "ygra",
      "author_association": "NONE",
      "body": "So something like a `-PassThru` parameter? In that case it's probably beneficial to enable some way of writing the measurement results to a variable somehow, lest they are to appear with the output of the measured command (which would kinda defy the purpose).\n",
      "created_at": "2016-09-19T20:04:00Z",
      "updated_at": "2016-09-19T20:04:00Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "Measure-Command takes ValueFromPipeline. So the general approach is:\n\n``` powershell\n1,2,3,4,5 | where { largescriptblock } | foreach {...}\n1,2,3,4,5 | measure-command -MeasureVariable outArray  -PipeExpression { where {largescriptblock} } | foreach {...}\n```\n",
      "created_at": "2016-11-02T12:08:16Z",
      "updated_at": "2016-11-02T12:08:16Z"
    },
    {
      "author": "SteveLasker",
      "author_association": "NONE",
      "body": "A vote to including the output as a standard operation. I'd suggest we're over-focusing on the timing, and losing the context of what's being attempted. I've got a series of commands I'd like to time, because \"something isn't looking right\". If I don't have the output, I can't tell what's happening that might have caused a delay. While I appreciate measuring might further add to the amount of time, it's what we need to be useful. Please don't make me do some fancy stream output. Really, I just want my command to be wrapped with a start time, and end time, with the execution time. Perhaps put the timings in a green color.\r\nmeasure-command {docker build} -o true -h \"docker build\"\r\n-o true meaning enable the output\r\n-h is a header that gets included in the output\r\nThe other SteveL (SteveLas-MSFT)",
      "created_at": "2018-01-16T21:52:58Z",
      "updated_at": "2018-01-16T21:52:58Z"
    },
    {
      "author": "dobsa",
      "author_association": "NONE",
      "body": "Guys, you must be joking. Without showing the stdout and stderr while measuring, this command is largely useless. For a moment I rejoiced I finally found a way to measure a command execution time native to Windows, only to find that I cannot use it. I need to see the output of a command. I can hardly think of use cases where I would want to suppress  stdout and stderr. This is just madness. Please, bring the output back to screen.",
      "created_at": "2018-11-30T06:40:07Z",
      "updated_at": "2018-11-30T06:40:42Z"
    },
    {
      "author": "Mike-Devel",
      "author_association": "NONE",
      "body": "@dobsa: Not that I disagree, but `Measure-Command { <command> | Write-Host }` as suggested by @vors is imho good enough (but really needs to be documented).",
      "created_at": "2019-08-13T11:16:38Z",
      "updated_at": "2019-08-13T11:16:38Z"
    },
    {
      "author": "kojoru",
      "author_association": "NONE",
      "body": "A better idea is ` | Out-Default` as it will not affect unicode symbols unlike `| Write-Host`. And it's already in the docs apparently! \r\n\r\nI've sent a PR to make it easier to find there: https://github.com/MicrosoftDocs/PowerShell-Docs/pull/4783",
      "created_at": "2019-09-12T08:56:25Z",
      "updated_at": "2019-09-12T08:56:25Z"
    },
    {
      "author": "AndrewSav",
      "author_association": "NONE",
      "body": "A better default is to dispaly output on screen without the need so specify `| Out-Default` or `| Write-Host`. In most of the cases you want to see the output, not to suppress it.",
      "created_at": "2019-09-12T09:23:22Z",
      "updated_at": "2019-09-12T09:23:22Z"
    },
    {
      "author": "pete-om",
      "author_association": "NONE",
      "body": "Unfortunately, piping the output strips color :(",
      "created_at": "2019-11-20T03:09:57Z",
      "updated_at": "2019-11-20T03:09:57Z"
    },
    {
      "author": "felixfbecker",
      "author_association": "CONTRIBUTOR",
      "body": "This is not just about interactive use cases, there's a use case for using `Measure-Command` in scripts too. There `Out-Default` won't help you because it doesn't allow to further use the pipeline output for processing. I guess you could save it in a variable but then it's not streamed anymore, which can totally skew the numbers (e.g. imagine the pipeline is limited with `Select-Object -First` further down).\r\n\r\nCan we just have a `-PassThru` switch?",
      "created_at": "2020-01-31T10:03:47Z",
      "updated_at": "2020-01-31T10:04:00Z"
    },
    {
      "author": "sba923",
      "author_association": "CONTRIBUTOR",
      "body": "I vote for a _new switch_ that would result in getting the exact same output (color included ;-) ) as the raw command being timed.\r\n\r\nChanging the default behavior is probably a bad idea, for backwards-compatibility's sake.\r\n",
      "created_at": "2020-03-11T12:29:08Z",
      "updated_at": "2020-03-11T12:29:08Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "That's a fairly sensible suggestion. I don't see why we can't `Measure-Command -PassThru`",
      "created_at": "2020-03-11T19:53:50Z",
      "updated_at": "2020-03-11T19:53:50Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "Just to be clear, `Measure-Command -PassThru` would emit the objects that are output from the scriptblock AND write the measurements to the host?",
      "created_at": "2020-03-26T20:20:37Z",
      "updated_at": "2020-03-26T20:20:37Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "Hmm. I think it'd be best if it either:\r\n\r\n1. Created a new object, with properties `Data` and `Duration`, or\r\n2. Added a new property to the output object directly (similar to Add-Member), named `Duration` or something along those lines.",
      "created_at": "2020-03-26T20:23:06Z",
      "updated_at": "2020-03-26T20:36:09Z"
    },
    {
      "author": "SeeminglyScience",
      "author_association": "COLLABORATOR",
      "body": "@vexx32 that all seems pretty complicated compared to just saving the output to a variable no?\r\n\r\n```powershell\r\nMeasure-Command { $data = Invoke-MyTest }\r\n```\r\n\r\nvs\r\n\r\n```powershell\r\n$result = Measure-Command -PassThru { Invoke-MyTest }\r\n$data = $result.Data\r\n$result.Duration\r\n```\r\n\r\n@felixfbecker \r\n\r\n> I guess you could save it in a variable but then it's not streamed anymore, which can totally skew the numbers (e.g. imagine the pipeline is limited with `Select-Object -First` further down).\r\n\r\nWhy wouldn't the `Select-Object -First` be inside the `Measure-Command` scriptblock though? If you're trying to determine how long a code snippet takes to run, do you really want code downstream to alter it? Also as @SteveL-MSFT brought up, if you did have `Select-Object -First` downstream then you wouldn't get the execution length.",
      "created_at": "2020-03-26T21:42:50Z",
      "updated_at": "2020-03-26T21:42:50Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "> Just to be clear, Measure-Command -PassThru would emit the objects that are output from the scriptblock AND write the measurements to the host?\r\n\r\nThis is an exhaustive answer why we should not implement this request. We can always get the result with:\r\n\r\n```powershell\r\nMeasure-Command { $data = Invoke-MyTest }\r\n```\r\n",
      "created_at": "2020-03-27T05:44:07Z",
      "updated_at": "2020-03-27T05:44:07Z"
    },
    {
      "author": "sba923",
      "author_association": "CONTRIBUTOR",
      "body": "\"Getting the result\" (pipeline data) is not the same as \"getting the same results\" (display).",
      "created_at": "2020-03-27T10:18:23Z",
      "updated_at": "2020-03-27T10:18:23Z"
    },
    {
      "author": "felixfbecker",
      "author_association": "CONTRIBUTOR",
      "body": "> This is an exhaustive answer why we should not implement this request. We can always get the result with:\r\n> \r\n> ```powershell\r\n> Measure-Command { $data = Invoke-MyTest }\r\n> ```\r\n\r\nNo, we can't always do that. This may be possible in most scripts, and maybe even every script you wrote personally, but it's definitely not possible in all scripts. I very recently ran a complex script that processed GB of data through the pipeline. It is simply not possible to save the pipeline output in a variable first, because it would exceed the machine's memory. That is what actually led me to this issue.\r\n\r\nA minor downside is also that it's hard to statically analyze, e.g. VS Code will complain that `$data` is not used because it can't know that the script block is running in the parent's scope.\r\n\r\nThe argument that downstream consumers can slow down the pipeline is a valid one of course, and it can mean that the measured time does not represent _only_ time spent in the script block, but also time spent by the script block waiting because of back pressure. But you don't know if that is actually going to have an impact.  For example, in most cases, the \"downstream consumer\" will just be the host formatting + output, or maybe some light processing of the data. If what we are measuring involves IO, that time will be negligible, and as a user I would like to have the option to ignore it and tell PowerShell to just pipe it through anyway instead of requiring me to rewrite the whole script to not use pipelines (which again, may not even be possible due to memory constraints).\r\n\r\n_Ideally_ of course there would be a way to get the real time spent by the script block. I don't know if this is technically possible, but maybe it is, if the `Measure-Command` cmdlet has a steppable pipeline of the script block, maybe it could run the timer only when the script block is running, and pause it while downstream consumers are processing the emitted items. It could report both times, similar to how Unix's `time` reports multiple times. But even if this is not technically possible, it would still be useful to have `-PassThru` for the majority of the use cases.\r\n\r\nSince I mentioned Unix's `time`: `time` forwards all output too and doesn't swallow it. This means this is also yet another thing that's surprising for people using PowerShell on platforms other than Windows.\r\n\r\nAnswering to more questions from above:\r\n\r\n> Why wouldn't the Select-Object -First be inside the Measure-Command scriptblock though? If you're trying to determine how long a code snippet takes to run, do you really want code downstream to alter it?\r\n\r\nYes, in some cases that's exactly what I want to do. Imagine there's a cmdlet that does REST API calls with `-FollowRelLink`, i.e. it will paginate potentially forever. Limiting it at some point is _essential_, and as a user I am aware that it _would_ take longer if I didn't limit. I am fine with the limiting being taken into account for the execution time. I am asking to give the user the _option_ to make that work. But also keep in mind that as said, in most cases, the \"downstream consumer\" will simply be light processing + host output.\r\n\r\n> Just to be clear, Measure-Command -PassThru would emit the objects that are output from the scriptblock AND write the measurements to the host?\r\n\r\nI think that would be sensible, similar to how `-IncludeTotalCount` adds a TotalCount object to the output. It could be easily filtered out and redirected to e.g. the information stream in a `ForEach-Object`. But adding a `-MeasurementVariable` parameter also sounds like a good idea. There is definitely a use case for processing the measurement further as a `TimeSpan` object instead of writing it to the host, e.g. finding out what percentage of a total time a step took.",
      "created_at": "2020-03-27T11:03:04Z",
      "updated_at": "2020-03-27T11:03:04Z"
    },
    {
      "author": "SeeminglyScience",
      "author_association": "COLLABORATOR",
      "body": "> Yes, in some cases that's exactly what I want to do. Imagine there's a cmdlet that does REST API calls with `-FollowRelLink`, i.e. it will paginate potentially forever. Limiting it at some point is _essential_, and as a user I am aware that it _would_ take longer if I didn't limit. I am fine with the limiting being taken into account for the execution time. I am asking to give the user the _option_ to make that work. But also keep in mind that as said, in most cases, the \"downstream consumer\" will simply be light processing + host output.\r\n\r\nBut then that's part of the test, so why wouldn't that be included *in* the script block? Why is it necessary to do this:\r\n\r\n```powershell\r\nMeasure-Command { Invoke-LongCommand } | Select-Object -First 1\r\n```\r\n\r\nInstead of:\r\n\r\n```powershell\r\nMeasure-Command { Invoke-LongCommand | Select-Object -First 1 }\r\n```",
      "created_at": "2020-03-27T11:31:37Z",
      "updated_at": "2020-03-27T11:31:37Z"
    },
    {
      "author": "felixfbecker",
      "author_association": "CONTRIBUTOR",
      "body": "You can easily do that in an example code snippet on GitHub, but that doesn't mean it's easily possible in a complex script. We could be talking about dozens of layers of function calls across multiple files, where somewhere there's the `Select-Object`, and somewhere you want to `Measure`. You can't easily restructure all the scripts and functions just to move that in there. The user should have the option to avoid that.",
      "created_at": "2020-03-27T11:41:25Z",
      "updated_at": "2020-03-27T11:41:25Z"
    },
    {
      "author": "SeeminglyScience",
      "author_association": "COLLABORATOR",
      "body": "You wouldn't need to restructure anything, just wrap it in a script block:\r\n\r\n```powershell\r\nMeasure-Command {\r\n    & {\r\n        # complicated code here\r\n    } | Select-Object -First 1\r\n}\r\n```\r\n\r\n`Measure-Command` shouldn't measure things outside of what you tell it to.  If you want to change how it's measured, change the test, not the circumstances around it imo.",
      "created_at": "2020-03-27T11:46:02Z",
      "updated_at": "2020-03-27T11:46:02Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "@felixfbecker  `Measure-Command` cmdlet is not designed for scenarios you ask. The cmdlet is commonly used to measure simple script block in interactive session.\r\nFor more complex scenarios we could discuss injecting performance counters. They can provide more reliable information about script execution and more importantly for hosted applications too.\r\n\r\n",
      "created_at": "2020-03-27T16:30:31Z",
      "updated_at": "2020-03-27T16:30:31Z"
    },
    {
      "author": "JordanShurmer",
      "author_association": "NONE",
      "body": "Just going to add my voice to the conversation,\r\n\r\nI would also love a `-PassThru` flag on this command. It would indeed output the output from the script and it's own measurement output.\r\n \r\n> Since I mentioned Unix's time: time forwards all output too and doesn't swallow it. This means this is also yet another thing that's surprising for people using PowerShell on platforms other than Windows.\r\n\r\nI was surprised it didn't already have this functionality, I guess I am more familiar with `time` then this command still. Also, I agree with previous remarks about the common use case requiring devs to see the output of the command they're measuring and it's far more rare that I don't care about the output (at least, in my usage of this command)",
      "created_at": "2020-03-30T12:41:09Z",
      "updated_at": "2020-03-30T12:41:09Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "If the comparison is to the `time` command which writes its results to stderr, then perhaps `-PassThru` simply writes its measurements as verbose messages?  If you need to capture the measurement object for use later, then perhaps we need a `-MeasurementVariable` parameter?",
      "created_at": "2020-03-31T15:21:13Z",
      "updated_at": "2020-03-31T15:21:13Z"
    },
    {
      "author": "sba923",
      "author_association": "CONTRIBUTOR",
      "body": "yes / yes ;-)",
      "created_at": "2020-03-31T16:30:42Z",
      "updated_at": "2020-03-31T16:30:42Z"
    },
    {
      "author": "AikenBM",
      "author_association": "NONE",
      "body": "I'm also going to have to agree that this is a missed feature of `Measure-Command`.\r\n\r\nThe problem that I run into is that I want to know how long a command is going to take *including how long it takes to render output* if that command is going to do that. It's important to be able to capture reality with `Measure-Command`.\r\n\r\nIn my mind, when I run this:\r\n\r\n```\r\nMeasure-Command {\r\n    1..10000 | ForEach-Object { [Math]::Log($_) }\r\n}\r\n```\r\n\r\nI should get comparable time to doing this:\r\n\r\n```\r\n$s = [System.Diagnostics.Stopwatch]::StartNew()\r\n1..10000 | ForEach-Object { [Math]::Log($_) }\r\n$s.Stop()\r\n$s.Elapsed.TotalMilliseconds\r\n```\r\n\r\nAnd I don't.\r\n\r\nI get a difference of two orders of magnitude on my system (~60ms vs ~2800ms) because `Measure-Command` doesn't capture the time it takes to render output. \r\n\r\nI shouldn't have to modify my command to make that work, either, because then I have no way to know if it's performing as it is because that's accurate or because I modified it. You can easily modify it in such a way that it greatly increases the time, after all.\r\n\r\nFor example, there's a huge difference between these because of the number of pipelines constructed:\r\n\r\n```\r\n# 1 pipeline\r\n$a = Measure-Command {\r\n    1..10000 | ForEach-Object { [Math]::Log($_) } | Out-Default\r\n}\r\n\r\n# 10,001 pipelines\r\n$b = Measure-Command {\r\n    1..10000 | ForEach-Object { [Math]::Log($_) | Out-Default }\r\n}\r\n\r\n$a.TotalMilliseconds\r\n$b.TotalMilliseconds\r\n```\r\n\r\nThe second command takes twice as long on my system (~2700ms vs ~4300ms).  \"Okay,\" you say, \"so always use the first pattern.\" Well, if you're using a statement like `foreach` or `for`, you *can't* because they create empty pipelines. You can only do this:\r\n\r\n```\r\n$c = Measure-Command {\r\n    for ($i = 1; $i -le 10000; $i++) {\r\n        [Math]::Log($i) | Out-Default\r\n    }\r\n}\r\n$c.TotalMilliseconds\r\n```\r\n\r\nThat adds 10,000 pipeline constructions and teardowns to the loop. A loop that previously had no pipelines in it.\r\n\r\nYes, I can just use `System.Diagnostics.Stopwatch`. That's exactly what I do. But then I have to ask: What exactly is `Measure-Command` for if it's not to measure the actual time to complete?\r\n",
      "created_at": "2021-03-31T18:07:21Z",
      "updated_at": "2021-03-31T18:07:21Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "@AikenBM For your scenario Measure-Script cmdlet is better choice. I hope we get it soon with #13673.",
      "created_at": "2021-03-31T18:43:56Z",
      "updated_at": "2021-03-31T18:43:56Z"
    },
    {
      "author": "AikenBM",
      "author_association": "NONE",
      "body": "@iSazonov That's possible. Based on a quick reading, though, that looks like it's going to be more useful for second order analysis while I'm mostly interested in first order or top level analysis?\r\n\r\nMy argument is that `Measure-Command` isn't as useful as it should be for even first order analysis because it hides the actual rendering or output time cost. That the command should just act like `System.Diagnostics.Stopwatch` timing the whole command, and not modify or capture the output.",
      "created_at": "2021-03-31T19:21:48Z",
      "updated_at": "2021-03-31T19:21:48Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "@AikenBM You can download compiled artifacts from #13673, play with Measure-Script cmdlet and feedback. Currently Measure-Script cmdlet is a prototype and your (and others) feedback will be very useful.",
      "created_at": "2021-03-31T19:28:21Z",
      "updated_at": "2021-03-31T19:28:21Z"
    }
  ],
  "created_at": "2016-09-17T14:48:30Z",
  "labels": [
    "Issue-Enhancement",
    "WG-Cmdlets",
    "Issue-Discussion"
  ],
  "number": 2289,
  "state": "open",
  "title": "measure-command should be capable of streaming output either to the host or downstream cmdlets",
  "updated_at": "2021-03-31T19:28:22Z"
}