{
  "_url": "https://github.com/PowerShell/PowerShell/issues/2311",
  "author": "andschwa",
  "body": "I've updated the dependency lists in `download.sh`, `New-UnixPackage`, and the Linux installation documentation to match those used in the Dockerfiles.\n\nI feel that this probably needs to be pruned; but I am unsure which dependencies we do not need to specify (probably ones listed in \"required\" for the base distributions, and possibly some that .NET just states as required but is not (like libgcc?)). I would really like the dependency list to be reviewed by others.\n\nThis resolves #1937.\n\nAlso resolves #2211.\n",
  "closed_at": "2016-09-20T23:31:39Z",
  "comments": [
    {
      "author": "msftclas",
      "author_association": "NONE",
      "body": "Hi **@andschwa**, I'm your friendly neighborhood Microsoft Pull Request Bot (You can call me MSBOT). Thanks for your contribution!\n    <p>\n        It looks like you're a Microsoft contributor (Andy Schwartzmeyer). If you're full-time, we DON'T require a Contribution License Agreement. If you are a vendor, please DO sign the electronic Contribution License Agreement. It will take 2 minutes and there's no faxing! https://cla.microsoft.com.\n    </p>\n\nTTYL, MSBOT;\n",
      "created_at": "2016-09-19T23:41:21Z",
      "updated_at": "2016-09-19T23:41:21Z"
    },
    {
      "author": "vors",
      "author_association": "COLLABORATOR",
      "body": ":shipit: \n",
      "created_at": "2016-09-20T00:36:48Z",
      "updated_at": "2016-09-20T00:36:48Z"
    },
    {
      "author": "andschwa",
      "author_association": "MEMBER",
      "body": "So, at least on Ubuntu 16.04, here are the listed depends that are categorized as \"required\":\n- libc6\n- libgcc1\n- libtinfo5\n- libuuid1\n- zlib1g\n\nOn the one hand, these are required in the sense that .NET Core listed them as dependencies, and Ubuntu also requires them for a base system, so there is no harm in specifying them (they're already going to be installed, and PowerShell wouldn't work without them); but it's also redundant.\n\nMy _personal opinion right now_ is to keep them as dependencies. I see no reason not to except to clean things up slightly (but that clean up would be technically incorrect).\n\nSimilarly, the packages\n- libcurl3\n- libssl1.0.0\n\nare not _required_ in the sense that PowerShell would crash without them. They are necessary for practically anything use the web cmdlets (and we have issues filed due to libcurl not being installed). Perhaps these belong in recommends or suggests instead of depends, I'm not sure. I don't see major harm in depending on them (someone, somewhere, might complain we installed something unnecessarily for their use case, maybe).\n",
      "created_at": "2016-09-20T17:44:28Z",
      "updated_at": "2016-09-20T17:44:28Z"
    },
    {
      "author": "andschwa",
      "author_association": "MEMBER",
      "body": "@atanasa can you test that PowerShell installed via `download.sh` no longer repros #2211, and that `Start-PSBootstrap` results in a built PowerShell that also doesn't repro? I integrated your work-around into both scripts.\n",
      "created_at": "2016-09-20T22:50:00Z",
      "updated_at": "2016-09-20T22:50:00Z"
    },
    {
      "author": "andschwa",
      "author_association": "MEMBER",
      "body": "Got sign off from @vors, merging.\n",
      "created_at": "2016-09-20T23:31:33Z",
      "updated_at": "2016-09-20T23:31:33Z"
    }
  ],
  "created_at": "2016-09-19T23:41:17Z",
  "number": 2311,
  "state": "closed",
  "title": "Update dependency list",
  "updated_at": "2016-09-20T23:31:39Z"
}