{
  "_url": "https://github.com/PowerShell/PowerShell/issues/2380",
  "author": "adityapatwardhan",
  "body": "The change adds Compress-TestContent cmdlet to build.psm1 so that it can\ncompress the powershell test content. This is done only for daily builds.\n",
  "closed_at": "2016-09-29T19:38:12Z",
  "comments": [
    {
      "author": "msftclas",
      "author_association": "NONE",
      "body": "Hi **@adityapatwardhan**, I'm your friendly neighborhood Microsoft Pull Request Bot (You can call me MSBOT). Thanks for your contribution!\n    <p>\n        It looks like you're a Microsoft contributor (Aditya Patwardhan). If you're full-time, we DON'T require a Contribution License Agreement. If you are a vendor, please DO sign the electronic Contribution License Agreement. It will take 2 minutes and there's no faxing! https://cla.microsoft.com.\n    </p>\n\nTTYL, MSBOT;\n",
      "created_at": "2016-09-28T23:24:08Z",
      "updated_at": "2016-09-28T23:24:08Z"
    },
    {
      "author": "vors",
      "author_association": "COLLABORATOR",
      "body": "`Compress-TestContent` is very specific to the daily builds scenario. I think it's better to move it to appveyor.psm1 as well.\n",
      "created_at": "2016-09-29T03:22:44Z",
      "updated_at": "2016-09-29T03:22:44Z"
    },
    {
      "author": "adityapatwardhan",
      "author_association": "MEMBER",
      "body": "@vors The reason to have Compress-TestContent in build.psm1 was to have easy access to the 'test' folder using $PSScriptRoot\\test\\powershell. If we move this to appveyor.psm1 I would have to reference the folder using $PSScriptRoot..\\test\\powershell. Also no functions in appveryor.psm1 have a reference to the src code, they only use the built binaries. \n\nI am fine either ways, let me know what you think.\n",
      "created_at": "2016-09-29T18:59:57Z",
      "updated_at": "2016-09-29T18:59:57Z"
    }
  ],
  "created_at": "2016-09-28T23:24:05Z",
  "number": 2380,
  "state": "closed",
  "title": "Add archive with test content to AppVeyor artifacts for daily builds.",
  "updated_at": "2016-09-29T19:38:12Z"
}