{
  "_url": "https://github.com/PowerShell/PowerShell/issues/2408",
  "author": "JohnLudlow",
  "body": "The ability to mark parameters as Mandatory is great, but there is one critical omission - the ability to suppress prompts for Mandatory variables for a session.\n\nThe main reason this is important is because of unit testing. We want to set certain parameters as Mandatory=$true and then unit test (using Pester) that the parameters are in fact enforced as mandatory.\n\nUnfortunately, this actually causes Pester to pause waiting for input. Our temporary solution is to not use Mandatory.\n\nWhat we'd like to do is set something like `$MandatoryPreference = 'Continue'` so that if we miss something, we get an actual error thrown back\n",
  "closed_at": "2016-10-03T18:07:01Z",
  "comments": [
    {
      "author": "lzybkr",
      "author_association": "MEMBER",
      "body": "The PowerShell team has generally provided guidance that it's not important for cmdlet unit tests to test this behavior - a cmdlet unit test should simply verify that `Mandatory` is set as expected, e.g.\n\n``` powershell\n((Get-Command Get-Command).Parameters['Name'].Attributes | ? { $_ -is [parameter] }).Mandatory | Should Be $false\n```\n\nThis way, you leave the responsibility of testing prompting behavior on `Mandatory` to the core PowerShell parameter binder tests.\n",
      "created_at": "2016-10-03T15:39:01Z",
      "updated_at": "2016-10-03T15:39:47Z"
    },
    {
      "author": "JohnLudlow",
      "author_association": "NONE",
      "body": "I guess that kind of makes sense. I'll feed this back to the rest of my team. HelpMessage should be testable in the same way, right?\n\nI still argue that it would be a good idea to provide this capability, if only to cover situations where you can't control whether the powershell session has been launched with `powershell.exe -NonInteractive`, or the session wasn't launched with `powershell.exe -NonInteractive` but you want to change that without restarting it.\n\nThanks\n",
      "created_at": "2016-10-03T17:19:09Z",
      "updated_at": "2016-10-03T17:19:09Z"
    },
    {
      "author": "vors",
      "author_association": "COLLABORATOR",
      "body": "I think it's a good request.  Here is a scenario.\n\nIn a big non-interactive script, we currently hang, when such mistake slips in. Current behavior makes troubleshooting harder. It would be much better to have an option to error-out immediately when script knows that it's not intended for the interactive use.\n",
      "created_at": "2016-10-03T17:31:35Z",
      "updated_at": "2016-10-03T17:31:35Z"
    },
    {
      "author": "lzybkr",
      "author_association": "MEMBER",
      "body": "HelpMessage could be tested in the same way, but we don't generally test the exact message because we rely on code reviews to ensure the messsage is good plus localization makes the test only work on specific locales.\n\nI disagree that this functionality is needed. If PowerShell is not interactive, the parameter binder throws an exception if a mandatory parameter is missing - and this is exactly what you want - report an error, not to ignore it.\n",
      "created_at": "2016-10-03T17:39:26Z",
      "updated_at": "2016-10-03T17:39:26Z"
    },
    {
      "author": "lzybkr",
      "author_association": "MEMBER",
      "body": "Here is an example of a non-interactive runspace throwing an exception:\n\n```\n#3 PS> [powershell]::Create().AddCommand(\"Import-Module\").Invoke()\nException calling \"Invoke\" with \"0\" argument(s): \"Cannot process command because of one or more missing mandatory\nparameters: Name.\"\nAt line:1 char:1\n+ [powershell]::Create().AddCommand(\"Import-Module\").Invoke()\n+ ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n    + CategoryInfo          : NotSpecified: (:) [], MethodInvocationException\n    + FullyQualifiedErrorId : ParameterBindingException\n```\n",
      "created_at": "2016-10-03T17:43:04Z",
      "updated_at": "2016-10-03T17:43:04Z"
    },
    {
      "author": "vors",
      "author_association": "COLLABORATOR",
      "body": "Indeed, then if somebody wants such check she can write a helper function to start script in non-interactive runspace.\n",
      "created_at": "2016-10-03T17:45:46Z",
      "updated_at": "2016-10-03T17:45:46Z"
    },
    {
      "author": "JohnLudlow",
      "author_association": "NONE",
      "body": "I'm not sure what that example was showing. It doesn't look like anything I'm trying to do.\n\nThere's a disconnect here between something which is 'needed' (a poisonous word, IMHO) and something that seems like a good idea. This is definitely in the latter group, given the guidance @lzybkr posted above. \n\nIn any case, you're the guys in charge so if you think it's not a good suggestion then we can close it.\n",
      "created_at": "2016-10-03T17:54:13Z",
      "updated_at": "2016-10-03T17:54:13Z"
    },
    {
      "author": "lzybkr",
      "author_association": "MEMBER",
      "body": "I wanted to demonstrate how the PowerShell team would test this behavior (non-interactive) in our tests. A new process works similarly but is much slower:\n\n```\n#4 PS> powershell -noninteractive -noprofile -command \"ipmo\"\nImport-Module : Cannot process command because of one or more missing mandatory parameters: Name.\nAt line:1 char:1\n+ ipmo\n+ ~~~~\n    + CategoryInfo          : InvalidArgument: (:) [Import-Module], ParameterBindingException\n    + FullyQualifiedErrorId : MissingMandatoryParameter,Microsoft.PowerShell.Commands.ImportModuleCommand\n```\n\nIn my opinion, adding a preference variable to control this behavior is neither necessary nor a good idea. The variable introduces new complexity that needs to be documented and explained.\n\nI'm closing the issue as I believe I've suggested reasonable solutions to testing the desired behavior. If there are situations I haven't covered, feel free to reopen.\n",
      "created_at": "2016-10-03T18:07:01Z",
      "updated_at": "2016-10-03T18:07:01Z"
    },
    {
      "author": "JohnLudlow",
      "author_association": "NONE",
      "body": "Yeah I'm not sure the second example would achieve what we're after. We'll start looking into using the first example since right now we're not using the Mandatory parameter for a parameter which is mandatory. Instead, we're letting other validation handle that situation which is not necessarily ideal.\n\nThanks for looking into it anyway\n",
      "created_at": "2016-10-03T18:14:48Z",
      "updated_at": "2016-10-03T18:14:48Z"
    },
    {
      "author": "DarkLite1",
      "author_association": "NONE",
      "body": "For anyone else having this issue in case you use a `Param()` block at the beginning of your script, it can be solved like this:\r\n\r\n```\r\n$here = Split-Path -Parent $MyInvocation.MyCommand.Path\r\n$sut = (Split-Path -Leaf $MyInvocation.MyCommand.Path) -replace '\\.Tests\\.', '.'\r\n\r\nDescribe 'input' {\r\n    Context 'mandatory parameters' {\r\n            it 'ScriptName' {\r\n                (Get-Command \"$here\\$sut\").Parameters['ScriptName'].Attributes.Mandatory | Should be $true\r\n            }\r\n            it 'CountryCode' {\r\n                (Get-Command \"$here\\$sut\").Parameters['CountryCode'].Attributes.Mandatory | Should be $true\r\n            }\r\n        }\r\n}\r\n```",
      "created_at": "2017-08-29T11:24:11Z",
      "updated_at": "2017-08-29T11:27:04Z"
    },
    {
      "author": "gmckeown",
      "author_association": "NONE",
      "body": "I'm writing tests for various scripts that have multiple parameter sets. The above checks for the Mandatory attribute on a parameter aren't quite what I need. For example:\r\n\r\n```PowerShell\r\n    Param(\r\n        [Parameter(ParameterSetName = 'MatchName', Mandatory)][Parameter(ParameterSetName = 'MatchPattern', Mandatory)][SessionObject] $Session,\r\n        [Parameter(ParameterSetName = 'MatchName')][String] $Name,\r\n        [Parameter(ParameterSetName = 'MatchPattern', Mandatory)][String] $Pattern,\r\n        [Parameter(ParameterSetName = 'MatchPattern', Mandatory)][String] $MatchOn\r\n    )\r\n```\r\n\r\nI want to be able to check that Pattern is passed if MatchOn is passed. If Name is passed, I don't care about that pattern match being mandatory. So I could write some logic that tries to emulate what PowerShell itself is doing, but it would seem more useful to be able to just run the command and see how PowerShell reacts (and without the risk of it sitting waiting for input in the case of a missing param).",
      "created_at": "2019-05-30T20:26:44Z",
      "updated_at": "2019-05-30T20:26:44Z"
    }
  ],
  "created_at": "2016-10-03T12:02:25Z",
  "number": 2408,
  "state": "closed",
  "title": "Preference variable to suppress Mandatory prompts",
  "updated_at": "2019-05-30T20:26:45Z"
}