{
  "_url": "https://github.com/PowerShell/PowerShell/issues/2444",
  "author": "PaulHigin",
  "body": "This has been requested by multiple users.  Currently a PowerShell remote session lifetime is governed solely by the client.  A remote session will remain on a target machine as long as the client maintains a connection to it and the client decides when the session is terminated.\n\nThe only exception is if the session becomes disconnected whether from network issues or through a manual disconnect operation.  In this case the \"IdleTimeout\" parameter determines how long the orphaned session remains on the server and will terminate the session after the timeout time has elapsed.\n\nBut many users would like to have the option of terminating a remote session if it has been inactive (no commands or scripts run in it) for a specified period of time.\n\nThis would be a new feature and so an RFC document should be generated.\n",
  "closed_at": null,
  "comments": [
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "This seems unnecessary in a PSRP/SSH world",
      "created_at": "2017-03-04T19:09:23Z",
      "updated_at": "2017-03-04T19:09:23Z"
    },
    {
      "author": "PaulHigin",
      "author_association": "COLLABORATOR",
      "body": "It is still a problem with SSH since it is a feature of PSRP (PowerShell Remoting Protocol).  Some users would like to better monitor/manage activate remote endpoints on their systems.  They would like to be able to terminate sessions on the target system for some users.  I believe the scenarios are related to PSWS (PowerShell Web Services) where active sessions become abandoned and use system resources.  But I haven't really thought through the issues (privacy?, how such a feature might be abused?) or how PSRP could be modified to support this.  This should be discussed in an RFC.",
      "created_at": "2017-03-06T16:58:20Z",
      "updated_at": "2017-03-06T16:58:20Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "We should do some more research on this on how SSH admins do this today.  My preference is to leverage SSH conventions/tooling where possible.",
      "created_at": "2017-03-06T17:01:26Z",
      "updated_at": "2017-03-06T17:01:26Z"
    }
  ],
  "created_at": "2016-10-07T21:17:39Z",
  "labels": [
    "Issue-Enhancement",
    "WG-Remoting"
  ],
  "number": 2444,
  "state": "open",
  "title": "PowerShell should have a remote session inactive timeout clean up option",
  "updated_at": "2017-03-06T17:01:26Z"
}