{
  "_url": "https://github.com/PowerShell/PowerShell/issues/2446",
  "author": "KirkMunro",
  "body": "If you watch recorded demos of introductory PowerShell sessions delivered by people like @jpsnover, they inevitably show the famous select top 10 processes pipeline. When they do, they invoke something like this (with or without aliases, etc.):\n\n```\nGet-Process | sort WorkingSet64 -desc | select -first 10\n```\n\nAs they are entering that line, they very often (almost always) say top 10 as they type \"-first 10\". It's a small thing, but it's how the mind works. We want the top 10 processes, and technically, in the output, we're getting the top 10 since they are output vertically. I've always felt this would be better if the -First parameter of Select-Object had a -Top alias and the -Last parameter of Select-Object had a -Bottom alias. Such a change would allow for this instead:\n\n```\ngps | sort WorkingSet64 -desc | select -top 10\n```\n\nNow that PowerShell is open source, I decided to add them, see what you think. New parameter aliases are defined and new Pester tests are included for verification.\n",
  "closed_at": "2016-10-09T12:53:12Z",
  "comments": [
    {
      "author": "msftclas",
      "author_association": "NONE",
      "body": "Hi **@KirkMunro**, I'm your friendly neighborhood Microsoft Pull Request Bot (You can call me MSBOT). Thanks for your contribution!\n    <span>You've already signed the contribution license agreement. Thanks!</span>\n        <p>The agreement was validated by Microsoft and real humans are currently evaluating your PR.</p>\n\nTTYL, MSBOT;\n",
      "created_at": "2016-10-08T13:26:47Z",
      "updated_at": "2016-10-08T13:26:47Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "I like the intent, but the problem is that `top` and `bottom` implies sorting unlike `first` and `bottom` which is not sorted.  So ideally you would have:\n\n``` powershell\nget-process | select -top 10\n```\n\nbut is this top 10 by cpu usage, workingset, etc?\n\nNow we would have to include sorting semantics but this breaks the \"do one thing and do it well\" principle unless we can determine significant common use cases to justify it.  For example would we want to support this?\n\n``` powershell\nget-process | select -top 10 -select workingset64 -desc\n```\n\nBut that didn't really save much typing nor improve readability.\n",
      "created_at": "2016-10-08T14:27:40Z",
      "updated_at": "2016-10-08T14:27:40Z"
    },
    {
      "author": "lzybkr",
      "author_association": "MEMBER",
      "body": "I agree with @SteveL-MSFT - `-Top` and `-Bottom` imply sorting whereas `-First` and `-Last` do not.\n\nNow maybe it makes sense to add `-Top` and `-Bottom` to `Sort-Object`. That could even enable a faster sort by avoiding sorting elements that won't be written to the pipe.\n",
      "created_at": "2016-10-08T16:12:58Z",
      "updated_at": "2016-10-08T16:12:58Z"
    },
    {
      "author": "jpsnover",
      "author_association": "CONTRIBUTOR",
      "body": "I love @lzybkr idea of adding this to sort-object!\n",
      "created_at": "2016-10-08T16:26:59Z",
      "updated_at": "2016-10-08T16:26:59Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "I'm \"inside\" this cmdlet last week and can say that it is very intuitive to the user UX and very controversial, it is a trick in the code, and any even slightly change this code can easily break down. In general I think this cmdlet should be replaced with a newer, which meets modern requirements to cmdlets (See #2421 ).\n\nI like the idea of KirkMunro and I agree with @lzybkr that this idea should be implemented in Sort-Object.\n",
      "created_at": "2016-10-08T17:36:39Z",
      "updated_at": "2016-10-08T17:58:04Z"
    },
    {
      "author": "KirkMunro",
      "author_association": "CONTRIBUTOR",
      "body": "I agree with all of the comments, and I sat on this idea for a while for exactly the reason that -Top and -Bottom might imply sorting. I had considered creating new parameter sets for Select-Object for -Top/-Bottom that included sorting, but I couldn't convince myself that baking sorting into Select-Object was the right solution since Select-Object is a pretty well defined atomic command. In the end I decided that as parameter aliases it wasn't so bad, and that if I was going to go the route of actually doing sorting and selecting I might create a different cmdlet instead. I hadn't thought about putting -Top/-Bottom as parameters on Sort-Object though, and I really like that idea -- it makes much more sense in the context of Sort-Object. Is that something you want to run with @lzybkr or do you mind if I have a look?\n",
      "created_at": "2016-10-08T22:04:51Z",
      "updated_at": "2016-10-08T22:04:51Z"
    },
    {
      "author": "lzybkr",
      "author_association": "MEMBER",
      "body": "I have plenty on my plate, so consider the idea up for grabs.\n",
      "created_at": "2016-10-09T04:43:51Z",
      "updated_at": "2016-10-09T04:43:51Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "@KirkMunro  You caught the game - you cook 😊 \n\n(I believe it would be appropriate to close this PR and open a new Issue with full description of the idea.)\n",
      "created_at": "2016-10-09T12:44:31Z",
      "updated_at": "2016-10-09T12:44:31Z"
    },
    {
      "author": "KirkMunro",
      "author_association": "CONTRIBUTOR",
      "body": "@lzybkr Thanks, I'll have a look.\n\n@iSazonov Of course, the proposed sort-object changes will be submitted under a new PR (and I can probably create an accompanying Issue as well).\n",
      "created_at": "2016-10-09T12:53:12Z",
      "updated_at": "2016-10-09T12:53:12Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "https://github.com/PowerShell/PowerShell/blob/master/docs/maintainers/issue-management.md\nI think it is a good practice to preliminary create a Issue (as  Issue-Enhancement in this time).\nWaiting news from you @KirkMunro !\n",
      "created_at": "2016-10-09T13:09:12Z",
      "updated_at": "2016-10-09T13:09:12Z"
    },
    {
      "author": "KirkMunro",
      "author_association": "CONTRIBUTOR",
      "body": "@iSazonov I agree about creating an issue. I needed to do some research/experimentation first though to see what the solution might look like, see how other parameters would play with this feature, etc. I'm also getting ready for a conference, so busy right now, but I will move this along as soon as possible.\n",
      "created_at": "2016-10-10T20:55:50Z",
      "updated_at": "2016-10-10T20:55:50Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "@KirkMunro Create Issue now and ask PowershellTeam to assign you. This will eliminate possible conflicts. You and we can also get _early_ feedback to the time when you will have the opportunity to code. Good luck!\n",
      "created_at": "2016-10-11T15:03:39Z",
      "updated_at": "2016-10-11T15:03:39Z"
    }
  ],
  "created_at": "2016-10-08T13:26:43Z",
  "number": 2446,
  "state": "closed",
  "title": "Added -Top and -Bottom aliases for -First and -Last",
  "updated_at": "2016-10-11T15:03:39Z"
}