{
  "_url": "https://github.com/PowerShell/PowerShell/issues/2456",
  "author": "brycem",
  "body": "The new tools\\jenkinsutils.psm1 module contains a CmdLet for setting up windows Jenkins slaves (Get-DockerDeps), a CmdLet for fetching the current build for a given tag (Get-LatestPs), and a CmdLet for building a Windows Docker Container image that executes the Directives in the new tools\\Dockerfile to Invoke-Pester after the container launches.  Failed results fail the container build. tools\\.gitignore updated to ignore the WorkSpace generated for the Docker build.\n",
  "closed_at": "2016-10-11T21:50:57Z",
  "comments": [
    {
      "author": "msftclas",
      "author_association": "NONE",
      "body": "Hi **@brycem**, I'm your friendly neighborhood Microsoft Pull Request Bot (You can call me MSBOT). Thanks for your contribution!\n    <p>\n        It looks like you're a Microsoft contributor (Bryce Milton). If you're full-time, we DON'T require a Contribution License Agreement. If you are a vendor, please DO sign the electronic Contribution License Agreement. It will take 2 minutes and there's no faxing! https://cla.microsoft.com.\n    </p>\n\nTTYL, MSBOT;\n",
      "created_at": "2016-10-11T19:16:08Z",
      "updated_at": "2016-10-11T19:16:08Z"
    },
    {
      "author": "andschwa",
      "author_association": "MEMBER",
      "body": "Hey if you're adding Windows Docker containers, they should probably go with the Linux Docker containers in the `docker` folder.\n",
      "created_at": "2016-10-11T19:28:06Z",
      "updated_at": "2016-10-11T19:28:06Z"
    },
    {
      "author": "brycem",
      "author_association": "CONTRIBUTOR",
      "body": "I thought about that but didn't because this template was specialized to run the tests on built bits from the release point and doesn't work unless pre-staged by the jenkinsutil.psm1.  \n",
      "created_at": "2016-10-11T20:06:32Z",
      "updated_at": "2016-10-11T20:07:19Z"
    },
    {
      "author": "andschwa",
      "author_association": "MEMBER",
      "body": "@brycem can you please work from a fork?\n",
      "created_at": "2016-10-11T20:39:30Z",
      "updated_at": "2016-10-11T20:39:30Z"
    },
    {
      "author": "brycem",
      "author_association": "CONTRIBUTOR",
      "body": "Sorry about that - Didn't mean to push the Jenkinsfile yet - Reverted from this PR.\n",
      "created_at": "2016-10-11T20:55:06Z",
      "updated_at": "2016-10-11T21:00:38Z"
    },
    {
      "author": "brycem",
      "author_association": "CONTRIBUTOR",
      "body": "Closing this PR to work on stable windows Dockerfiles instead.\n",
      "created_at": "2016-10-11T21:50:57Z",
      "updated_at": "2016-10-11T21:50:57Z"
    }
  ],
  "created_at": "2016-10-11T19:16:04Z",
  "number": 2456,
  "state": "closed",
  "title": "CI - Adding toolset for Jenkins Docker Slaves",
  "updated_at": "2016-10-11T21:50:57Z"
}