{
  "_url": "https://github.com/PowerShell/PowerShell/issues/2484",
  "author": "daxian-dbw",
  "body": "This is to make sure:\n1. The dependency existence check by powershell.exe will pass for all TPAs.\n2. CoreCLR by default will load the NI images even though it's using names of the IL images.\n\nWhen the legacy APIs like \"GetAssemblies\" are back, we probably want to retire PSALC (to what extent is still unknown) and solely depend on the CoreCLR default load context, and this is the way to make sure the CoreCLR default load context will load the NI images produced in our post-build.\n",
  "closed_at": "2016-10-18T20:12:51Z",
  "comments": [
    {
      "author": "msftclas",
      "author_association": "NONE",
      "body": "Hi **@daxian-dbw**, I'm your friendly neighborhood Microsoft Pull Request Bot (You can call me MSBOT). Thanks for your contribution!\n    <p>\n        It looks like you're a Microsoft contributor (Dongbo Wang). If you're full-time, we DON'T require a Contribution License Agreement. If you are a vendor, please DO sign the electronic Contribution License Agreement. It will take 2 minutes and there's no faxing! https://cla.microsoft.com.\n    </p>\n\nTTYL, MSBOT;\n",
      "created_at": "2016-10-14T18:56:20Z",
      "updated_at": "2016-10-14T18:56:20Z"
    },
    {
      "author": "daxian-dbw",
      "author_association": "MEMBER",
      "body": "@mirichmo could you please review this? It's tightly related to the new dotnet.core package adoption. This alternative is also suggested by the CoreCLR team.\n",
      "created_at": "2016-10-14T18:58:10Z",
      "updated_at": "2016-10-14T18:58:10Z"
    },
    {
      "author": "daxian-dbw",
      "author_association": "MEMBER",
      "body": "The comment is updated to make it easy to understand.\n",
      "created_at": "2016-10-18T20:00:03Z",
      "updated_at": "2016-10-18T20:00:03Z"
    }
  ],
  "created_at": "2016-10-14T18:56:17Z",
  "number": 2484,
  "state": "closed",
  "title": "Remove crossgen'ed IL assemblies and then rename NI assemblies to the same as the corresponding IL images.",
  "updated_at": "2016-10-18T20:12:51Z"
}