{
  "_url": "https://github.com/PowerShell/PowerShell/issues/2515",
  "author": "daxian-dbw",
  "body": "If a *.csproj file is in a project directory, the latest dotnet.exe will use it, instead of the project.json file, to build the project.\n\nThe `*.csproj` files udner `vs-csproj` folders are updated to point to the correct file, but still there are problems when opening them in Visual Studio and they need to be further tweaked. I send out this PR first to unblock the CI systems. I will send out another PR once fix the moved `*.csproj` files.\n",
  "closed_at": "2016-10-21T21:12:10Z",
  "comments": [
    {
      "author": "msftclas",
      "author_association": "NONE",
      "body": "Hi **@daxian-dbw**, I'm your friendly neighborhood Microsoft Pull Request Bot (You can call me MSBOT). Thanks for your contribution!\n    <p>\n        It looks like you're a Microsoft contributor (Dongbo Wang). If you're full-time, we DON'T require a Contribution License Agreement. If you are a vendor, please DO sign the electronic Contribution License Agreement. It will take 2 minutes and there's no faxing! https://cla.microsoft.com.\n    </p>\n\nTTYL, MSBOT;\n",
      "created_at": "2016-10-21T05:52:59Z",
      "updated_at": "2016-10-21T05:52:59Z"
    },
    {
      "author": "andschwa",
      "author_association": "MEMBER",
      "body": "I believe the existing csproj files should be removed. They are editor configurations, which do not belong in the repository.\n",
      "created_at": "2016-10-21T22:18:24Z",
      "updated_at": "2016-10-21T22:18:24Z"
    },
    {
      "author": "daxian-dbw",
      "author_association": "MEMBER",
      "body": "@andschwa yes we discussed removing `*.csproj` files in our maintainer channel, and decided to just move them instead because people might depend on it to work with powershell code in Visual Studio.\n",
      "created_at": "2016-10-21T23:49:18Z",
      "updated_at": "2016-10-21T23:49:18Z"
    }
  ],
  "created_at": "2016-10-21T05:52:55Z",
  "number": 2515,
  "state": "closed",
  "title": "[Fix broken CI] Move *.csproj files to PowerShell/src/vs-csproj and PowerShell/test/vs-csproj to avoid confusing the latest dotnet.exe.",
  "updated_at": "2016-10-21T23:49:18Z"
}