{
  "_url": "https://github.com/PowerShell/PowerShell/issues/2594",
  "author": "rkeithhill",
  "body": "I'm looking into updating the PowerShellEditorServices to support breakpoint hit count which is now supported in VSCode 1.7:\r\n\r\n![image](https://cloud.githubusercontent.com/assets/5177512/19953832/2e77917a-a138-11e6-9e1f-7bb0d67474c8.png)\r\n\r\nHit count can now be set on breakpoints in VSCode and can be combined with conditional breakpoint expressions.  PowerShell's current Set-PSBreakpoint command can support the simple breakpoint hit count case like so:\r\n```powershell\r\nSet-PSBreakpoint ... -Action { if ($_.HitCount -eq 5 }\r\n```\r\nHowever, PowerShell does not support the combined condition (Action) / hit count scenario.  This is because the HitCount property counts every time a breakpoint is encountered.  However, when the user is supplying an Action scriptblock to get a conditional breakpoint, the breakpoint may be encountered many times without \"firing\" i.e when the scriptblock doesn't execute break.  Yet the HitCount property is always incremented.  Only when the condition evals to $true and the code executes a break statement should it increment a hit counter for a `conditional breakpoint`. \r\n\r\nNow the HitCount property can't be changed for back compat reasons but you could add an ConditionalBreakHitCount property which would count the number of times the Action scriptblock executed a `break` statement.  \r\n\r\nThat helps but isn't sufficient.  That is, a PowerShell user trying to implement this via the Actrion scriptblock because for a conditional/hit count combo you do NOT want to break into the debugger each time the condition evals to $true (and you execute a break).  You only want to break when the condition is $true **AND** the ConditionalBreakHitCount equals the desired value.  But the ConditionalBreakHitCount won't increment unless you execute the \"break\" statement.  Catch-22.  \r\n\r\nSo what I would like to fix this is a new parameter in each `Set-PSBreakpoint` parameterset called `-HitCount`.  If no action is specified its operation is simple.  The breakpoint won't fire until the internal HitCount property equals the argument provided via this parameter.  If an Action scriptblock is provided, then execution of a \"break\" statement would first increment the ConditionalBreakHitCount property and only if the updated count equals the number specified by the `-HitCount` parameter would it actually break into the debugger.  If the Action scriptblock doesn't use `break` then it is not a `conditional breakpoint` but an `action breakpoint` instead.  I don't believe it is a common user scenario to expect -HitCount to work with \"action only\" breakpoints.  Visual Studio doesn't work that way:\r\n\r\n![image](https://cloud.githubusercontent.com/assets/5177512/19955232/ec312990-a144-11e6-8fc9-dcd84f4e0f48.png)\r\n\r\nNote: that hit count in Visual Studio is only associated with Conditions breakpoints and not Actions.\r\n\r\ncc @daviwil ",
  "closed_at": null,
  "comments": [],
  "created_at": "2016-11-03T04:21:40Z",
  "labels": [
    "Issue-Enhancement",
    "WG-Interactive-Debugging",
    "Up-for-Grabs"
  ],
  "number": 2594,
  "state": "open",
  "title": "Improve Set-PSBreakpoint to support -HitCount parameter",
  "updated_at": "2016-11-05T01:17:30Z"
}