{
  "_url": "https://github.com/PowerShell/PowerShell/issues/2644",
  "author": "SteveL-MSFT",
  "body": "Currently, users need to author a ps1xml to update format and type data.  We should expose a DSL to make this simpler and more aligned with PowerShell script than using xml.  This needs to be an RFC.",
  "closed_at": null,
  "comments": [
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "Will resolved by #7857 PSMore.",
      "created_at": "2018-11-07T18:07:17Z",
      "updated_at": "2018-11-07T18:07:17Z"
    },
    {
      "author": "rjmholt",
      "author_association": "COLLABORATOR",
      "body": "> This needs to be an RFC.\r\n\r\nI suspect in the intervening years since this issue was opened, we've come to prefer discussions in issues over RFCs. I should also note that our need for a DSL isn't as great as it used to be, and after going down the path of trying to implement such a DSL we've learned a few things along the way about the complexity of setting up a framework for one.",
      "created_at": "2020-02-21T03:53:22Z",
      "updated_at": "2020-02-21T03:53:22Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "Dunno about everyone else, but I'd certainly be happy with having a couple of cmdlets to handle this instead of just a full-blown DSL. Even just making the current C# APIs easily accessible from PowerShell and allowing the resulting format definitions to be registered would be a vast improvement from what we have currently.",
      "created_at": "2020-02-21T03:58:00Z",
      "updated_at": "2020-02-21T03:58:00Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "PowerShell benefits from balancing dynamic typing and strong typing. I guess PowerShell classes is best for strong typing and it makes you look again in the direction of PSMore idea. Also it says that it is better to invest in PowerShell classes.",
      "created_at": "2020-02-21T04:18:19Z",
      "updated_at": "2020-02-21T04:18:19Z"
    },
    {
      "author": "rjmholt",
      "author_association": "COLLABORATOR",
      "body": "> but I'd certainly be happy with having a couple of cmdlets to handle this instead of just a full-blown DSL\r\n\r\nThose are my thoughts too. A DSL would be nice, but I'd see that as being implemented in some set of cmdlets.\r\n\r\nI'd certainly like to get rid of the XML, and given the way we embed scripts in it currently, some script-based solution seems appropriate.\r\n\r\n> Also it says that it is better to invest in PowerShell classes\r\n\r\nWhile I agree that classes should be well suited to this, I think we've got more work to do on classes first. OTOH, I think this would be a good motivating factor to fix classes.",
      "created_at": "2020-02-21T04:46:19Z",
      "updated_at": "2020-02-21T04:46:19Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "> I'd certainly like to get rid of the XML, and given the way we embed scripts in it currently, some script-based solution seems appropriate.\r\n\r\nIt seems @daxian-dbw have a tool to convert the psxml-s to internals. Perhaps it could be enhanced to cmdlet.",
      "created_at": "2020-02-21T06:23:13Z",
      "updated_at": "2020-02-21T06:23:13Z"
    }
  ],
  "created_at": "2016-11-08T22:03:27Z",
  "labels": [
    "Issue-Enhancement"
  ],
  "number": 2644,
  "state": "open",
  "title": "Need DSL for format and type data",
  "updated_at": "2020-02-21T06:23:13Z"
}