{
  "_url": "https://github.com/PowerShell/PowerShell/issues/2692",
  "author": "jpsnover",
  "body": "This would effectly add the command \"Set-StrictMode -version 5\" at the beginning of the scriptblock.\r\nThe reason why should should be a parameter vs just having the user add that line to every script is that it allows someone to set this via $PSDefaultParameterValues and have it affect an entire corpus of scripts (without having to change the scripts itself).\r\n\r\nHere is the workaround that I wrote to implement this:\r\nhttps://www.powershellgallery.com/packages/Invoke-Command \r\n\r\n",
  "closed_at": "2022-01-12T19:17:03Z",
  "comments": [
    {
      "author": "faraazahmad",
      "author_association": "CONTRIBUTOR",
      "body": "I would like to work on this",
      "created_at": "2018-07-27T16:35:17Z",
      "updated_at": "2018-07-27T16:35:17Z"
    },
    {
      "author": "PaulHigin",
      "author_association": "COLLABORATOR",
      "body": "Unfortunately, this would not be a trivial change.  The specified strictmode version would have to be communicated to the target, where it can be applied to the runspace being created in the remote session there.  But this means updating the remoting protocol, which means gaining approval, updating the protocol version, documentation, and handling down level (non-supported) cases.",
      "created_at": "2021-12-01T22:47:19Z",
      "updated_at": "2021-12-01T22:47:19Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "This is not the first time that we talk about the fact that PSRP needs to be extended.\r\nIf we think about implementing new remoting subsystem why not think about PSRP enhancing, new transport like gRPC, and fallback to WinRM and old PSRP version?",
      "created_at": "2021-12-02T03:31:10Z",
      "updated_at": "2021-12-02T03:31:10Z"
    },
    {
      "author": "PaulHigin",
      "author_association": "COLLABORATOR",
      "body": "Updating the protocol is an arduous undertaking, and we need to maintain compatibility with WindowsPowerShell, so I feel we need to have very strong reasons for doing it.  Maybe we can keep a collection of improvements that require protocol update and at some point we update the protocol when the benefits justify the effort.",
      "created_at": "2021-12-02T17:48:58Z",
      "updated_at": "2021-12-02T17:48:58Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "The new remoting subsystem should definitely allow not only different transport but protocol versions too. :-)",
      "created_at": "2021-12-02T18:11:45Z",
      "updated_at": "2021-12-02T18:11:45Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "Uh! 5 years to implement :-)",
      "created_at": "2022-01-13T03:21:37Z",
      "updated_at": "2022-01-13T03:21:37Z"
    },
    {
      "author": "PaulHigin",
      "author_association": "COLLABORATOR",
      "body": "Note that this implementation is for script running in current session only, and does not affect remoting which is more complicated as noted above.",
      "created_at": "2022-01-13T17:09:23Z",
      "updated_at": "2022-01-13T17:09:23Z"
    }
  ],
  "created_at": "2016-11-16T16:57:41Z",
  "number": 2692,
  "state": "closed",
  "title": "Invoke-Command should support -StrictMode",
  "updated_at": "2022-01-13T17:09:23Z"
}