{
  "_url": "https://github.com/PowerShell/PowerShell/issues/2783",
  "author": "MarvTheRobot",
  "body": "While working with DSC, I use PSD1 files quite a lot; the main use, at present, is \r\n\r\n- Have a 'RoleInformation.psd1' that details information about a type of server/node. This file is the same irrespective of enviroment (Dev, Test, Staging, Live, etc)\r\n- Have a 'NodeData.psd1' that contains a list of servers, collected from the environment listing their name, cert thumbprint and cert path (as each has it's unique cert to use)\r\n- Merge the 'RoleInformation' with the 'NodeData' to make an environment specific configuration data document that has expanded all properties for each node.\r\n\r\nBecause of this use, I am writing out several PSD1 files. The example above is just one use, I also have several libraries of information in PSD1 format so that everything is the same. \r\n\r\nI have implemented my own Export-PowerShellDataFile function but it will need work to make it more professional, I'm happy to put it on GitHub and link at a later date for others to judge and perhaps suggest improvements. \r\n\r\nI just believe that, with the huge investment in DSC, PowerShell should include a native module for this purpose. \r\n\r\nAt a high level, my current function provides:\r\n\r\nA formatted output of a HashTable (including all tags)\r\nIndentation (parameter based character and number)\r\n\r\nI may look to change mine into C# but would welcome any suggestions for a best practice way or achieving a correctly formatted and indented file.\r\n\r\nI'd also welcome suggestions on ordering the output. \r\n*I know you can created ordered hashtables, but if you're reading in from a file where you don't know all of the attributes/properties, you can't create an ordered table from it*\r\n\r\n ",
  "closed_at": "2018-10-29T14:19:00Z",
  "comments": [
    {
      "author": "nightroman",
      "author_association": "NONE",
      "body": "@MarvTheRobot, please take a look at my approach at https://github.com/nightroman/PsdKit\r\n",
      "created_at": "2018-03-02T14:27:10Z",
      "updated_at": "2018-03-02T14:27:10Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "Dupe of https://github.com/PowerShell/PowerShell/issues/2875 (this one is older, but the other had more discussion)",
      "created_at": "2018-10-29T14:19:00Z",
      "updated_at": "2018-10-29T14:19:07Z"
    }
  ],
  "created_at": "2016-11-24T14:13:01Z",
  "labels": [
    "Resolution-Duplicate",
    "Issue-Enhancement",
    "WG-Cmdlets"
  ],
  "number": 2783,
  "state": "closed",
  "title": "Suggestion: Export-PowerShellDataFile CmdLet",
  "updated_at": "2018-10-29T14:19:16Z"
}