{
  "_url": "https://github.com/PowerShell/PowerShell/issues/2820",
  "author": "kittholland",
  "body": "In issue #1755 we determined that you could not create a PSObject with a\r\nkey name of an empty string. This is supported in JSON and in\r\nHashtables.\r\n\r\nSimple change was to lower evaluations of name field from\r\n'IsNullOrEmpty' to '== null'.\r\n\r\nSimple test to confirm is:\r\n[pscustomobject]@{'' = 'Test'}\r\n\r\nSimple JSON to test which results in ths same error:\r\n'{\"\": \"Test\"}' | ConvertFrom-Json\r\n\r\nAfter these changes, both of these cases work and I am able to\r\nsuccesfully Convert project.lock.json from JSON and back to JSON with no\r\ndata loss.\r\n\r\nThere are many references to the areas of code I have updated and I do not believe I can foresee all consequences however I have ran the full test suite locally and have not found any indication these changes are harmful, while I have confirmed that it addresses the issue we are seeing.\r\n\r\nI would also at least like to submit the above two cases as tests for this issue, but I am uncertain where those tests should go.",
  "closed_at": "2016-12-08T23:31:32Z",
  "comments": [
    {
      "author": "msftclas",
      "author_association": "NONE",
      "body": "Hi __@kittholland__, I'm your friendly neighborhood Microsoft Pull Request Bot (You can call me MSBOT). Thanks for your contribution!\r\n    <span>You've already signed the contribution license agreement. Thanks!</span>\r\n        <p>The agreement was validated by Microsoft and real humans are currently evaluating your PR.</p>\r\n\r\nTTYL, MSBOT;\r\n",
      "created_at": "2016-12-01T06:01:05Z",
      "updated_at": "2016-12-01T06:01:05Z"
    },
    {
      "author": "lzybkr",
      "author_association": "MEMBER",
      "body": "I wonder if it makes more sense to \"reserve\" a property name for the JSON cmdlets to use instead of allowing the empty string as a property name.",
      "created_at": "2016-12-01T19:21:36Z",
      "updated_at": "2016-12-01T19:21:36Z"
    },
    {
      "author": "kittholland",
      "author_association": "CONTRIBUTOR",
      "body": "I'm not sure how people feel about the valid hashtable @{'' = 'Test'} failing to convert to psobject as well. Not sure if that is a bug or intended. If we add a reserved property for JSON would we want to handle the hashtable conversion case as well? ",
      "created_at": "2016-12-01T20:21:54Z",
      "updated_at": "2016-12-01T20:21:54Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "@PowerShell/powershell-committee discussed this and agree we should support this for JSON (and investigate if YAML will be an issue when we support YAML), but not something we should support in the language for objects as there are situations where we would error today that would start working due to unintended circumstances.  \r\n\r\n*Recommendation is see how JSON.Net is handling this case and use as a precedent*",
      "created_at": "2016-12-08T17:49:38Z",
      "updated_at": "2016-12-08T17:49:38Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "I experimented with Newtonsoft.Json and they don't have this problem as deserializing to a specific type would require that object to have a property with empty name or they deserialize to a Newtonsoft.Json.Linq.JProperty.  It seems that for PowerShell to support this and not introduce the concept of an empty property name to the language, we may need to introduce a json type.",
      "created_at": "2016-12-08T18:24:17Z",
      "updated_at": "2016-12-08T18:24:17Z"
    },
    {
      "author": "kittholland",
      "author_association": "CONTRIBUTOR",
      "body": "Can I close this PR? I don't think we will be implementing a solution with this type of approach.",
      "created_at": "2016-12-08T21:54:19Z",
      "updated_at": "2016-12-08T21:54:19Z"
    },
    {
      "author": "lzybkr",
      "author_association": "MEMBER",
      "body": "Because of the potential language issues raised, e.g. `[pscustomobject]@{ \"$Foo\" = 42 }`, I agree we should not take this PR.",
      "created_at": "2016-12-08T23:32:58Z",
      "updated_at": "2016-12-08T23:32:58Z"
    }
  ],
  "created_at": "2016-12-01T06:01:01Z",
  "number": 2820,
  "state": "closed",
  "title": "Empty key name converting to PSObject",
  "updated_at": "2016-12-08T23:32:58Z"
}