{
  "_url": "https://github.com/PowerShell/PowerShell/issues/2842",
  "author": "JamesWTruher",
  "body": "continued attempts to reduce output size so we can get a daily build in travis-ci\r\n\r\nthis sets progress preference on the help and package management tests to SilentlyContinue to reduce output. This is done for all test execution, including dev and CI",
  "closed_at": "2016-12-06T21:58:57Z",
  "comments": [
    {
      "author": "lzybkr",
      "author_association": "MEMBER",
      "body": "Maybe progress should be opt-in instead of opt-out. In other words, disable globally, turn on in the progress tests.",
      "created_at": "2016-12-05T19:32:45Z",
      "updated_at": "2016-12-05T19:32:45Z"
    },
    {
      "author": "JamesWTruher",
      "author_association": "MEMBER",
      "body": "I thought about disabling progress universally but thought it would be better for each test to control this behavior. My concern is reviewing/rewriting existing tests which may be relying on progress in ways that I don't know.  ",
      "created_at": "2016-12-05T21:28:32Z",
      "updated_at": "2016-12-05T21:28:32Z"
    },
    {
      "author": "lzybkr",
      "author_association": "MEMBER",
      "body": "Which seems more likely?\r\n\r\n1. Adding new progress tests?\r\n2. Adding new functionality or tests that write progress?\r\n\r\nWith code coverage data, I feel comfortable that 1 won't be a big problem. Also, when progress doesn't work correctly, because it's UI, folks tend to notice and complain.\r\n\r\nI think 2 will be less hassle in the long run.",
      "created_at": "2016-12-05T21:43:38Z",
      "updated_at": "2016-12-05T21:43:38Z"
    },
    {
      "author": "JamesWTruher",
      "author_association": "MEMBER",
      "body": "oh, we _know_ we'll be adding a number of progress tests - right now we are only doing the minimum amount of progress tests. As soon as we have better support on non-windows we'll be doing even more. I don't agree that #2 is less hassle",
      "created_at": "2016-12-05T22:39:14Z",
      "updated_at": "2016-12-05T22:39:14Z"
    },
    {
      "author": "JamesWTruher",
      "author_association": "MEMBER",
      "body": "also, i don't know that this will even solve the problem with Travis-CI, but I have no other way to test it - i would much rather make targeted changes to determine if it will solve the daily build in Travis-CI issue than whole scale changing the way our tests work",
      "created_at": "2016-12-05T22:51:03Z",
      "updated_at": "2016-12-05T22:51:03Z"
    },
    {
      "author": "lzybkr",
      "author_association": "MEMBER",
      "body": "Isn't this really just a bug in PowerShell?  Shouldn't we be detecting that we're not running interactively and not show progress?",
      "created_at": "2016-12-05T23:06:03Z",
      "updated_at": "2016-12-05T23:06:03Z"
    },
    {
      "author": "JamesWTruher",
      "author_association": "MEMBER",
      "body": "_That_ I don't know - I recall that we had difficulties with running (historical) tests because some host APIs would throw when in that mode. This code base is different, of course, but I still would rather avoid tracking down extraneous issues when all I'm trying to do is find the right incantation to get daily builds in Travis-CI to work.\r\nThe advice I've gotten so far from the Travis-CI folks is to redirect *all* output from build/test into a file and not emit it to stdout, but I'm reluctant to try that first, so I am attempting to reduce output in this way.",
      "created_at": "2016-12-05T23:39:37Z",
      "updated_at": "2016-12-05T23:39:37Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "Current solution solved the Travis full log problem. It is very good!\r\n\r\nAs regards global disable progress bar. On the one hand testing should be performed with the default values as users get them. On the other hand any default parameter changes must not lead to the collapse of the tests, nor to the collapse of the real-world scripts.\r\nHm... If the progress bar would be turned off by default, then we wouldn't have caught problems with \"debris\" and performance.",
      "created_at": "2016-12-06T05:19:21Z",
      "updated_at": "2016-12-06T05:20:31Z"
    },
    {
      "author": "JamesWTruher",
      "author_association": "MEMBER",
      "body": "can we please merge this now?",
      "created_at": "2016-12-06T17:55:07Z",
      "updated_at": "2016-12-06T17:55:07Z"
    },
    {
      "author": "lzybkr",
      "author_association": "MEMBER",
      "body": "Please remove the formatting changes from the code changes, it unnecessarily makes it harder to see the logical code changes.\r\n\r\nWe have a different PR to remove trailing spaces, so we don't need to do that file by file.",
      "created_at": "2016-12-06T18:53:43Z",
      "updated_at": "2016-12-06T18:53:43Z"
    }
  ],
  "created_at": "2016-12-05T19:06:56Z",
  "number": 2842,
  "state": "closed",
  "title": "Jameswtruher/travisdaily2",
  "updated_at": "2016-12-06T21:59:24Z"
}