{
  "_url": "https://github.com/PowerShell/PowerShell/issues/2964",
  "author": "juneb",
  "body": "When you use the Using module statement in a script, classes defined in nested modules are imported and available for use in the script. But, the same code run at the command line fails to import the classes from nested modules.\r\n\r\nI didn't expect the classes in nested modules to be exported at all, but the same code should work the same way in a script and at the command line.\r\n\r\nSteps to reproduce\r\n------------------\r\n1. Define some PowerShell classes in a .psm1 file\r\n2. In the module manifest, set ModuleToProcess to '' and NestedModules to the name of the .psm1.\r\n3. In a script, use the Using module statement to import the module and instantiate one of the classes in the nested module.\r\n4. At the command line, run the commands in the script one-by-one.\r\n\r\nExpected behavior\r\n-----------------\r\nThe script and command-line experiences are the same. Either they both work or they both fail.\r\n\r\nActual behavior\r\n---------------\r\nIn the script, the Using module statement imports the classes in a nested module. Using the classes succeeds. At the command line, the Using module statement does not import the classes in a nested module. Using the classes fails.\r\n\r\nEnvironment data\r\n----------------\r\n\r\n<!-- provide the output of $PSVersionTable -->\r\n\r\n```\r\nName                           Value\r\n----                           -----\r\nPSRemotingProtocolVersion      2.3\r\nPSVersion                      6.0.0-alpha\r\nGitCommitId                    v6.0.0-alpha.14\r\nBuildVersion                   3.0.0.0\r\nCLRVersion\r\nSerializationVersion           1.1.0.1\r\nPSCompatibleVersions           {1.0, 2.0, 3.0, 4.0...}\r\nPSEdition                      Core\r\nWSManStackVersion              3.0\r\n```",
  "closed_at": null,
  "comments": [],
  "created_at": "2017-01-06T02:09:13Z",
  "number": 2964,
  "state": "open",
  "title": "Using module behavior on nested modules is inconsistent",
  "updated_at": "2017-02-15T19:45:37Z"
}