{
  "_url": "https://github.com/PowerShell/PowerShell/issues/2978",
  "author": "J0F3",
  "body": "Hi,\r\n\r\nI have observed a strange behavior of the DSC Pullserver Reporting feature in WMF 5.1. The clients are making excessive amount of request to send status reports. They make 10-15 request per seconds! Is this normal? \r\n\r\nExample out of an IIS log file which show the request of only one client for 5sec. I think it shows way too much request for this small time frame:\r\n![image](https://cloud.githubusercontent.com/assets/12759579/21761075/e2ca7168-d650-11e6-94b3-3e5ab2cd1a4c.png)\r\n\r\nThanks\r\nJonas",
  "closed_at": "2018-08-29T17:39:09Z",
  "comments": [
    {
      "author": "grayzu",
      "author_association": "NONE",
      "body": "This may be normal. The way that DSC status reporting works is that it will send a report when there is a connection to the pull server. If there is no connection to the pull server, the agent will cache the status locally for every run. When a connection is reestablished, DSC will send all of the status messages that were cached locally. Once all status messages are successfully sent to the pull server, DSC will only send status after finishing a run.\r\n\r\nDoes this sound like your  scenario? \r\n\r\nMarkG",
      "created_at": "2017-01-10T21:15:39Z",
      "updated_at": "2017-01-10T21:15:39Z"
    },
    {
      "author": "J0F3",
      "author_association": "NONE",
      "body": "Hi Mark,\r\n\r\nYes, this sound like whats happens here. But then I have some questions about the scalability of the Pullserver or the possibilities to configure a DSC Pullserver for high availability.\r\n\r\nWe have about 180 VMs registerd to our Pullserver. When they have reporting enabled  I can see that the AppPool for the DSC Pullserver has very high CPU and RAM utilization. I additional there are a lot of error in  the event log from ESENT: \"The version store for this instance as reached its maximum size of 15MB...\"\r\n\r\nAs consequence the DSC Pull Server becomes almost unresponsive.\r\n\r\nSo is there a possibilty to load balance or scale out the DSC Pullserver so that the load can be distributed to multiply servers?\r\nAnd how can a DSC Pullserver made highly aviable (with WMF 5.1 and EDB database)?\r\n\r\nThanks\r\nJonas",
      "created_at": "2017-01-11T10:49:59Z",
      "updated_at": "2017-01-11T10:49:59Z"
    },
    {
      "author": "grayzu",
      "author_association": "NONE",
      "body": "Jonas,\r\n\r\nThe issue with the ESENT db not using circular logging has been resolved in WMF 5.1. This resolves, your issue, correct? \r\n\r\nMarkG",
      "created_at": "2017-02-16T00:33:10Z",
      "updated_at": "2017-02-16T00:33:10Z"
    },
    {
      "author": "J0F3",
      "author_association": "NONE",
      "body": "No, this issue here still exists. It has actually nothing to do with the circular logging. Have also a look at: https://github.com/PowerShell/xPSDesiredStateConfiguration/issues/296. This one is also still open. Even after circular logging is enabled.\r\n\r\nIn additional the question about the scalability and high availability is still unanswered. I had also questioned the same at the PowerShell-Docs repo. But also, there, still no answer. -> https://github.com/PowerShell/PowerShell-Docs/issues/908 \r\nFor production use its very important that we can make the DSC Pullserver HA. But with the current ESENT DB it seems impossible. Or at least, no one know how to do it.\r\n\r\nSo, some clarifications would be much appreciated!\r\n\r\nThx\r\nJonas",
      "created_at": "2017-02-19T11:36:28Z",
      "updated_at": "2017-02-19T11:36:28Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "@TravisEz13 Should we move the issue in DSC repo and close?",
      "created_at": "2018-08-29T14:51:00Z",
      "updated_at": "2018-08-29T14:51:00Z"
    },
    {
      "author": "TravisEz13",
      "author_association": "MEMBER",
      "body": "DSC is Windows PowerShell and should be reported via User Voice per the issue template.\r\n\r\n>For Windows PowerShell 5.1 issues, suggestions, or feature requests please use the following link instead:\r\n> - Windows PowerShell [UserVoice](https://windowsserver.uservoice.com/forums/301869-powershell)\r\n",
      "created_at": "2018-08-29T17:03:37Z",
      "updated_at": "2018-08-29T17:05:16Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "@J0F3 Please report via User Voice site.",
      "created_at": "2018-08-29T17:39:09Z",
      "updated_at": "2018-08-29T17:39:09Z"
    }
  ],
  "created_at": "2017-01-09T08:52:48Z",
  "labels": [
    "Issue-Question",
    "Resolution-External",
    "Area-DSC"
  ],
  "number": 2978,
  "state": "closed",
  "title": "DSC Pullserver huge amount of \"SendReport\" requests. Normal?",
  "updated_at": "2018-08-29T17:39:09Z"
}