{
  "_url": "https://github.com/PowerShell/PowerShell/issues/2979",
  "author": "mattiasunger",
  "body": "When doing command completion at least I tend to use aliases more often than not. Perhaps even more often my own specified aliases over others. I therefore feel like it would be a nice improvement to have aliases prioritized, or have the option have it so, over other commands since those are the ones I'm more often looking for.\r\n\r\nAnother option would be to prioritize latest/most used commands but in general I think aliases are more used than not in these cases.",
  "closed_at": null,
  "comments": [
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "@mattiasunger Thanks for your opinion! Now there are several open issues about aliases and completion. You can find them easily. Perhaps you'd better move your motivation in one of those discussions and close this issue as duplicate.",
      "created_at": "2017-01-09T09:32:18Z",
      "updated_at": "2017-01-09T09:32:18Z"
    },
    {
      "author": "mattiasunger",
      "author_association": "NONE",
      "body": "@iSazonov Hi! I could definitely do that and I did search for something similar to what I suggested. However I couldn't find one that fitted, perhaps I don't know the correct lingo yet. If you know one feel free to link it so I can close this one.",
      "created_at": "2017-01-09T09:39:33Z",
      "updated_at": "2017-01-09T09:39:33Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "@mattiasunger If you do not find a suitable issue, I moreover will not be able to do that :-)\r\n\r\nPlease specify how your aliases conflict with existing commands? Can you give examples?\r\nCan you use your personal short prefix to exclude conflicts? (`zSelect-Object`)\r\n",
      "created_at": "2017-01-09T11:21:58Z",
      "updated_at": "2017-01-09T11:21:58Z"
    },
    {
      "author": "mattiasunger",
      "author_association": "NONE",
      "body": "@iSazonov I can of course give my own aliases a prefix to make it easier. An example that happens every now and then are some aliases for opening and building solutions. I.e.\r\n\r\n**opensln**\r\n`\"ope\" -> [tab] -> Open-NetGPO -> [tab] -> openfiles.exe -> [tab] -> opensln`\r\n\r\n**buildsln**\r\n`\"build\" -> [tab] -> .\\Build\\ -> [tab] -> \"BuildAbout.exe\" -> [tab] -> BuildConsole.exe -> [tab] x10 -> buildsln\r\n`\r\n\r\nI'm not saying I will never use the files or folders but at least as the first word it's probably an alias i'm after.",
      "created_at": "2017-01-09T12:33:31Z",
      "updated_at": "2017-01-09T12:38:35Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "Currently we do simple string sorting. To implement the request we have to create more complex custom comparer. It seems not worth the effort.",
      "created_at": "2019-07-12T04:38:47Z",
      "updated_at": "2019-07-12T04:38:47Z"
    }
  ],
  "created_at": "2017-01-09T08:58:42Z",
  "number": 2979,
  "state": "open",
  "title": "Prioritize alias when doing command completion",
  "updated_at": "2021-07-12T21:26:41Z"
}