{
  "_url": "https://github.com/PowerShell/PowerShell/issues/2981",
  "author": "paulcallen",
  "body": "When installing PSRP client bits for Centos with powershell we need to also add a couple of symbolic links for both crypto and ssl system libraries. This is because we create libmi.so in a platform independent way and to work around platform differences we use the symbolic links. \r\nThis change adds the necessary changes to the packaging build script before it generates the platform package bundle.\r\nUbuntu does not need this change as the library names already match on that platform with the names we chose to use.",
  "closed_at": "2017-01-11T01:44:05Z",
  "comments": [
    {
      "author": "vors",
      "author_association": "COLLABORATOR",
      "body": "Would it be better to re-use the `AfterInstallScript` and put this logic into the temp `.sh` file that we use for the package? That would keep the install complexity more manageable imo. At least in the sense of 'different techniques used to create the package'.\r\n\r\nUPD: Also, what about the dev builds on CentOS? I.e. if remoting tests should fail on CentOS, because we run them directly from `dotnet publish` (or maybe even `dotnet build`) directory. Should we move this symlink creation to the `Start-PSBuild` for that matter?",
      "created_at": "2017-01-10T05:26:39Z",
      "updated_at": "2017-01-10T05:42:08Z"
    },
    {
      "author": "paulcallen",
      "author_association": "MEMBER",
      "body": "there are multiple problems that made me pick the current model, one being @andschwa and Mike did not mention this. \r\nThe other is doing it before adds lots of complexity due to various bugs in symbolic link management, namely powershell does not copy symbolic links as links so they turn into actual files., and nuget itself does not handle links properly either.\r\nCan we push the current solution in so we can get centos working in the next release",
      "created_at": "2017-01-10T19:28:51Z",
      "updated_at": "2017-01-10T19:28:51Z"
    },
    {
      "author": "andschwa",
      "author_association": "MEMBER",
      "body": "`AfterInstallScript` would be more complex (our pre/post scripts a) are embedded shell scripts in PowerShell and b) should be used only as a last resort).\r\n\r\nThis change is more of a work-around, due to being blocked by #2957 and a similar problem with NuGet itself, thus preventing us from adding the symlinks any earlier. Because of these bugs, symlinks in the installation directory need to be made pretty much right before the call to `fpm`. You're right, this _could_ be done within the post installation script, but that's unnecessarily complicated (IMHO) for a change that will be revisited when the symlink bugs are resolved.",
      "created_at": "2017-01-10T19:40:50Z",
      "updated_at": "2017-01-10T19:40:50Z"
    }
  ],
  "created_at": "2017-01-09T20:20:34Z",
  "number": 2981,
  "state": "closed",
  "title": "Add dependent symlinks in package for libmi.so",
  "updated_at": "2017-01-11T01:44:05Z"
}