{
  "_url": "https://github.com/PowerShell/PowerShell/issues/3036",
  "author": "lzybkr",
  "body": "Instead of creating short strings of spaces every time we want to pad, I've introduced a cache for reuse.\r\n\r\nThe win is small - maybe 3% faster after almost 10s of formatting.",
  "closed_at": "2017-01-26T02:19:09Z",
  "comments": [
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "1. On Windows I often change the window size (often increase, sometimes decrease) in the time of the session. This means that IndentCacheMax must be up to 200 for my 19-inch display. I guess that makes sense to set IndentCacheMax in 256 or even more.\r\n2. Perhaps it's not too expensive to immediately initialize cache from 1 to IndentCacheMax? This will simplify and speed up the code.\r\n",
      "created_at": "2017-01-24T11:12:19Z",
      "updated_at": "2017-01-24T11:12:19Z"
    },
    {
      "author": "lzybkr",
      "author_association": "MEMBER",
      "body": "1. The padding is rarely the full window width.  I experimented with `dir c:\\windows\\system32` and found the longest padding used was 120 with a window width of 229, so I think 120 is a reasonable upper limit.\r\n2. I disagree that initializing the full cache is a better choice.\r\n    * Many of the entries would go unused (using data from the above experiment).\r\n    * I want to avoid additional work at startup, not add additional work.\r\n    * More objects means more time in GC, also something we want to avoid.\r\n    * Assuming _not initialized_ adds 1 `if` on the normal path and 1 `Interlocked.CompareExchange` on the less common path, both of those operations are fast.",
      "created_at": "2017-01-24T18:56:48Z",
      "updated_at": "2017-01-24T18:56:48Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "Clear. Thanks for clarification!",
      "created_at": "2017-01-25T09:09:26Z",
      "updated_at": "2017-01-25T09:09:26Z"
    }
  ],
  "created_at": "2017-01-23T23:04:27Z",
  "number": 3036,
  "state": "closed",
  "title": "Cache padding strings up to 120 spaces",
  "updated_at": "2017-11-01T20:41:59Z"
}