{
  "_url": "https://github.com/PowerShell/PowerShell/issues/3042",
  "author": "SteveL-MSFT",
  "body": "By default, Invoke-WebRequest relies on Internet Explorer components to parse the html (user retrieves it via the .parsedhtml property), however in Azure Functions and Containers, IE is not present so if -UseBasicParsing is not specified, you get an error saying that IE is not installed.\r\n\r\nExpected behavior is for Invoke-WebRequest to default to -UseBasicParsing if IE is not present (perhaps output a warning if that switch is not specified as ParsedHtml property will be null)",
  "closed_at": "2017-02-01T23:25:36Z",
  "comments": [
    {
      "author": "daxian-dbw",
      "author_association": "MEMBER",
      "body": "Is this bug specific to Windows PowerShell?\r\n\r\nCurrently in powershell core, we always use basic parsing because we haven't figure out a way to depend on mshtml.dll in CoreCLR. See the code [here](https://github.com/PowerShell/PowerShell/blob/master/src/Microsoft.PowerShell.Commands.Utility/commands/utility/WebCmdlet/CoreCLR/WebResponseObjectFactory.CoreClr.cs#L20). It would be great that we resolve this dependency issue so that `Invoke-WebRequest` can continue to use IE to parse html response when IE is available.",
      "created_at": "2017-02-01T23:13:55Z",
      "updated_at": "2017-02-01T23:13:55Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "Based on the code, this appears to be a Windows PowerShell specific issue (as Azure Functions uses Windows PowerShell v4 today).  We won't be making this fix in Windows PowerShell v5, so resolving.",
      "created_at": "2017-02-01T23:25:36Z",
      "updated_at": "2017-02-01T23:25:36Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "Tracked in #2867 ",
      "created_at": "2017-03-08T05:46:58Z",
      "updated_at": "2017-03-08T05:46:58Z"
    }
  ],
  "created_at": "2017-01-24T21:15:04Z",
  "number": 3042,
  "state": "closed",
  "title": "Invoke-WebRequest errors if Internet Explorer is not installed",
  "updated_at": "2017-03-08T05:46:58Z"
}