{
  "_url": "https://github.com/PowerShell/PowerShell/issues/3048",
  "author": "joeyaiello",
  "body": "Originally filed at https://github.com/PowerShell/PowerShell-Docs/issues/990\r\n\r\nQuote from @aarju:\r\n\r\n> I would like to be able to use a smartcard + pin to authenticate a new PSSession on a remote host. The smartcard can be selected via the Get-Credential popup window, but the credential object created will not successfully authenticate to the domain or other hosts.\r\n> \r\n> The enterprise network I work on has separation of account privileges along with enforcing 2FA for all accounts. This means that I have multiple smartcard readers on my system, and when I need to run as administrator I have to use the smartcard + pin to start a new powershell prompt with my admin account. When I try New-PSSession with a remote computer I receive a winRM client error because default authentication fails without HTTPS transport. My current work around for executing remote PSSessions is an exception to policy allowing login to an admin account without 2FA, not an ideal situation.",
  "closed_at": null,
  "comments": [
    {
      "author": "jcotton42",
      "author_association": "CONTRIBUTOR",
      "body": "Is there any progress on this issue?",
      "created_at": "2017-08-31T15:37:32Z",
      "updated_at": "2017-08-31T15:37:32Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "This is not part of 6.0.0 release plan.  We should probably expose Authn interfaces making it pluggable.",
      "created_at": "2017-09-13T18:34:32Z",
      "updated_at": "2017-09-13T18:34:32Z"
    },
    {
      "author": "jdix531",
      "author_association": "NONE",
      "body": "Looking forward to this enhancement (we all are here).",
      "created_at": "2017-10-30T18:24:43Z",
      "updated_at": "2017-10-30T18:24:43Z"
    },
    {
      "author": "milesgratz",
      "author_association": "NONE",
      "body": "Need this functionality as well. Also hoping to see this fixed too: #4670 ",
      "created_at": "2017-10-31T22:37:31Z",
      "updated_at": "2017-10-31T22:38:44Z"
    },
    {
      "author": "charleswj",
      "author_association": "NONE",
      "body": "Over a year out, has there been any progress?",
      "created_at": "2018-02-13T05:02:57Z",
      "updated_at": "2018-02-13T05:02:57Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "No update on this as no one on my team is actively working on this.  Since we support PSRP over SSH, you can use two-factor auth over SSH (just normal OpenSSH two factor support).  Changed to WinRM would be required to support this over WSMan and there are no plans to add capabilities to WinRM.",
      "created_at": "2018-02-13T17:13:42Z",
      "updated_at": "2018-02-13T17:13:42Z"
    },
    {
      "author": "kilasuit",
      "author_association": "COLLABORATOR",
      "body": "@SteveL-MSFT any updates on this as there are MANY orgs that will be adopting MFA (mine have) and this wukk be a limitation that become a barrier of entry\r\n\r\nI know that you suggest that there are no plans to add WinRM capabilities but surely there likely to be enterprises that will require this functionality?\r\n\r\nAlso regarding OpenSSH MFA (Two factor is not technically the correct term) is there ANY documentation for how this works in a PowerShell context?",
      "created_at": "2018-03-20T19:10:39Z",
      "updated_at": "2018-03-20T19:12:23Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "@kilasuit tried to setup TFA for OpenSSH which works, but fails with PSRP.  Opened https://github.com/PowerShell/PowerShell/issues/6439",
      "created_at": "2018-03-20T20:48:25Z",
      "updated_at": "2018-03-20T20:48:25Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "@kilasuit I've verified that MFA works with PSRP over SSH (at least macOS to Linux) using google-authenticator and pub key auth.  Any auth methods used with SSH should just work with PowerShell remoting as PowerShell Core doesn't do any of the authentication and hands it off completely to SSH.",
      "created_at": "2018-04-23T13:57:23Z",
      "updated_at": "2018-04-23T13:57:23Z"
    },
    {
      "author": "joeyaiello",
      "author_association": "CONTRIBUTOR",
      "body": "Just to clarify, there's an existing workflow on Windows PowerShell that is *kind of* 2FA where a user:\r\n\r\n* runs Get-Credential to get the username/password UI\r\n* selects a smartcard (physical or virtual) from a dropdown\r\n* inputs a PIN\r\n\r\nI don't believe we can support this workflow easily on non-Windows platforms, but we should strongly consider it for 6.2 on Windows. One possible implementation would be to provide a parameter to Get-Creedential that can tab-complete into available smartcards. ",
      "created_at": "2018-04-24T13:33:54Z",
      "updated_at": "2018-04-24T13:33:54Z"
    },
    {
      "author": "manivasagam1130107",
      "author_association": "NONE",
      "body": "@joeyaiello\r\n\r\nThe existing workflow doesn't seem to work, it gives me winrm issues like mentioned above...can you please advise what version should I use to get the existing workflow working?\r\n",
      "created_at": "2019-03-13T17:30:51Z",
      "updated_at": "2019-03-13T17:30:51Z"
    },
    {
      "author": "Nahuatl-Mexica",
      "author_association": "NONE",
      "body": "Still any update on this? I work in a large environment where we use smart cards for daily logins,  and would like to see if this is an option to use with Posh. This would be great for an enterprise environment like the DOD, or DOS who rely on CAC authentication for everything.",
      "created_at": "2021-04-18T23:58:18Z",
      "updated_at": "2021-04-18T23:58:18Z"
    },
    {
      "author": "kennyroody",
      "author_association": "NONE",
      "body": "Good Morning, haven't seen any changes on this since Jun 2018. This would be an awesome addition for the DoD and anyone who uses alternate credentials/smartcards. I appreciate everything you all do. Thank you!",
      "created_at": "2022-02-17T17:49:28Z",
      "updated_at": "2022-02-17T17:49:28Z"
    }
  ],
  "created_at": "2017-01-25T22:34:26Z",
  "labels": [
    "Issue-Enhancement",
    "WG-Remoting"
  ],
  "number": 3048,
  "state": "open",
  "title": "Smartcard support for Get-Credential and PSRP",
  "updated_at": "2022-02-17T17:49:28Z"
}