{
  "_url": "https://github.com/PowerShell/PowerShell/issues/3102",
  "author": "andrewducker",
  "body": "I have a bunch of EXEs written in C# which carry out useful utility functions.\r\n\r\nI would love to make the functionality in them available to PowerShell.\r\n\r\nIdeally PowerShell should be able to detect that the exe I'm about to run contains PowerShell commands and autofill my parameters (and accept objects from the response).  But failing that, having the ability to build a single artefact and have it work both as an exe and a PS Module would make life a lot easier.",
  "closed_at": "2019-04-17T19:02:03Z",
  "comments": [
    {
      "author": "mirichmo",
      "author_association": "MEMBER",
      "body": "An alternative approach would be to refactor your EXEs by moving the useful utility functions into a separate assembly. At that point you could package that assembly as a PowerShell module and compile your refactored EXEs against it.",
      "created_at": "2017-02-08T16:57:24Z",
      "updated_at": "2017-02-08T16:57:24Z"
    },
    {
      "author": "andrewducker",
      "author_association": "NONE",
      "body": "That would be possible.  But doesn't work with the traditional workflow of \"All of the tools that the team use are sitting in a shared tools folder that's on the path\" - at the moment all of the command line tools are individual exes, because that's how command line exes have tended to work.\r\n\r\nI'm trying to work out how to migrate forward from that without breaking the existing workflow, and it's proving...tricky.",
      "created_at": "2017-02-08T17:58:11Z",
      "updated_at": "2017-02-08T17:58:11Z"
    },
    {
      "author": "andrewducker",
      "author_association": "NONE",
      "body": "As an example of why this is useful - the Nuget.exe used for carrying out nuget CLI tasks is pretty good.  But if it could be used both as normal from within DOS and also from within Powershell with autocompletion (and returning objects rather than text) that would be fantastic.",
      "created_at": "2017-10-12T12:43:15Z",
      "updated_at": "2017-10-12T12:43:15Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "It is possible load any C# exe by `Assemply.LoadFrom()`. If the exe contains a binary PowerShell module and a module manifest perhaps we would load it.",
      "created_at": "2017-10-12T15:47:26Z",
      "updated_at": "2017-10-12T16:07:06Z"
    },
    {
      "author": "MaximoTrinidad",
      "author_association": "NONE",
      "body": "Are these C# executable portable .NET Core? And, keeping in mind, that only Windows will work with *.exe programs. So, what about the other environments? This should work cross-platform.\r\n\r\n:)\r\n",
      "created_at": "2017-10-12T16:18:05Z",
      "updated_at": "2017-10-12T16:18:05Z"
    },
    {
      "author": "andrewducker",
      "author_association": "NONE",
      "body": "My understanding is that both .Net DLL and EXE files are basically assemblies with a bit of metadata.\r\n\r\nIn which case the dead simple case of \"Load the Powershell functionality from this assembly\" should work perfectly well.\r\n\r\nObviously, trying to load an EXE which isn't a .Net assembly wouldn't work.  But is there any reason why loading it from an EXE wouldn't work in general?\r\n\r\nThat way I could either run the exe as normal, or Import-Module on the exe and use the functionality in a PowerShell manner.",
      "created_at": "2017-11-22T14:55:58Z",
      "updated_at": "2017-11-22T14:55:58Z"
    },
    {
      "author": "lzybkr",
      "author_association": "MEMBER",
      "body": "@andrewducker - have you tried it? Maybe add a cmdlet to your exe, copy it or create a symbolic link to the exe with a dll extension?\r\n\r\nI do like the idea in principle, I've never been a fan of multi-file modules and the module directory structure, but I do think command auto-discovery would be problematic if this was supported - you don't want PowerShell looking at every `exe` in the `PATH` checking if it has any cmdlets, at least not with the current implementation.",
      "created_at": "2017-11-22T15:29:20Z",
      "updated_at": "2017-11-22T15:29:20Z"
    },
    {
      "author": "andrewducker",
      "author_association": "NONE",
      "body": "Sadly, blocked.\r\n\r\nLoadModuleNamedInManifest in ModuleCmdletBase checks against ModuleIntrinsics.IsPowerShellModuleExtension which checks against PSModuleProcessableExtensions which checks against a bunch of approved extensions.\r\n\r\nOf which \"exe\" isn't one.\r\n\r\nIf I take that exe and rename it to a dll then it imports just fine.  And if I don't rename it then it works as a Console EXE just fine.\r\n\r\nWhich means that I _think_ that the only thing standing between me and the (basic) functionality I want is that check :-)",
      "created_at": "2017-11-22T16:02:20Z",
      "updated_at": "2017-11-22T16:04:04Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "We could load EXEs with `Add-Type -AssemblyName` not Import-Module.",
      "created_at": "2017-11-22T17:22:55Z",
      "updated_at": "2017-11-22T17:22:55Z"
    },
    {
      "author": "lzybkr",
      "author_association": "MEMBER",
      "body": "I'm aware of the extension check, that's why I suggested copying an exe to a dll or using a symbolic link - to see if you could get past the extension check, then you'd know if it could work.",
      "created_at": "2017-11-22T17:31:33Z",
      "updated_at": "2017-11-22T17:31:33Z"
    },
    {
      "author": "andrewducker",
      "author_association": "NONE",
      "body": "Aaah, gotcha.  Yup, it works!\r\n\r\nSo, any chance of getting the check to allow exes in the future?",
      "created_at": "2017-11-22T22:38:43Z",
      "updated_at": "2017-11-22T22:38:43Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "@andrewducker this doesn't seem to be a common use case, so I don't think my team would look at addressing this, I'd rather spend time supporting `import-module module.nupkg` instead so that modules can stay in archived form rather than expanded to a folder",
      "created_at": "2017-12-12T21:46:03Z",
      "updated_at": "2017-12-12T21:46:03Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "@SteveL-MSFT It seems we already implement this in #7281 and can close the issue.\r\nIt is dup #6741",
      "created_at": "2019-04-17T06:15:55Z",
      "updated_at": "2019-04-17T06:17:13Z"
    }
  ],
  "created_at": "2017-02-05T17:10:56Z",
  "labels": [
    "Resolution-Duplicate",
    "Issue-Enhancement",
    "WG-Engine",
    "Up-for-Grabs",
    "Resolution-Fixed"
  ],
  "number": 3102,
  "state": "closed",
  "title": "Suggestion: Powershell should be able to Import-Module from an exe",
  "updated_at": "2019-04-17T19:02:03Z"
}