{
  "_url": "https://github.com/PowerShell/PowerShell/issues/3168",
  "author": "daxian-dbw",
  "body": "Reviewer and Assignee of a PR should be separate roles.\r\n- Reviewers do code review, and eventually approve the PR\r\n- Assignee is a maintainer, who monitors the progress of the PR, coordinates the review process, and merges PR after it's approved.\r\nWhen submitting a new PR, the author is encouraged to choose Reviewer(s) and Assignee for the PR. If either Reviewer or Assignee is left blank, maintainers will choose them for the PR.\r\nHowever, for PowerShell Team members, You are **required** to choose them yourself for the PR.\r\n**Note that**, even if you are not designated as a Reviewer for a PR, you can still feel free to jump in and review the change.\r\n\r\n**The PR author is responsible to drive the PR to the Approved state.** The author should ping the reviewer(s) when they don't respond timely enough (or event talk to them if you can). If the review process is making no progress (or too slow), the author can always contact the Assignee to help coordinate the process, for example, if the reviewer(s) don't respond back for too long, the Assignee can review the existing comments and decide if the PR is in good state or a new reviewer should be pulled in.\r\n\r\nA template will be added to pull request, to remind the author to choose Reviewer(s) and Assignee for the PR.",
  "closed_at": "2017-02-23T21:13:06Z",
  "comments": [
    {
      "author": "daxian-dbw",
      "author_association": "MEMBER",
      "body": "@TravisEz13 thanks for catching them. I think I fixed them all this time, can you take a look again?",
      "created_at": "2017-02-17T22:22:36Z",
      "updated_at": "2017-02-17T22:22:36Z"
    },
    {
      "author": "daxian-dbw",
      "author_association": "MEMBER",
      "body": "@mirichmo @TravisEz13 the conversation about \"collaborators\" got hidden by Github, but that comment still stands.",
      "created_at": "2017-02-20T22:15:16Z",
      "updated_at": "2017-02-20T22:15:16Z"
    },
    {
      "author": "daxian-dbw",
      "author_association": "MEMBER",
      "body": "Hi Reviewers, I think I have addressed all the comments, can you please take another look?",
      "created_at": "2017-02-21T18:28:42Z",
      "updated_at": "2017-02-21T18:28:42Z"
    },
    {
      "author": "daxian-dbw",
      "author_association": "MEMBER",
      "body": "@joeyaiello Thanks for the review! I have addressed your comments. Please take another look.",
      "created_at": "2017-02-22T00:22:17Z",
      "updated_at": "2017-02-22T00:22:17Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": " I can not to choose Reviewer(s) and Assignee for my PR 😕 ",
      "created_at": "2017-02-22T20:15:14Z",
      "updated_at": "2017-02-22T20:15:14Z"
    },
    {
      "author": "daxian-dbw",
      "author_association": "MEMBER",
      "body": "@iSazonov hmm, I didn't know about that ... so I guess then all non-powershell-team users cannot choose Reviewer and Assignee? @TravisEz13 do you happen to know if that's the case?\r\n\r\n@SteveL-MSFT, the `collaborator` has been changed to `Collaborator`.",
      "created_at": "2017-02-22T21:35:21Z",
      "updated_at": "2017-02-22T21:35:21Z"
    },
    {
      "author": "TravisEz13",
      "author_association": "MEMBER",
      "body": "@daxian-dbw I just submitted a review to PSScriptAnalyzer and I cannot even assign a reviewer there.",
      "created_at": "2017-02-22T23:41:42Z",
      "updated_at": "2017-02-22T23:41:42Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "@daxian-dbw Yes, it is. Personally for me it is not a problem. I can always make a ping by \"/cc\".",
      "created_at": "2017-02-23T15:28:34Z",
      "updated_at": "2017-02-23T15:28:34Z"
    }
  ],
  "created_at": "2017-02-17T21:24:36Z",
  "number": 3168,
  "state": "closed",
  "title": "Define roles and their responsibilities in a PR",
  "updated_at": "2017-03-27T05:52:49Z"
}