{
  "_url": "https://github.com/PowerShell/PowerShell/issues/3206",
  "author": "jpsnover",
  "body": "If a module has bad verbs, and you specify:\r\n$PSDefaultParameterValues.\"Import-module:DisableNameCheck\"=$true\r\n\r\nYou can import that module and not receive any warnings.  HOWEVER\r\nIf that module has a nested module which has bad verbs, then it will complain about those verbs when you import the original module.\r\n \r\nIn other words, NestedModule processing does not respect $PSDefaultParameterValues.\r\nThis turns out to be a big headache as there are a number of 3rd party modules we are using with bad names and the warnings are screwing up the signal-to-noise ratio of our logs.",
  "closed_at": "2022-05-17T21:00:45Z",
  "comments": [
    {
      "author": "lzybkr",
      "author_association": "MEMBER",
      "body": "Isn't this part of the design of `$PSDefaultParameterValues`?\r\n\r\nA default set in global scope is not supposed to affect a module - and nested modules are processed in the scope of the module, not in global scope.\r\n\r\nIf the nested modules won't fix their names - isn't it the responsibility of the module depending on the nested modules to disable the name check?  This would require explicitly import the modules in a psm1 instead of using the `NestedModules` property in a psd1, but it seems like this would be consistent with the design for safely setting default parameter values.",
      "created_at": "2017-02-26T19:42:28Z",
      "updated_at": "2017-02-27T05:28:34Z"
    },
    {
      "author": "msftbot[bot]",
      "author_association": "NONE",
      "body": "This issue has been marked as by-design and has not had any activity for **1 day**. It has been closed for housekeeping purposes.",
      "created_at": "2022-05-17T21:00:44Z",
      "updated_at": "2022-05-17T21:00:44Z"
    }
  ],
  "created_at": "2017-02-26T16:57:18Z",
  "number": 3206,
  "state": "closed",
  "title": "NestedModule processing does not respect $PSDefaultParameterValues",
  "updated_at": "2022-05-17T21:00:45Z"
}