{
  "_url": "https://github.com/PowerShell/PowerShell/issues/3210",
  "author": "schittli",
  "body": "Good eveing\r\n\r\nWMF 5.1 is really annoying, because the installaiton behaves different than the usual, great working way: it is impossible to uninstall or to repair it on the 'great, stable, ...' Windows 10 Platform. Are you sure that WMF is rock solid??\r\n\r\nIf we use Powershell Enum, we get an exception. This is the content of the test-script test.ps1:\r\n\r\nEnum ComputerType\r\n{\r\n  E1\r\n  E2\r\n}\r\n\r\nIf we call it:\r\n \r\nPS C:\\temp> c:\\temp\\test.ps1\r\nThe given assembly name or codebase was invalid. (Exception from HRESULT: 0x80131047)\r\nAt line:1 char:1\r\n+ c:\\temp\\test.ps1\r\n+ ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r\n    + CategoryInfo          : OperationStopped: (:) [], FileLoadException\r\n    + FullyQualifiedErrorId : System.IO.FileLoadException\r\n\r\n\r\nWe have the latest WMF 5.1 Version for Windows 10:\r\n\r\nPS C:\\temp> $PSVersionTable.PSVersion\r\nMajor  Minor  Build  Revision\r\n-----  -----  -----  --------\r\n5      1      14393  693\r\n\r\n\r\nPlease bring back a standard Installer, so that WMF can be installed individually on each Windows. It shouldn't belong to the OS itself. \r\n\r\nbtw: We've got this problem after upgrading to the Windows 10 anniversary upgrade.\r\nIt looks like we have to reinstall the OS just to fix the scripting environment... we really hope you agree it's annoying to fix a software package this way...\r\n\r\nKind regards,\r\nThomas\r\n",
  "closed_at": "2017-02-27T20:39:07Z",
  "comments": [
    {
      "author": "ghost",
      "author_association": "NONE",
      "body": "WMF 5.1 **does not apply to, and cannot be installed on Win10**. Each WMF package targets specific older versions of Windows. WMF takes the latest version of the management stack and updates older versions of the operating system's PowerShell, WMI, & WinRM components. \r\nWin10/Server 2016 are maintained via Windows Update. If you want to update earlier version of Win10 to the latest PowerShell/WMI/WinRm features, use WU to get the latest update of Win10. If you modify the in-box version of PowerShell/WMI/WinRM, you should be able to do a system repair to get back to the original components.\r\nI believe this is nearly duplicated in the [WMF blog topic]\r\n(https://blogs.msdn.microsoft.com/powershell/2016/12/06/wmf-5-1-releasing-january-2017/). \r\n",
      "created_at": "2017-02-27T20:39:07Z",
      "updated_at": "2017-02-27T20:39:07Z"
    }
  ],
  "created_at": "2017-02-26T21:25:59Z",
  "labels": [
    "Issue-Question",
    "Resolution-Answered"
  ],
  "number": 3210,
  "state": "closed",
  "title": "WMF 5.1 : How to repair or uninstall?",
  "updated_at": "2017-03-15T05:55:57Z"
}