{
  "_url": "https://github.com/PowerShell/PowerShell/issues/3233",
  "author": "fbehrens",
  "body": "In the current implementation it show the properties of the first object.\r\n\r\n    $a = [PsCustomObject] @{a=1}\r\n    $b = [PsCustomObject] @{a=2;b=3}\r\n    $a,$b | ft -au\r\n    # a  \r\n    # -  \r\n    # 1  \r\n    # 2  \r\n\r\n    $b,$a | ft -au\r\n    # a b\r\n    # - -\r\n    # 2 3\r\n    # 1\r\n\r\nI would like to have an option which shows all properties, like\r\n\r\n    $a,$b | ft -au\r\n    # a b\r\n    # - -\r\n    # 1\r\n    # 2 3\r\n\r\nSometimes I work with such sparse data, where not all objects have the same properties,\r\nand i missed this feature.",
  "closed_at": "2022-05-06T20:18:04Z",
  "comments": [
    {
      "author": "joeyaiello",
      "author_association": "CONTRIBUTOR",
      "body": "Yeah, that seems busted to me. \r\n\r\nMaybe @JamesWTruher can weigh in on whether there might be some reason why this is by design? ",
      "created_at": "2017-03-01T19:43:44Z",
      "updated_at": "2017-03-01T19:43:44Z"
    },
    {
      "author": "fbehrens",
      "author_association": "CONTRIBUTOR",
      "body": "This would block, when part of a pipeline, same as `-AutoSize` does.\r\nBut most of the time, you use `Format-Table` as the last command for display.\r\nThis may make it reasonable to change the default behavior of the command.",
      "created_at": "2017-03-01T20:02:19Z",
      "updated_at": "2017-03-01T20:02:19Z"
    },
    {
      "author": "joeyaiello",
      "author_association": "CONTRIBUTOR",
      "body": "Ah, that's a good point...in that case, I don't think we should change the default (speed is king), but rather offer a parameter to override the default. ",
      "created_at": "2017-03-01T23:36:33Z",
      "updated_at": "2017-03-01T23:36:33Z"
    },
    {
      "author": "BrucePay",
      "author_association": "COLLABORATOR",
      "body": "Formatting and output uses metadata and a set of heuristics to _automagically_ guess how to render an item. Format-Table in particular assumes that it's rendering a more or less homogeneous collection objects (i.e. a table). In the absence of metadata describing the specific set of properties to render, it applies heuristics to the first object picking a set of properties to display by default. You can override this set on the command line, giving a specific set of properties to render in a specific order. This addresses your example:\r\n`$a,$b | ft -au a,b`\r\nIf you have a heterogeneous set of objects where you know the aggregate set of properties you're interested in, then simply specify those properties on the command line. If you don't know (or don't want to figure out) the aggregate set of properties, then I suggest using Format-List which works much better with heterogeneous collections of object. (Also note that Format-Table, in the absence of metadata, will only display 10 columns.)\r\n\r\nUltimately, the formatter is heuristic - it makes a best guess at how to render an object. In some cases that works fine but most cases require additional metadata to render objects the way you want.",
      "created_at": "2017-03-02T21:59:17Z",
      "updated_at": "2017-03-02T21:59:17Z"
    },
    {
      "author": "BrucePay",
      "author_association": "COLLABORATOR",
      "body": "Since the formatter is working as designed, I've changed the tag from ISSUE-BUG to ISSUE-ENHANCEMENT.",
      "created_at": "2017-03-02T22:00:42Z",
      "updated_at": "2017-03-02T22:00:42Z"
    },
    {
      "author": "thezim",
      "author_association": "CONTRIBUTOR",
      "body": "#2228 for reference.",
      "created_at": "2017-03-02T22:21:14Z",
      "updated_at": "2017-03-02T22:21:14Z"
    },
    {
      "author": "doctordns",
      "author_association": "COLLABORATOR",
      "body": "is this still a burning issue?  In the nearly 5 years since the issue was raised and I've seen no great community enthusiasm to implement a change.",
      "created_at": "2022-05-06T08:16:53Z",
      "updated_at": "2022-05-06T08:16:53Z"
    },
    {
      "author": "fbehrens",
      "author_association": "CONTRIBUTOR",
      "body": "Thanks for asking 😄 \r\n\r\nIt's not that burning right now, but I still think it is a useful feature. ",
      "created_at": "2022-05-06T20:18:04Z",
      "updated_at": "2022-05-06T20:18:04Z"
    }
  ],
  "created_at": "2017-03-01T17:18:19Z",
  "number": 3233,
  "state": "closed",
  "title": "Format-Table should have parameter to display all properties of all Objects",
  "updated_at": "2022-05-06T20:18:04Z"
}