{
  "_url": "https://github.com/PowerShell/PowerShell/issues/3282",
  "author": "thesmall",
  "body": "There have been several implementations of what is now officially called Microsoft.PowerShell.LocalAccounts over the last 10 years. \r\n\r\nMost of those implementations feature a parameter -ComputerName, that allows you to interact with remote computers. I obviously cannot speak for everyone here, but the benefit of having such a parameter allows you to execute against a host that does not have this module, and seeing as how Microsoft.PowerShell.LocalAccounts is only available in PowerShell 5.1 (from the searching ive done), its not always feasible to simply patch a server to have PowerShell 5.1.\r\n\r\nTherefore, it would be a great feature to expose a -ComputerName parameter in the official implementation, such that users of PowerShell can execute the functions in this module against hosts that do not have their own Microsoft.PowerShell.LocalAccounts.\r\n\r\nI did do a search for this \"issue\" and did not find any open issues matching it, but if there is, apologies for the duplication. Feel free to merge or close as needed. ",
  "closed_at": "2022-06-14T21:01:10Z",
  "comments": [
    {
      "author": "ThomasNieto",
      "author_association": "CONTRIBUTOR",
      "body": "Are you able to use `Invoke-Command` in this scenario?",
      "created_at": "2020-01-29T22:25:10Z",
      "updated_at": "2020-01-29T22:25:10Z"
    },
    {
      "author": "jdhitsolutions",
      "author_association": "COLLABORATOR",
      "body": "Under review by the Cmdlet Working Group",
      "created_at": "2022-06-01T18:09:29Z",
      "updated_at": "2022-06-01T18:09:29Z"
    },
    {
      "author": "jdhitsolutions",
      "author_association": "COLLABORATOR",
      "body": "The Cmdlet Working Group has reviewed this issue. The group recognizes the value in the ability to query local groups remotely. However, this capability does not need to reside with the cmdlet. There is nothing preventing an administrator from running `Get-LocalGroup` using `Invoke-Command`. In fact, this would be preferable given the remoting features with `Invoke-Command` such as alternate credentials, throttle limits, disconnected sessions, and ssh support. We are marking this issue as `Won't Fix`.",
      "created_at": "2022-06-13T17:11:57Z",
      "updated_at": "2022-06-13T17:11:57Z"
    },
    {
      "author": "msftbot[bot]",
      "author_association": "NONE",
      "body": "This issue has been marked as won't fix and has not had any activity for **1 day**. It has been closed for housekeeping purposes.",
      "created_at": "2022-06-14T21:01:09Z",
      "updated_at": "2022-06-14T21:01:09Z"
    }
  ],
  "created_at": "2017-03-08T18:00:53Z",
  "number": 3282,
  "state": "closed",
  "title": "Microsoft.PowerShell.LocalAccounts Add support for ComputerName parameter. ",
  "updated_at": "2022-06-14T21:01:10Z"
}