{
  "_url": "https://github.com/PowerShell/PowerShell/issues/3317",
  "author": "krishna1291soni",
  "body": "hello everyone!\r\nI m new to Power Shell, I had written a piece of code for the execution of a .exe file that installs itself. The part of code where I am failing is that i had given time slots in seconds so that installation  will finish within that duration and then take keystroke \"enter\" to finish the installation. But it is not reliable at all because the installation speed depends upon the  processor speed of machine and I have to use this code in different machines, so if the installation is taking 20 sec and i had given 15 seconds then it will take \"enter\" keystroke before the completion of installation, which will click on \"cancel\" in dialog box, and the installation is terminated without completion. Is there any way that power shell can detect new pop up dialog box or it will check whether the process is finished or not and then execute rest of the program. \r\nplease help me in solving this problem.... !\r\n\r\n$InstallFile = \"D:\\File for installation\\folder\\file.exe\"\r\nStart-Process $InstallFile\r\n$wshell = New-Object -ComObject wscript.shell;\r\n$wshell.AppActivate($InstallFile)\r\nSleep 1\r\n$wshell.SendKeys('~')\r\nSleep 1\r\n$wshell.SendKeys('~')\r\n$wshell.SendKeys(\" \")\r\n$wshell.SendKeys(\"{TAB}\")\r\n$wshell.SendKeys(\"{TAB}\")\r\n$wshell.SendKeys('~')\r\nSleep -s 10\r\n$wshell.SendKeys('~')\r\nSleep -s 5",
  "closed_at": "2019-09-30T00:00:51Z",
  "comments": [
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "Almost all standard installers have silent mode.",
      "created_at": "2017-03-13T17:34:08Z",
      "updated_at": "2017-03-13T17:34:08Z"
    },
    {
      "author": "msftbot[bot]",
      "author_association": "NONE",
      "body": "This issue has been marked as answered and has not had any activity for **1 day**. It has been closed for housekeeping purposes.",
      "created_at": "2019-09-30T00:00:51Z",
      "updated_at": "2019-09-30T00:00:51Z"
    }
  ],
  "created_at": "2017-03-13T08:11:55Z",
  "number": 3317,
  "state": "closed",
  "title": "To install an application using powershell, clicking, keystrokes and detection of new pop up dialog box",
  "updated_at": "2019-09-30T00:00:51Z"
}