{
  "_url": "https://github.com/PowerShell/PowerShell/issues/3318",
  "author": "vector-sec",
  "body": "Amazon Linux is CentOS/RHEL based but has some interesting quirks with PowerShell, making it not 100% usable.\r\n\r\nCould the PowerShell team look into officially supporting Amazon Linux?\r\n\r\nI'd also love to see System.Management.Automation and it's dependencies made available in such a way that they could be packaged into a C# AWS Lambda function.\r\n\r\nThanks!! ",
  "closed_at": "2018-04-26T13:20:53Z",
  "comments": [
    {
      "author": "r2690698",
      "author_association": "NONE",
      "body": "yeh official support would be nice please :)",
      "created_at": "2017-06-27T15:12:02Z",
      "updated_at": "2017-06-27T15:12:02Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "One of the challenges to supporting Amazon Linux is that Amazon doesn't support it outside of EC2",
      "created_at": "2017-06-27T16:00:31Z",
      "updated_at": "2017-06-27T16:00:31Z"
    },
    {
      "author": "daxian-dbw",
      "author_association": "MEMBER",
      "body": "Related to #5027.\r\nWe won't officially support Amazon Linux as it's not officially supported by .NET Core. But we will publish `tar.gz` packages for Linux/macOS starting from the next release (beta.9) that you can deploy on Amazon Linux. We updated the dockerfile for Amazon Linux and moved it to the community folder at [here](https://github.com/PowerShell/PowerShell/blob/master/docker/community/amazonlinux/Dockerfile). Please use it as an example for your deployment.",
      "created_at": "2017-10-14T01:16:38Z",
      "updated_at": "2017-10-14T01:16:38Z"
    },
    {
      "author": "pcgeek86",
      "author_association": "NONE",
      "body": "FYI, Amazon released a \"candidate\" version of Amazon Linux 2. \r\n\r\nhttps://aws.amazon.com/amazon-linux-2/ \r\n\r\n> Amazon Linux 2 LTS Candidate is available as an Amazon Machine Image (AMI) for use on Amazon Elastic Compute Cloud (Amazon EC2). It is also available as a Docker container image and as virtual machine images for use on VMware, Oracle VM VirtualBox, and Microsoft Hyper-V virtualization solutions. The virtual machine images can be used for on-premises development and testing. Amazon Linux 2 supports the latest Amazon EC2 features and includes packages that enable easy integration with AWS. AWS provides ongoing security and maintenance updates for Amazon Linux 2.\r\n",
      "created_at": "2017-12-14T00:52:29Z",
      "updated_at": "2017-12-14T00:52:29Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "@pcgeek86 I see that they have a bunch of virtual machine images, but what is the default password for ec2-user account?",
      "created_at": "2017-12-14T02:52:00Z",
      "updated_at": "2017-12-14T02:52:00Z"
    },
    {
      "author": "pcgeek86",
      "author_association": "NONE",
      "body": "Let me get an answer for you on that. @SteveL-MSFT ",
      "created_at": "2017-12-14T22:30:18Z",
      "updated_at": "2017-12-14T22:30:18Z"
    },
    {
      "author": "pcgeek86",
      "author_association": "NONE",
      "body": "@SteveL-MSFT I just found a document that details how to provision Amazon Linux for on-premises instances. Apparently the process uses cloud-init to set the default password, so I'd recommend following this guidance for now. https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/amazon-linux-2-virtual-machine.html\r\n\r\nCan we re-open this issue?",
      "created_at": "2017-12-14T22:34:30Z",
      "updated_at": "2017-12-14T22:34:30Z"
    },
    {
      "author": "yobyot",
      "author_association": "NONE",
      "body": "Lack of support for AWS Linux has always been a stumbling block for pwsh, especially now that it's pre-installed on Windows AMIs. I can't help but think that this is \"low priority\" for competitive reasons. In fact, PowerShell's goal of being \"on every system\" isn't near complete until it supports AWS Linux.",
      "created_at": "2018-04-26T12:03:08Z",
      "updated_at": "2018-04-26T12:03:08Z"
    },
    {
      "author": "pcgeek86",
      "author_association": "NONE",
      "body": "AWS now publishes Amazon Linux 2 AMIs with PowerShell Core and .NET Core pre-installed.\r\n\r\nhttps://aws.amazon.com/about-aws/whats-new/2018/03/announcing--net-core-ami-for-amazon-ec2/\r\n\r\n> Posted On: Mar 22, 2018\r\n\r\n>Amazon Web Services now offers Amazon Machine Images (AMI) with .NET Core on Amazon Linux 2 and Ubuntu. These AMIs are packaged and pre-configured with .NET Core 2.0, PowerShell Core 6.0, and the AWS Command Line Interface (CLI) enabling you to quickly and easily deploy and run .NET Core applications on Amazon EC2. \r\n\r\n>PowerShell Core 6.0 provides you with a shell and scripting experience similar to Windows. The AWS CLI allows you to interact with the AWS services through a command line.\r\n\r\n> These AMIs are provided at no additional cost beyond the Amazon EC2 instance hours used and are available in all public regions. You can begin using the AMIs directly through EC2 Console or AWS Marketplace. Visit the EC2 user guide for step-by-step instructions on launching an EC2 instance and to get more resources in our documentation.",
      "created_at": "2018-04-26T13:19:07Z",
      "updated_at": "2018-04-26T13:19:07Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "Since Amazon already publishes this, closing this issue.",
      "created_at": "2018-04-26T13:20:53Z",
      "updated_at": "2018-04-26T13:20:53Z"
    },
    {
      "author": "yobyot",
      "author_association": "NONE",
      "body": "Ah! Perfect. Thanks.",
      "created_at": "2018-04-26T13:26:20Z",
      "updated_at": "2018-04-26T13:26:20Z"
    }
  ],
  "created_at": "2017-03-13T16:59:54Z",
  "labels": [
    "Issue-Question",
    "Area-Maintainers-Build",
    "Resolution-External"
  ],
  "number": 3318,
  "state": "closed",
  "title": "Feature Request: Add support for Amazon Linux",
  "updated_at": "2018-04-26T13:26:20Z"
}