{
  "_url": "https://github.com/PowerShell/PowerShell/issues/3335",
  "author": "SRGOM",
  "body": "On #3249 @iSazonov helpfully pointed out that one can use \"crossgen\" to get binaries that run start up pretty fast. \r\nI explored and it looks like one cannot get such binaries from a powershell instance alone. Is my observation correct? (I'm not sure because technically if I have the CLR assembly and .NET core on my computer already so it looks like it may be possible).\r\n\r\nTo continue on that, I want to ask here how does one go about getting such binaries? \r\n\r\nCould somebody give steps for that, please?\r\n\r\n I'd like to know the following:\r\n\r\n1) Does it require installation of tools outside of powershell? I am currently using AppImage on arch. Quite a few power users use Arch so I would hope you guys would treat it on an equal footing as the sysadmin-favoured RH/Suse. Could you list the tools required? \r\n\r\n2) The generation procedure\r\n\r\nI am hoping that the answer of this question could later be documented into something useful for more people looking to do this.",
  "closed_at": "2017-03-16T12:21:13Z",
  "comments": [
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "The official releases are already crossgen'd.  You can build it yourself using `start-psbuild -crossgen` if you clone our repo and import the `build.psm1` module",
      "created_at": "2017-03-15T16:28:38Z",
      "updated_at": "2017-03-15T16:28:38Z"
    },
    {
      "author": "SRGOM",
      "author_association": "CONTRIBUTOR",
      "body": "@SteveL-MSFT I'm using the official build, the AppImage meant for Linux distros. I saw a speed difference of ~1.9s to ~1.5s in the latest build for powershell -c 'exit'. \r\n\r\nWhile that is great, would it be unreasonable to say it's still pretty slow? I've never used any other aot compiled binary before but I was hoping it would start much faster.",
      "created_at": "2017-03-15T17:28:37Z",
      "updated_at": "2017-03-15T17:28:37Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "Our targets have been 250ms for startup.  There is an open issue to improve startup perf for Beta1 https://github.com/PowerShell/PowerShell/issues/1954",
      "created_at": "2017-03-15T17:39:26Z",
      "updated_at": "2017-03-15T17:39:26Z"
    },
    {
      "author": "SRGOM",
      "author_association": "CONTRIBUTOR",
      "body": "@SteveL-MSFT Got it. Hope to see this soon. \r\n\r\nClosing this issue since distributed AppImage is already crossgen'd. ",
      "created_at": "2017-03-16T12:21:13Z",
      "updated_at": "2017-03-16T12:21:13Z"
    }
  ],
  "created_at": "2017-03-15T16:25:17Z",
  "number": 3335,
  "state": "closed",
  "title": "Question: How to create an ahead-of-time compiled native powershell (\"crossgen\")",
  "updated_at": "2017-03-16T13:12:28Z"
}