{
  "_url": "https://github.com/PowerShell/PowerShell/issues/3337",
  "author": "f0rt",
  "body": "Team,\r\n\r\nWe're using PS for automation on internal build system. When running PS on non-interactive mode we get error messages like this for cmdlets that are trying to prompt:\r\n\r\n> Exception calling \"ShouldContinue\" with \"2\" argument(s): \"Windows PowerShell is in NonInteractive mode. Read and Prompt functionality is not available.\r\n\r\nThis makes it very difficult to diagnose the problem on the internal build system. I guess printing the actual prompt message will resolve the issue for us.\r\n\r\nThanks,\r\nf0rt",
  "closed_at": "2017-03-16T21:39:20Z",
  "comments": [
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "The fix appears pretty simple to suppress this.  There's actually a bunch of code to explicitly support this.  Not clear if we should just remove the current ThrowOnReadAndPrompt code?  Doesn't seem like it provides value to have this exception.  ",
      "created_at": "2017-03-15T19:58:29Z",
      "updated_at": "2017-03-15T19:58:29Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "@PowerShell/powershell-committee needs more information on the specific repro to understand the scope of this issue and the best way to resolve.  Is the script explicitly trying to confirm?  Do you want the command to auto-confirm or just want a better error message?  Please include `expected` error message.  Thanks.",
      "created_at": "2017-03-15T23:18:33Z",
      "updated_at": "2017-03-15T23:18:33Z"
    },
    {
      "author": "f0rt",
      "author_association": "NONE",
      "body": "We get these messages when analyzing failed build logs. Here is a [recent example of the issue](https://github.com/PowerShell/PowerShellGet/issues/101). \r\n\r\n- The script is not trying to confirm explicitly since this is unexpected behavior. \r\n- We need **better error messages** to see what caused the prompt and how we should avoid it (pass -Confirm:$false/-Force in some cases or another workarounds as suggested in the example above)\r\n- Error message should contain: the cmdlet causing the prompt, location(script file, line), error message, suggested way to bypass it (especially when it's not obvious) . For example:\r\n\r\n> An exception occurred when running script \"test.ps1\"  on line 34. The cmdlet \"Register-PSRepository\" prompted \"< message >\". Prompts are not supported in non-interactive mode. You can avoid the prompt by < suggested fix >.\r\n\r\nThanks",
      "created_at": "2017-03-16T00:27:06Z",
      "updated_at": "2017-03-16T00:27:06Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "@PowerShell/powershell-committee it appears that powershell host is doing the right thing outputting an error message of something it can't support in `-noninteractive` mode along with the cmdlet trying to make the ShouldProcess call.  In this case, we should have a PSScriptAnalyzer rule to catch cmdlets that make explicit prompts without supporting `-force` and `-confirm`",
      "created_at": "2017-03-16T16:38:56Z",
      "updated_at": "2017-03-16T16:38:56Z"
    },
    {
      "author": "atruskie",
      "author_association": "NONE",
      "body": "Any chance of reconsidering this?\r\n\r\n\r\n\r\n- I ran into this issue while testing a script on my CI\r\n![image](https://user-images.githubusercontent.com/1452968/106241173-4be36980-6251-11eb-9997-1591cc32943f.png)\r\n- The error message ` Exception calling \"ShouldContinue\" with \"2\" argument(s): \"Object reference not set to an instance of an object.\"` provides no useful information\r\n- There are dozens of results that show up in an internet search which are all very misleading\r\n- Even after working out the issue, AFAIK there's no way to detect a non-interactive mode, If I could detect interactivity, then I could work around it or present a better experience to the script consumer (i.e. bailing early, suggesting they use `-Force` when non-interactive)\r\n- I don't believe a PSScriptAnalyzer is useful here - I have a `-Force` switch, but if a user forgets to use `-Force` then we're back at sqaure one",
      "created_at": "2021-01-29T06:48:54Z",
      "updated_at": "2021-01-29T06:52:34Z"
    }
  ],
  "created_at": "2017-03-15T18:29:41Z",
  "labels": [
    "WG-Interactive-Console",
    "Resolution-By Design",
    "Committee-Reviewed"
  ],
  "number": 3337,
  "state": "closed",
  "title": "PS non-interactive and confirmation messages",
  "updated_at": "2021-01-29T06:52:34Z"
}