{
  "_url": "https://github.com/PowerShell/PowerShell/issues/3468",
  "author": "skyguy94",
  "body": "The barrier to entry for configuring WinRM is very high for unfamiliar users and I don't think it needs to be that way. Its unclear to me why the WinRM service needs to be started on the client computer in order to configure client settings like trusted hosts. I'm convincing more of our developers to use pssessions/write remote scripts for managing remote instances instead of RDPing into them just to open a powershell window.\r\n\r\nFor someone new to ps-remoting and possible powershell, I have to get them to update their execution policy, with something like:\r\n`Set-ExecutionPolicy -ExecutionPolicy RemoteSigned -Scope LocalMachine` \r\n\r\nLike most devs, they'll google it while we are talking about it just to familiarize themselves. That goes pretty well usually as execution policies make sense.\r\n\r\nThen I want them to enable PS remoting, so we:\r\n```\r\nEnable-PSRemoting -Force\r\nSet-Item WSMAN:\\localhost\\Client\\TrustedHosts -value *\r\n```\r\nSince its a dev machine, '*' is a reasonable default. The problem is that `Enable-PSRemoting -Force` werids them out a bit, especially if you forget the `-Force` flag. You'll get a prompt like:\r\n\r\n```\r\nStart WinRM Service\r\nWinRM service is not started currently. Running this command will start the WinRM service.\r\n\r\nDo you want to continue?\r\n[Y] Yes  [N] No  [S] Suspend  [?] Help (default is \"Y\"):\r\n```\r\n\r\nWhich is a bit disconcerting as they wonder why they are starting a service. A quick bing search yeilds the msdn docs, which state:\r\n\r\n![image](https://cloud.githubusercontent.com/assets/181450/24557586/d1b27e42-15fd-11e7-9aa2-46efa185f23d.png)\r\n\r\nAnd at that point there's some pushback. I don't want people remoting into my box! What about security? etc.... \r\n\r\nSo, why do I need the winrm service to set a client setting. Why can't I just configure my client without it?\r\n\r\nIt gets even more difficult if we run into public/private adapter issues. Again, that can be explained away, but its not clear to me why I need to deal with this to set a client setting.",
  "closed_at": "2017-04-05T00:05:23Z",
  "comments": [
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "WinRM configuration (including client) is actually a WSMan invocation to a configuration plugin, so it has to go through the WinRM service.  If you really want this addressed, you'll have to open an issue on [UserVoice](https://windowsserver.uservoice.com/forums/295047-general-feedback) as it's not something we can change in PowerShell.\r\n\r\nAlternatively, my recommendation is to use PowerShell remoting over SSH which doesn't have this problem, although it does require you to install [OpenSSH](https://github.com/PowerShell/Win32-OpenSSH/releases) onto Windows machines",
      "created_at": "2017-03-31T17:29:00Z",
      "updated_at": "2017-03-31T17:29:00Z"
    },
    {
      "author": "skyguy94",
      "author_association": "NONE",
      "body": "Thanks for the response. We're definately interested in OpenSSH on our boxes, but that'll take some time to get migrated over to. I'll open a uservoice issue and see what comes of that.",
      "created_at": "2017-04-03T16:15:39Z",
      "updated_at": "2017-04-03T16:15:39Z"
    },
    {
      "author": "skyguy94",
      "author_association": "NONE",
      "body": "https://windowsserver.uservoice.com/forums/295047-general-feedback/suggestions/18814972-configure-the-winrm-client-without-starting-the-wi",
      "created_at": "2017-04-03T16:45:38Z",
      "updated_at": "2017-04-03T16:45:38Z"
    }
  ],
  "created_at": "2017-03-31T15:38:04Z",
  "number": 3468,
  "state": "closed",
  "title": "Configuring the WinRM client requires the WinRM server service.",
  "updated_at": "2017-04-05T00:05:23Z"
}