{
  "_url": "https://github.com/PowerShell/PowerShell/issues/3794",
  "author": "joeyaiello",
  "body": "This is intended to address the underlying issue behind #2566 by adding a note in `CONTRIBUTING.md` to create a corresponding pull request in PowerShell/PowerShell-Docs when making code changes that warrant it.\r\n\r\nIt's also going to take some enforcement from @PowerShell/powershell-maintainers, which I know will be difficult because our documentation isn't completely up-to-date--we're playing catch up here. However, it should be analogous to the test debt that we've had while enforcing requirements for new tests.\r\n\r\nI'm also not opposed to creating a label as well to track those PRs where doc changes are required but where they haven't been addressed. It's really up to the @PowerShell/powershell-maintainers here, I'm open to whatever. ",
  "closed_at": "2017-06-07T17:05:40Z",
  "comments": [
    {
      "author": "joeyaiello",
      "author_association": "CONTRIBUTOR",
      "body": "Also, I apologize for the formatting changes. I had to make them for the file to be maintainable (bulleted lists were busted the way they were). ",
      "created_at": "2017-05-16T22:51:07Z",
      "updated_at": "2017-05-16T22:51:07Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "@joeyaiello in the future, the best practice is style/formatting changes should be a separate PR otherwise it's hard to see what the actual functional change was\r\n\r\nwe should also change the PR template",
      "created_at": "2017-05-17T21:31:24Z",
      "updated_at": "2017-05-17T21:31:24Z"
    },
    {
      "author": "TravisEz13",
      "author_association": "MEMBER",
      "body": "#3805 for issues not introduced by this change",
      "created_at": "2017-05-18T00:36:33Z",
      "updated_at": "2017-05-18T00:36:33Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "@joeyaiello please add verbage to https://raw.githubusercontent.com/PowerShell/PowerShell/master/.github/PULL_REQUEST_TEMPLATE.md for the doc requirement",
      "created_at": "2017-05-18T21:58:42Z",
      "updated_at": "2017-05-18T21:58:42Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "It seems it is a wrong direction.\r\n\r\nDo you really think a community contributer want to spend time writing documentation?\r\nHow many community contributers you see? You want blocks community?\r\nMaybe you see the same process in CoreFX Repo?\r\n\r\nThe proposed process is ideal for obtaining a high-quality product in the enterprise but not in the community project.\r\nIf you want many feedbacks and contributions from community an contributer must be able to:\r\n1. Install dev environment as simple as three click.\r\n2. Get fast feedback on - Is the bug or new approved feature? Where is right place to fix?\r\n3. Get fast PR code review.\r\n\r\nI can not confidence say Yes for this points and now there's one more No for fourth point (docs). I may be wrong, but CoreFX Repo has a much quicker reaction.\r\n\r\nAs for me. Now @daxian-dbw @lzybkr @SteveL-MSFT spend a lot of time on me, and I hope they eventually get a profit. If I write docs, I'll spend a lot of time, and they'll waste more on fixing it. I believe the documentation should be written by professional docs writers.\r\nThe real benefit for the documentation will be from me only if I take part in reviewing the docs translation on Russion.\r\n\r\nI believe that the process of writing documentation should be _asynchronous_ rather than synchronous, should not be entrusted to code writers and should not block code PRs.\r\n\r\nMy vision of the process:\r\nMantainers:\r\n1. Request high quality Issue description with clear repo steps and code samples - it can be used in docs.\r\n2. Request high quality description in PRs: link to Issue if one exists, if no the Issue description should be done in the PR, a short and clear description of the fix or the enhancement  - the PR description is a main base for documentation.\r\n3. Mark the PR with Docs-Needed.\r\n\r\nIn this way, we will prepare a high-quality base for documenting without blocking and wasting time.\r\n\r\nDoc writer:\r\n4. Search PRs with Docs-Needed.\r\n5. Open new PR in Docs Repo with link on the code PR.\r\n6. Request review from original code PR author/code reviewers/Issue author.\r\n7. Request to change Docs-Needed with Docs-Fixed in original code PR.\r\n",
      "created_at": "2017-05-23T06:26:00Z",
      "updated_at": "2017-05-23T06:26:00Z"
    },
    {
      "author": "joeyaiello",
      "author_association": "CONTRIBUTOR",
      "body": "@iSazonov I hear you. If others agree, we can certainly go down the `documentation required` label route. ",
      "created_at": "2017-05-24T18:20:20Z",
      "updated_at": "2017-05-24T18:20:20Z"
    },
    {
      "author": "TravisEz13",
      "author_association": "MEMBER",
      "body": "I would prefer a more flexible approach that will be open to more contributors.",
      "created_at": "2017-05-24T18:39:47Z",
      "updated_at": "2017-05-24T18:39:47Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "I agree with what @iSazonov is saying.  Let's start with a `documentation required` label",
      "created_at": "2017-05-25T16:49:26Z",
      "updated_at": "2017-05-25T16:49:26Z"
    },
    {
      "author": "joeyaiello",
      "author_association": "CONTRIBUTOR",
      "body": "Okay, expect a Round 2 of this PR later this week. ",
      "created_at": "2017-05-30T18:12:17Z",
      "updated_at": "2017-05-30T18:12:17Z"
    },
    {
      "author": "joeyaiello",
      "author_association": "CONTRIBUTOR",
      "body": "Alright, updated to reflect the label approach in Steve's PR at #3908. Would appreciate another quick review. /cc @iSazonov @SteveL-MSFT ",
      "created_at": "2017-06-05T23:31:04Z",
      "updated_at": "2017-06-05T23:31:04Z"
    },
    {
      "author": "joeyaiello",
      "author_association": "CONTRIBUTOR",
      "body": "I'm okay without @HemantMahawar's review. If everything looks good, feel free to merge. ",
      "created_at": "2017-06-06T22:33:42Z",
      "updated_at": "2017-06-06T22:33:42Z"
    }
  ],
  "created_at": "2017-05-16T22:50:33Z",
  "number": 3794,
  "state": "closed",
  "title": "Add documentation requirements to CONTRIBUTING.md",
  "updated_at": "2017-06-07T17:39:37Z"
}