{
  "_url": "https://github.com/PowerShell/PowerShell/issues/386",
  "author": "andschwa",
  "body": "   triaged  Start Process makes bad assumptions     Should process arguments without error 110ms    Expected   1     But was    2     at line  34 in  home andrew monad linux src pester tests Start Process.Tests.ps1    34          $process.Length        Should Be 1     triaged  Get FileHash is no longer recognized as a cmdlet Running test 'Should default to correct hash algorithm' Processing             Should default to correct hash algorithm 119ms       The term 'Get FileHash' is not recognized as the name of a cmdlet, function, script file, or operable program. Check the spelling of the name, or if a path was included, verify that the path is correct and try again.       at line  13 in  home andrew monad linux src pester tests Get FileHash.Tests.ps1 Running test 'Should be able to set the default hash algorithm' Processing             Should be able to set the default hash algorithm 24ms       Exception calling  Add  with  2  argument s    The key 'Get FileHash Algorithm' has already been added to the dictionary.        at line  19 in  home andrew monad linux src pester tests Get FileHash.Tests.ps1 Running test 'Should list the path of the file under test' Processing             Should list the path of the file under test 34ms       The term 'Get FileHash' is not recognized as the name of a cmdlet, function, script file, or operable program. Check the spelling of the name, or if a path was included, verify that the path is correct and try again.       at line  29 in  home andrew monad linux src pester tests Get FileHash.Tests.ps1    Context Algorithm tests Running test 'Should be able to get the correct hash from each algorithm' Processing             Should be able to get the correct hash from each algorithm 78ms       The term 'Get FileHash' is not recognized as the name of a cmdlet, function, script file, or operable program. Check the spelling of the name, or if a path was included, verify that the path is correct and try again.       at line  40 in  home andrew monad linux src pester tests Get FileHash.Tests.ps1     triaged  Test Path   Could not find file ' usr bin dotnet new'. At  home andrew monad linux src pester tests Test Path.Tests.ps1 64 char 9           Test Path  Path   usr bin \\*   Include vi\\*   Should Be $true                                                           CategoryInfo            ReadError    usr bin String   Test Path , FileNotFoundException       FullyQualifiedErrorId   DirIOError,Microsoft.PowerShell.Commands.TestPathCommand     triaged  Describing Json.NET LINQ Parsing      Error occurred in Describe block 95ms    Exception calling  LoadFrom  with  1  argument s    Could not load file or assembly ' home andrew monad linux tools Newtonsoft.Json.7.0.1 lib portable net45 wp80 win8 wpa81 dnxcore50 Newtonsoft.Json.dll' or one of its dependencies. The system cannot find the file specified.     At  home andrew monad linux src pester tests Json.Tests.ps1 12 char 5     triaged  Get TypeData is broken Running test 'Should return an array of several elements when no arguments are used' Processing          Should return an array of several elements when no arguments are used 13ms    Expected  0  to be greater than  1     at line  9 in  home andrew monad linux src pester tests Get TypeData.Tests.ps1    9          $output.Length   Should BeGreaterThan 1 Running test 'Should be able to take wildcard input' Processing          Should be able to take wildcard input 14ms    Expected  0  to be greater than  1     at line  15 in  home andrew monad linux src pester tests Get TypeData.Tests.ps1    15          $output.Length   Should BeGreaterThan 1     triaged  Should verify Wait Event is waiting for at least a second 70ms       Expected  0  to be greater than  0        at line  6 in  home andrew monad linux src pester tests Wait Event.Tests.ps1       6              $waiteventtime.Seconds   Should BeGreaterThan 0     triaged  ExecutionPolicy calls RegOpenKey Should return Microsoft.Powershell.ExecutionPolicy PSObject 90ms       Unable to find an entry point named 'RegOpenKeyExW' in DLL 'api ms win core registry l1 1 0.dll'.       at line  6 in  home andrew monad linux src pester tests Get ExecutionPolicy.Tests.ps1     triaged  Mode Flags are broken Should have mode flags set 23ms    Expected  value to not be empty    at line  20 in  home andrew monad linux src pester tests Get Item.Tests.ps1      VSO create date - 12/17/2015 11:59:00     VSO closed date - 12/18/2015 17:36:00     \n",
  "closed_at": "2016-01-22T20:44:34Z",
  "comments": [],
  "created_at": "2016-01-22T20:44:34Z",
  "number": 386,
  "state": "closed",
  "title": "Investigate failing Pester tests with updated PowerShell and build system",
  "updated_at": "2016-01-22T20:44:34Z"
}