{
  "_url": "https://github.com/PowerShell/PowerShell/issues/3872",
  "author": "SteveL-MSFT",
  "body": "On Mac, when the httplistener is stopped, it takes time for the system to clean it up.  It also appears that on Mac, http reservation\r\n\r\nis at the port and not the URL.  Fix is to have the two different httplisteners use different ports.  Otherwise due to a race condition\r\nthe second listener tries to start on the same port as the previous one that stopped but isn't cleaned up yet by the system so fails.\r\n\r\n<!--\r\n\r\nIf you are a PowerShell Team member, please make sure you choose the Reviewer(s) and Assignee for your PR.\r\nIf you are not from the PowerShell Team, you can leave the fields blank and the Maintainers will choose them for you. If you are familiar with the team, feel free to mention some Reviewers yourself.\r\n\r\nFor more information about the roles of Reviewer and Assignee, refer to CONTRIBUTING.md.\r\n\r\n-->",
  "closed_at": "2017-05-31T22:56:33Z",
  "comments": [
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "Can we reuse first created httplistener? Can we create it at helper module load time and reuse in all tests?",
      "created_at": "2017-05-27T15:59:10Z",
      "updated_at": "2017-05-27T15:59:34Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "The Webcmdlets tests have two Describe blocks, so it's probably not a good practice to start one at the beginning of the script and cleanup at the end outside of Pester.  Having a global one means someone has to cleanup still.  ",
      "created_at": "2017-05-27T21:45:52Z",
      "updated_at": "2017-05-27T21:45:52Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "And if we were to use a full web server for the tests,  did we worry about it?",
      "created_at": "2017-05-28T16:30:31Z",
      "updated_at": "2017-05-28T16:30:31Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "@iSazonov the problem was installing a full web server for different platforms and the corresponding different code if we end up using, for example, IIS on Windows, and Apache on Linux.",
      "created_at": "2017-05-28T22:08:34Z",
      "updated_at": "2017-05-28T22:08:34Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "Sorry for the inaccuracy. I wanted to compare the variants of a httplistener and a http server. If we had a server installed on all platforms, we wouldn't be worried about cleaning it up. The same is true for a httplistener - we download it on demand in the module and use it in more than one test. Now we have to use the new port for each new test which can cause problems.",
      "created_at": "2017-05-29T03:15:17Z",
      "updated_at": "2017-05-29T03:15:17Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "@iSazonov this would probably be less of a problem if we split the webcmdlets tests into separate scripts for invoke-webrequest and invoke-restmethod although there is still a chance that after one finishes and stops the listener, the OS may not have cleaned up the endpoint before the next one starts and tries to create it on the same port",
      "created_at": "2017-05-30T16:18:01Z",
      "updated_at": "2017-05-30T16:18:01Z"
    }
  ],
  "created_at": "2017-05-27T02:31:01Z",
  "number": 3872,
  "state": "closed",
  "title": "Use different HttpListener for Invoke-WebRequest and Invoke-RestMethod tests",
  "updated_at": "2017-06-01T04:53:12Z"
}