{
  "_url": "https://github.com/PowerShell/PowerShell/issues/3889",
  "author": "guillemsola",
  "body": "This is about ssh into an ubuntu machine and launching a powershell console. I can use putty where there is some jitter but not very disturbing. Also if I use git bash console standalone it can be used. Pretty much the same if I use a linux real linux console. There are some weird console behavior but not a big deal. But mixing git bash in a ConEmu console is a nightmare.\r\n\r\nI know that you may argue that this is not a powershell issue but I assume that the current implementation of powershell in linux can do this much better as other shells are not having this kind of visualitzation and usability issues. At least there may be some supported consoles list and warnings.\r\n\r\nSteps to reproduce\r\n------------------\r\n\r\nssh to an ubuntu machine and open powershell using a Git Bash console in ConEmu.\r\n\r\nExpected behavior\r\n-----------------\r\n\r\nYou can type as usual\r\n\r\nActual behavior\r\n---------------\r\n\r\nWeird jitter that makes powershell completely unusable. Some characters are lost and each time you type a character a jump line is produced.\r\n\r\n\r\nEnvironment data\r\n----------------\r\n\r\n```powershell\r\nPS /home/vmadmin> $PSVersionTable\r\n\r\nName                           Value\r\n----                           -----\r\nPSVersion                      6.0.0-beta\r\nPSEdition                      Core\r\nBuildVersion                   3.0.0.0\r\nCLRVersion\r\nGitCommitId                    v6.0.0-beta.1\r\nOS                             Linux 4.4.0-78-generic #99-Ubuntu SMP Thu Apr...\r\nPlatform                       Unix\r\nPSCompatibleVersions           {1.0, 2.0, 3.0, 4.0...}\r\nPSRemotingProtocolVersion      2.3\r\nSerializationVersion           1.1.0.1\r\nWSManStackVersion              3.0\r\n```\r\nConEmu 170402 with Git Bash 2.12.2.1",
  "closed_at": null,
  "comments": [
    {
      "author": "joeyaiello",
      "author_association": "CONTRIBUTOR",
      "body": "Sorry, I don't totally understand your workflow here. Let me see if I got this right:\r\n\r\n* Open ConEmu\r\n* Open Git Bash\r\n* Attach to -> (currently running) git-bash.exe\r\n* /usr/bin/ssh \\<user\\>@\\<Linux host\\>\r\n* land in Bash on \\<Linux host\\>\r\n* Start PowerShell: `$ powershell`\r\n\r\nRight now, this workflow works fine for me against a CentOS 7 machine (though I'm on an older version of Git Bash, looks like 2.11.0.3). I could update and try to repro if you like. \r\n\r\nOr I'm getting the workflow wrong, in which case you should let me know. ",
      "created_at": "2017-05-30T22:38:00Z",
      "updated_at": "2017-06-01T17:56:17Z"
    },
    {
      "author": "guillemsola",
      "author_association": "NONE",
      "body": "Hi,\r\n\r\nI can confirm that your flow also works for me, sorry for not being enough accurate.\r\n\r\nWhat is really causing issues is using the ```sh.exe```  or even ```bash.exe``` inside the git for windows bin folder. I was launching them from ConEmu (not attaching them once running) as this is the [recommended way](https://blog.tyrsius.com/setting-up-conemu-with-git-bash-on-windows/). Using those shells you can reproduce this behavior removing ConEmu from the equation.\r\n\r\n```\r\n    Directory: C:\\Program Files\\Git\\bin\r\n\r\nMode                LastWriteTime         Length Name\r\n----                -------------         ------ ----\r\n-a----       27/03/2017     18:17          43240 bash.exe\r\n-a----       27/03/2017     18:17          42728 git.exe\r\n-a----       27/03/2017     18:17          43240 sh.exe\r\n```\r\n",
      "created_at": "2017-05-31T10:09:08Z",
      "updated_at": "2017-05-31T10:09:08Z"
    },
    {
      "author": "joeyaiello",
      "author_association": "CONTRIBUTOR",
      "body": "Okay, so I now I'm doing this:\r\n\r\n* open ConEmu\r\n* navigate to ProgFiles/Git/bin\r\n* `bash.exe`\r\n* /usr/bin/ssh FooUser@FooLinuxHost\r\n\r\nAt this point everything hangs really badly (right after putting in my password), and we haven't touched any PowerShell code yet. In fact, I can't even launch PowerShell because so many characters get swallowed and jumbled around (it seems like every other character is getting swallowed).\r\n\r\nHave you tried using our native port of OpenSSH as a client over at https://github.com/powershell/Win32-OpenSSH? We're completely eschewing all these MinGW hacks over there, and when I try it from ConEmu everything works great. \r\n\r\n",
      "created_at": "2017-06-01T18:00:30Z",
      "updated_at": "2017-06-01T18:00:54Z"
    },
    {
      "author": "guillemsola",
      "author_association": "NONE",
      "body": "Hi,\r\n\r\nIn ConEmu you configure your shells [this way](https://blog.tyrsius.com/setting-up-conemu-with-git-bash-on-windows/) in the Settings > Tasks tabs.\r\n\r\nThis is the recommended way to execute consoles.\r\n\r\nBTW I have tried your native port and it happens the same. This is a copy paste when I try to do a dir\r\n\r\n```powershell\r\nPS /home/vmadmin> PS /home/vmadmin> d\r\n                  PS /home/vmadmin> di\r\n                  PS /home/vmadmin> dir\r\n```\r\n\r\nFYI I'm using an ubuntu 16.04 machine from an azure template where I installed ps yesterday.",
      "created_at": "2017-06-01T21:22:15Z",
      "updated_at": "2017-06-01T21:22:15Z"
    },
    {
      "author": "joeyaiello",
      "author_association": "CONTRIBUTOR",
      "body": "I had to modify those instructions a bit--no `git.ico` on my install, and for some reason the SysWow64 path \"couldn't be found\" so I just used system32--but I still am broken just trying to do plain old SSH remoting into my CentOS 7 box with cmd ==SSH==> Bash. I'm only getting (roughly) every other key input. \r\n\r\nI'm gonna try updating....",
      "created_at": "2017-06-06T18:50:00Z",
      "updated_at": "2017-06-06T18:50:00Z"
    },
    {
      "author": "joeyaiello",
      "author_association": "CONTRIBUTOR",
      "body": "Upon updating, it's dawning on me that there's a vast amount of install-time options that could be affecting our different experiences. (E.g. do you place all of Git Bash on the system PATH?)",
      "created_at": "2017-06-06T18:53:21Z",
      "updated_at": "2017-06-06T18:53:21Z"
    },
    {
      "author": "joeyaiello",
      "author_association": "CONTRIBUTOR",
      "body": "Okay, after updating ConEmu and Git for Windows, the task I created won't even render characters until I hit Enter... \r\n\r\nWhen I install I do:\r\n* Use Git from the Windows Command Prompt\r\n* Use the native Windows Secure Channel library (not the default)\r\n* Use Windows' default console window (also not the standard, this might be the culprit here)\r\n* Enable file system caching, Git Cred Manager, and symbolic links (the last is non-default) \r\n",
      "created_at": "2017-06-06T18:59:46Z",
      "updated_at": "2017-06-06T18:59:46Z"
    },
    {
      "author": "guillemsola",
      "author_association": "NONE",
      "body": "Hi Joey and thanks for your time.\r\n\r\nIMO I would keep this rendering issue with the default Git Bash installation with the next, next, next install for windows. Then opening the sh shell and doing ssh into a linux machine. Finally open PS and experience some character jitter.\r\n\r\nLeaving ConEmu outside the equation may help to reproduce this and perhaps give some information about what the PS linux is doing so that anyone can help to improve.\r\n",
      "created_at": "2017-06-06T20:24:06Z",
      "updated_at": "2017-06-06T20:24:06Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "@joeyaiello @SteveL-MSFT Can we close the old issue?",
      "created_at": "2020-02-01T15:20:39Z",
      "updated_at": "2020-02-01T15:20:39Z"
    }
  ],
  "created_at": "2017-05-30T22:00:21Z",
  "number": 3889,
  "state": "open",
  "title": "Console unusable on ConEmu with bash",
  "updated_at": "2020-02-01T15:20:39Z"
}