{
  "_url": "https://github.com/PowerShell/PowerShell/issues/3990",
  "author": "mklement0",
  "body": "https://technet.microsoft.com/en-us/library/ms714428(v=vs.85).aspx states (emphasis added):\r\n\r\n> The **Invoke** verb is used to perform an operation that is generally a **synchronous** operation, such as running a command. The **Start** verb is used to begin an operation that is generally an **asynchronous** operation, such as starting a process.\r\n\r\nTherefore, `Start-Sleep`, which is _synchronous_, should be called `Invoke-Sleep`.\r\n\r\nIt's probably too late to change this, but:\r\n\r\n* perhaps an `Invoke-Sleep` _alias_ could be defined.\r\n\r\n* either way, the inconsistency should be _documented_.\r\n\r\n",
  "closed_at": "2019-06-24T15:25:53Z",
  "comments": [
    {
      "author": "kilasuit",
      "author_association": "COLLABORATOR",
      "body": "I genuinely see no benefit of making this change other than semantics ",
      "created_at": "2019-06-03T16:30:04Z",
      "updated_at": "2019-06-03T16:30:04Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "That may be, but internal semantic consistency is valuable in and of itself, in my opinion. If the PS team isn't naming things according to their own rules, it becomes more acceptable to mis-name things in wider use. Lead by example, and all that.\r\n\r\nI'd be in favor of adding an alias for it, at least, if not switching out the cmdlet name and providing an alias under the old name. 🤷‍♂ ",
      "created_at": "2019-06-03T16:37:08Z",
      "updated_at": "2019-06-03T16:37:08Z"
    },
    {
      "author": "rkeithhill",
      "author_association": "COLLABORATOR",
      "body": "I agree with @kilasuit.  That horse has left the barn and introducing an alias would only serve to confuse folks IMO.  \r\n\r\nWhen it comes to language design, you have to walk a line between complete status quo and \"gilding the lily\".  This feels more like the latter.  \r\n\r\nI like Ander's approach with C# where every new features starts out with a score of -100 and has to demonstrate enough value to at least get past break-even before it is even seriously considered.  ",
      "created_at": "2019-06-03T19:45:12Z",
      "updated_at": "2019-06-03T19:45:30Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "I don't disagree @rkeithhill but I do think there's a bit of a \"cost difference\" as it were between \"a feature\" and \"the name of a feature\". 🙂 ",
      "created_at": "2019-06-03T19:52:12Z",
      "updated_at": "2019-06-03T19:52:12Z"
    },
    {
      "author": "mklement0",
      "author_association": "CONTRIBUTOR",
      "body": "(This comment originally contained a misguided attempt at satire by me. Since it contributed nothing to the discussion, I've redacted it.)",
      "created_at": "2019-06-24T01:20:38Z",
      "updated_at": "2019-06-24T22:25:16Z"
    },
    {
      "author": "SeeminglyScience",
      "author_association": "COLLABORATOR",
      "body": "I'm all for the inconsistency being documented.\r\n\r\nThat said, changing the name of the cmdlet has a minor potential to break, even if a compatibility alias added.  Anything specifically looking for a *cmdlet* named `Start-Sleep` (like a proxy command) would no longer work.  Adding an alias `Invoke-Sleep` has a pretty high possibility of hijacking any custom `Invoke-Sleep` functions.  Generally speaking the risks are pretty low, but I don't think they outweigh the gain.",
      "created_at": "2019-06-24T12:26:07Z",
      "updated_at": "2019-06-25T13:03:25Z"
    },
    {
      "author": "kilasuit",
      "author_association": "COLLABORATOR",
      "body": "@mklement0 I don't know why you felt the need to be so abrasive and rude but here's the extended reason why this change makes no sense to me, not that I felt to those like yourself that has knowledge of the codebase needed it extended to the full reason.\r\n\r\n`Start-Process` a command that quite rightly pointed out the verb `Start` is **generally** used for an asynchronous command, has the `-Wait` parameter which changes the dynamic to a synchronous command.\r\n`Invoke-Command` a command that quite rightly pointed out the verb `Invoke` is **generally** used for a synchronous command, has the `-AsJob` parameter which changes the dynamic to be an asynchronous command.\r\n\r\nNow if both `Invoke` & `Sleep` verbs missed out the `generally` & both these commands didn't have Parameters that change their synchronous nature then you would be 100% correct in that it would be semantically correct to be `Invoke-Sleep` and not `Start-Sleep`, however as both verbs allow flexibility in both options of synchronicity I feel that your ask is of such little value that it's not worth the change. Also you have to consider that you would never say that as a person I am going to go an invoke sleep when you go to bed, it would be that you go and try to start to sleep.\r\n\r\nThis would be a change for the sake of change with actually almost no benefit bar being entirely pedantic in nature and actually would lead to confusion. Which is why I made my original comment, one I still stand by considering I've been not just a user but also a trainer of PowerShell and every user who I've come across who looks at the cmdlet just by name understands what it does and those that may be unsure can always read the help for `Start-Sleep` & they would understand what `Start-Sleep` does by the Description from the help that states\r\n```\r\nThe Start-Sleep cmdlet suspends the activity in a script or session for the specified period of time. You can use it for many tasks, such as waiting for an operation to complete or pausing before repeating an operation\r\n```\r\n\r\nSo yeah, to wrap up I can't see **any real** benefit from making this change",
      "created_at": "2019-06-24T14:06:32Z",
      "updated_at": "2019-06-24T14:06:32Z"
    },
    {
      "author": "mklement0",
      "author_association": "CONTRIBUTOR",
      "body": "My sincere apologies, @kilasuit: Being abrasive and rude was truly not my intent; I was hoping to inject some levity, but clearly failed - and I can now see why.\r\n\r\nI see both sides of the debate, and @SeeminglyScience has a point about potentially breaking things.\r\n\r\nAs for the semantics:\r\n\r\n`Start-Sleep` is _invariably_ synchronous. \r\n\r\nFor cmdlets that optionally allow changing the \"synchronicity\" of the behavior, such as `Start-Process` and `Invoke-Command`, the sensible approach is to name them for their _default_ behavior - which the latter two cmdlets got right.\r\n\r\n> This would be a change for the sake of change\r\n\r\nNo, it would be a change that makes the PowerShell ecosystem more consistent - _in the long run_, for _future_ learners of PowerShell.\r\n\r\nI don't know how many people never noticed / will never notice the inconsistency, but I assure you there are ones that do and will.\r\n\r\nThat said, perhaps it sufficient to follow @SeeminglyScience's advice:\r\n\r\n> I'm all for the inconsistency being documented.\r\n\r\nSo, to bring this to a close:\r\n\r\n* I'm closing this issue.\r\n\r\n* I've created https://github.com/MicrosoftDocs/PowerShell-Docs/issues/4474, which asks that a note be added to the `Start-Sleep` help topic.\r\n\r\n\r\n\r\n\r\n",
      "created_at": "2019-06-24T15:25:53Z",
      "updated_at": "2019-06-24T15:25:53Z"
    }
  ],
  "created_at": "2017-06-12T02:21:05Z",
  "number": 3990,
  "state": "closed",
  "title": "Start-Sleep cmdlet is misnamed; should be Invoke-Sleep",
  "updated_at": "2019-06-28T13:14:55Z"
}