{
  "_url": "https://github.com/PowerShell/PowerShell/issues/4016",
  "author": "JohnLudlow",
  "body": "In PowerShell it's possible to use a .psd1 file to provide data to a cmdlet. DSC does this for example with its configuration data.\r\n\r\nWe are developing a module which deals with environment preparation and configuration. It takes a configuration file (.psd1) which contains the required information about the environment.\r\n\r\nThis could be quite a bit of information so we do plan to use plenty of documentation to tell the users what the file should look like and runtime validation to point out errors. However, it struck me that it would be a nice idea to be able to apply a schema in a similar fashion to XML and JSON schemas. If an editor understands the schema, then it can show intellisense and flag errors. \r\n\r\nAnd it also means that the cmdlet can check for errors by running the schema validation and give consistent errors.\r\n\r\nJSON schemas work by adding a $id to the root element which specifies a schema URI.",
  "closed_at": null,
  "comments": [
    {
      "author": "JohnLudlow",
      "author_association": "NONE",
      "body": "Realised this is already open in other channels \r\n\r\nhttps://windowsserver.uservoice.com/forums/301869-powershell/suggestions/13585962-provide-intellisense-template-for-manifests\r\n\r\nhttps://github.com/PowerShell/vscode-powershell/issues/159\r\n\r\nHowever, I couldn't find one in this repo and this seems like the place for it...",
      "created_at": "2017-06-15T13:21:39Z",
      "updated_at": "2017-06-15T13:21:39Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "The direction we're heading is to support DSLs (Domain Specific Langauges) in PowerShell.  This way they become first class citizens with validation and intellisense support.  This is targeted for 6.1.0, however.",
      "created_at": "2017-06-15T18:17:11Z",
      "updated_at": "2017-06-15T18:17:11Z"
    },
    {
      "author": "JohnLudlow",
      "author_association": "NONE",
      "body": "@SteveL-MSFT Sorry for the delay in reply. \r\n\r\nThat's good news. Now, when you say it will be in 6.1.0, 6.x is PowerShell Core, and WMF will be 5.x forever, right? Will PowerShell Core become standard on Windows, or will this feature be ported into a WMF 5.x branch?\r\n\r\nThanks",
      "created_at": "2017-06-20T15:17:34Z",
      "updated_at": "2017-06-20T15:17:34Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "@JohnLudlow current plan is to not port any features to Windows PowerShell 5.x and to make PSCore6 a suitable replacement for Windows PowerShell.  At this time, we don't have a plan to ship PSCore6 in-box (presumably side-by-side with 5.x for compat reasons rather than replacing), although this is something we'll have to resolve as we get closer to PSCore6 GA (General Availability, aka, the new RTM).",
      "created_at": "2017-06-20T16:55:21Z",
      "updated_at": "2017-06-20T16:55:21Z"
    },
    {
      "author": "JohnLudlow",
      "author_association": "NONE",
      "body": "Ok, thanks for the clarification - some earlier communication on that was a little confusing.\r\n\r\nLooking forward to PSCore6 being GA 👍 ",
      "created_at": "2017-06-21T12:00:08Z",
      "updated_at": "2017-06-21T12:00:08Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "I plan to have a blog post in the near future (let's say in July sometime) that discusses our plan to get to a release candidate and relationship with Windows PowerShell 5.x",
      "created_at": "2017-06-21T16:08:01Z",
      "updated_at": "2017-06-21T16:08:01Z"
    },
    {
      "author": "travisclagrone",
      "author_association": "NONE",
      "body": "Any progress on this issue?",
      "created_at": "2019-06-06T04:14:53Z",
      "updated_at": "2019-06-06T04:14:53Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "@travis-c-lagrone sorry, no progress on this specific issue",
      "created_at": "2019-07-05T21:44:50Z",
      "updated_at": "2019-07-05T21:44:50Z"
    }
  ],
  "created_at": "2017-06-15T13:03:38Z",
  "labels": [
    "Issue-Enhancement",
    "WG-Language"
  ],
  "number": 4016,
  "state": "open",
  "title": "Suggestion: Allow a .psd1 to have a schema so that validation and intellisense can be done",
  "updated_at": "2022-02-17T18:25:38Z"
}