{
  "_url": "https://github.com/PowerShell/PowerShell/issues/4205",
  "author": "bergmeister",
  "body": "To help fixing #3791 \r\nFixes a few hundred warnings of type PSPossibleIncorrectComparisonWithNull, PSAvoidUsingCmdletAliases (mostly for ForEach-Object, Where-Object, Select-Object) and some PSUseDeclaredVarsMoreThanAssignment warnings.\r\nAs part of this, it was also found that a test in ParameterBindingTests needed improvement because since the null comparison is now correct, the test failed initially.",
  "closed_at": "2017-07-11T03:26:36Z",
  "comments": [
    {
      "author": "msftclas",
      "author_association": "NONE",
      "body": "\r\n@bergmeister,\nThanks for having already signed the Contribution License Agreement. Your agreement has not been validated yet. We will now review your pull request.\n_Thanks,\nMicrosoft Pull Request Bot_",
      "created_at": "2017-07-09T22:05:47Z",
      "updated_at": "2017-07-09T22:05:47Z"
    },
    {
      "author": "bergmeister",
      "author_association": "CONTRIBUTOR",
      "body": "Thanks @iSazonov for taking such a detailed look and spotting the accidental mistakes that I made when going through the hundreds of refactorings. I have followed all your suggestions and submitted the fix as you can see above. The total number of warnings seems to have gone down by about 350.",
      "created_at": "2017-07-10T07:02:51Z",
      "updated_at": "2017-07-10T07:02:51Z"
    },
    {
      "author": "lzybkr",
      "author_association": "MEMBER",
      "body": "I'm seeing different sorts of changes in a single commit - and with this many changes, it would be easier to review and safer to keep each refactoring as a single commit.",
      "created_at": "2017-07-10T15:29:54Z",
      "updated_at": "2017-07-10T15:30:19Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "+1 for multiple commits. Maybe:\r\n1. Build.psm1\r\n2. Rest tool scripts\r\n3. Test scripts\r\n4. Rest files.",
      "created_at": "2017-07-10T17:11:07Z",
      "updated_at": "2017-07-10T17:11:07Z"
    },
    {
      "author": "bergmeister",
      "author_association": "CONTRIBUTOR",
      "body": "@iSazonov I have fixed your requested changes about the fine-tuning of the spacing. When I started out doing that, I initially wanted to fix only most PSPossibleIncorrectComparisonWithNull violations but then I came across lots of other things to be improved like e.g. the aliases. Because the contribution guide [here](https://github.com/PowerShell/PowerShell/blob/master/.github/CONTRIBUTING.md#lifecycle-of-a-pull-request) recommended to have just one commit per change, I thought I'd try to put it all into one commit for the pull request. I am not sure how one would change the  commit history now that the commits are already pushed to the remote. Sorry, maybe I should have rather checked with you before.",
      "created_at": "2017-07-10T18:01:52Z",
      "updated_at": "2017-07-10T18:01:52Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": " You would rebase and split - see https://stackoverflow.com/questions/6217156/break-a-previous-commit-into-multiple-commits\r\nYou already fixed most typos so we can rebase to save maintainer's time.",
      "created_at": "2017-07-10T18:06:57Z",
      "updated_at": "2017-07-10T18:09:43Z"
    },
    {
      "author": "bergmeister",
      "author_association": "CONTRIBUTOR",
      "body": "@iSazonov OK, thanks. I did not feel confident/adventurous enough to rebase commits that are already pushed to the remote, so I have created a new branch, pulled in my commit changes and made then the 4 separate commits as requested by you. I have created the new PR #4213 for that, so feel free to close this one. Sorry, if this PR turned out to be messier than initially anticipated. I hope you are satisfied with this cleaner version now and I could try to help improve your codebase a bit.",
      "created_at": "2017-07-10T22:05:40Z",
      "updated_at": "2017-07-10T22:10:38Z"
    }
  ],
  "created_at": "2017-07-09T22:05:42Z",
  "number": 4205,
  "state": "closed",
  "title": "Fix PSScriptAnalyzer warnings",
  "updated_at": "2017-07-11T03:26:36Z"
}