{
  "_url": "https://github.com/PowerShell/PowerShell/issues/4620",
  "author": "markekraus",
  "body": "Addresss #4609 and corrects `Pending` tests from #4546\r\n\r\nThis test uses an ASP.NET Core 2.0 app in a docker container to run a simple service to echo back the client certificate details if one was provided. If a client cert is not provided, the details are empty and the status reports `FAILED`. Since this test will be slow in the CI's I have use a separate `Describe` block and included the `Feature` and `Slow` tags.",
  "closed_at": "2017-08-19T20:20:01Z",
  "comments": [
    {
      "author": "msftclas",
      "author_association": "NONE",
      "body": "\r\n@markekraus,\nThanks for having already signed the Contribution License Agreement. Your agreement was validated by Microsoft. We will now review your pull request.\n_Thanks,\nMicrosoft Pull Request Bot_",
      "created_at": "2017-08-19T18:57:57Z",
      "updated_at": "2017-08-19T18:57:57Z"
    },
    {
      "author": "markekraus",
      "author_association": "CONTRIBUTOR",
      "body": "I think  different approach will be needed. After looking at the Travis CI failures and reading the documentation, [Docker is not supported on OS X](https://docs.travis-ci.com/user/docker/).\r\n\r\nI'm going to close this pull request and think of a new plan of attack.",
      "created_at": "2017-08-19T20:20:01Z",
      "updated_at": "2017-08-19T20:20:01Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "Thank you so much for your efforts!\r\n\r\nPerhaps we should still use servers that are supported by CIs internally.",
      "created_at": "2017-08-19T21:14:47Z",
      "updated_at": "2017-08-19T21:14:47Z"
    },
    {
      "author": "markekraus",
      "author_association": "CONTRIBUTOR",
      "body": "@iSazonov I'm considering using the aspnetcore project without docker as the baked in Kestrel server is available cross-platform. Making the tests CI specific couples them with the CI and then breaks when the CI environment changes. The only problem with the aspnetcore approach is that the test will now be coupled with the dotnet SDK, probably not a huge deal as moving to the next major version would entail other code and testing reworks. I welcome your input on it in #4609.",
      "created_at": "2017-08-19T21:48:15Z",
      "updated_at": "2017-08-19T21:48:15Z"
    }
  ],
  "created_at": "2017-08-19T18:57:52Z",
  "number": 4620,
  "state": "closed",
  "title": "[Feature] Add Tests for Web Cmdlet Certificate Authentication",
  "updated_at": "2017-08-19T21:48:15Z"
}