{
  "_url": "https://github.com/PowerShell/PowerShell/issues/4700",
  "author": "SteveL-MSFT",
  "body": "Apple calls it macOS, we should be consistent (our documentation is mostly consistent I think, but we have $IsOSX which makes it inconsistent.  I propose we make this breaking change now otherwise never.\r\n",
  "closed_at": "2017-09-07T17:34:41Z",
  "comments": [
    {
      "author": "mklement0",
      "author_association": "CONTRIBUTOR",
      "body": "While the name change is a great idea (\"Call me $IsmacOS\" sounds much more familiar... (jk)), can I suggest revisiting the polluting-the-user-variable-namespace issue?\r\n\r\n`$PSEdition` is already in Windows PowerShell, but the `$Is*` variables aren't:\r\n\r\nCreating a separate namespace for PS-controlled variables would solve the problem of name collisions once and for all - see https://github.com/PowerShell/PowerShell/issues/4394#issuecomment-322212340\r\n\r\n`$ps:IsWindows`, ... is only slightly more verbose, and, on the plus side, once you type `$ps:`, IntelliSense could then helpfully limit the choices to the PS-controlled variable names.\r\n\r\n",
      "created_at": "2017-08-30T00:07:45Z",
      "updated_at": "2017-08-30T00:07:45Z"
    },
    {
      "author": "thezim",
      "author_association": "CONTRIBUTOR",
      "body": "$IsDarwin? It would cover any Apple operating system current and future.",
      "created_at": "2017-08-30T00:55:43Z",
      "updated_at": "2017-08-30T00:55:43Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "@mklement0 perhaps if we're willing to make this breaking change, we should consider adding the prefix at the same time",
      "created_at": "2017-08-30T02:42:38Z",
      "updated_at": "2017-08-30T02:42:47Z"
    },
    {
      "author": "markekraus",
      "author_association": "CONTRIBUTOR",
      "body": "I agree with the name change, but I'm thinking `IsMacOS` is better. I see other languages have implemented `isMacOS` in camelCase. IMO, `IsMacOS` is the Pascal Case equivalent. Lower cased branding doesn't have to remain.\r\n\r\nI also agree with @mklement0 that creating the `ps:` variable scope and moving it there would be best.",
      "created_at": "2017-08-30T14:26:00Z",
      "updated_at": "2017-08-30T14:27:00Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "@PowerShell/powershell-committee discussed this weighing different pros and cons.  I think where we ended up is that for these specific variables, we'll stick with $IsWindows, $IsLinux, and $IsMacOS (staying with Pascal casing for consistency).  Authoring a PSProvider is not a small effort and doesn't seem to provide enough value for discovery purposes and adding a new variable scope would break existing variable scope semantics.\r\n\r\nTL;DR we'll just rename to $IsMacOS\r\n\r\nFor the general interop issue, we'll defer that to the RFC and don't believe these variables conflict with that resolution.",
      "created_at": "2017-08-30T23:24:18Z",
      "updated_at": "2017-08-30T23:24:18Z"
    },
    {
      "author": "mklement0",
      "author_association": "CONTRIBUTOR",
      "body": "@SteveL-MSFT: \r\n\r\nUnderstood.\r\n\r\n> the general interop issue\r\n\r\nTo be clear, the idea of a `$ps:` namespace/scope is about _more_ than just interop: it's about _all PowerShell-controlled variables_, which fall into the following categories:\r\n\r\n* interop variables: platform abstractions, such as the variable discussed here and a variable pointing to the platform-appropriate folder for temporary files.\r\n\r\n* automatic, typically read-only variables: e.g., `$PID`, `$Host`, and `$Matches`\r\n\r\n* preference variables: e.g., `$ErrorActionPreference` and `$OFS`\r\n\r\nRepresenting each of these categories in its own namespace/scope is an option, but may be overkill (and more cumbersome to type).\r\n\r\nI know we've discussed such an RFC, but I don't think it exists yet, does it?",
      "created_at": "2017-08-31T02:21:11Z",
      "updated_at": "2017-08-31T02:21:11Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "I believe @joeyaiello was supposed to author that RFC we keep referencing...\r\n\r\nOne thing we discussed that was't captured in the summary is that a $ps: namespace would make sense for variables that affect powershell behavior (like the preference variables), but that would be a much bigger breaking change to move all the existing ones into that namespace and it doesn't seem beneficial enough (consider all the existing sample scripts on the internet).  Similar argument for the automatic variables.\r\n\r\nFor other domains like interop which is new and thus not a breaking change, we may introduce a namespace for the TMP, USERPROFILE, etc... ones but we can defer this.  Since the $Is ones are in use now and critical for basic portable scripts, we didn't want to defer this to be included as part of the interop RFC which wouldn't be implemented until after 6.0.0.",
      "created_at": "2017-08-31T17:51:14Z",
      "updated_at": "2017-08-31T17:51:14Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "Why we don't use 'PS' prefix for the new variables?",
      "created_at": "2017-08-31T18:38:22Z",
      "updated_at": "2017-08-31T18:38:22Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "I think using 'PS' prefix is good practice today and we should follow it.\r\nI don't reject $ps: namespace idea but I am not fan it.",
      "created_at": "2017-08-31T18:56:32Z",
      "updated_at": "2017-08-31T18:56:32Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "We discussed the `ps` prefix as in `PSIsWindows`, but we all agreed it's too ugly and probably harder to read.  It's also not a variable that affects powershell core behavior so something like: \"$InteropIsWindows\" would be better.  However, from a discovery standpoint, you can think of `is` as the prefix.",
      "created_at": "2017-08-31T19:01:38Z",
      "updated_at": "2017-08-31T19:01:38Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "Ugly if we haven't common naming rule. In C# we use naming rules and sometimes we see \"ugly\" but we follow common pattern.",
      "created_at": "2017-08-31T19:10:23Z",
      "updated_at": "2017-08-31T19:10:23Z"
    },
    {
      "author": "markekraus",
      "author_association": "CONTRIBUTOR",
      "body": "I'll argue that a `$PS` prefix also enhances discoverability in the context of all other automatic variables. `$PSScriptRoot`, `$PSVersionTable` are both describing the current environment and are also painful to read, but they are easy to enumerate.",
      "created_at": "2017-08-31T19:15:45Z",
      "updated_at": "2017-08-31T19:16:01Z"
    },
    {
      "author": "mklement0",
      "author_association": "CONTRIBUTOR",
      "body": "@SteveL-MSFT:\r\n\r\n> but that would be a much bigger breaking change to move all the existing ones into that namespace and it doesn't seem beneficial enough (consider all the existing sample scripts on the internet)\r\n\r\nThat would indeed be a big breaking change, but I was suggesting to grandfather the existing variables in, i.e., to retain them in the user-variable namespace _and also_ surface them inside the `$ps:` namespace.\r\n",
      "created_at": "2017-08-31T20:54:20Z",
      "updated_at": "2017-08-31T20:54:20Z"
    },
    {
      "author": "rkeithhill",
      "author_association": "COLLABORATOR",
      "body": "Rather than a bunch of global variables, why couldn't this be put in a hashtable (one global variable) such as `$PSInterop.IsMacOS` or `$PSPlatform.IsMacOS`?   Of course, the latter questions whether this info should be obtained from `$PSVersionTable` (maybe `$PSVersionTable.Platform.IsMacOS`).",
      "created_at": "2017-08-31T20:59:42Z",
      "updated_at": "2017-08-31T20:59:42Z"
    },
    {
      "author": "mklement0",
      "author_association": "CONTRIBUTOR",
      "body": "`$PS*` hashtables is also an interesting lightweight alternative in general to the `$ps:` namespace/provider idea, for bundling preference and automatic variables too; all it would take is to declare all `$PS*` variables as reserved by PS, which seems reasonable.\r\n\r\nIt's a nice way of grouping values, although it's a little verbose.",
      "created_at": "2017-08-31T21:28:59Z",
      "updated_at": "2017-08-31T21:28:59Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "@mklement0 if we decide to have a namespace or hashtable for `ps` variables, we would certainly grandfather existing ones and probably have scriptanalyzer rules moving people to use the new ones, but all of that is not required for 6.0.0.  The $is* ones are necessary which is why we are special casing them for this release.  I think it's fine if we end up with dupe $isWindows/etc... variables along with $interop:IsWindows or $interop.platform.IsWindows, etc...",
      "created_at": "2017-08-31T21:54:25Z",
      "updated_at": "2017-08-31T21:54:25Z"
    }
  ],
  "created_at": "2017-08-29T22:10:51Z",
  "number": 4700,
  "state": "closed",
  "title": "Rename $IsOSX to $IsmacOS",
  "updated_at": "2017-09-07T17:54:08Z"
}