{
  "_url": "https://github.com/PowerShell/PowerShell/issues/4772",
  "author": "SteveL-MSFT",
  "body": "WSManConfigProvider doesn't work once this is enabled if starting powershell with `-sta`, it does work if using `-mta`.  The same/similar WSManConfigProvider code works fine under Windows PowerShell 5.1 with `sta` or `mta`.  We shouldn't have to change the WSManConfigProvider code which relies on underlying non-thread safe COM objects, but need some help debugging this.\r\n\r\nFix #4350 \r\n",
  "closed_at": "2017-09-29T17:50:52Z",
  "comments": [
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "@daxian-dbw I've been thinking that I've been looking at this problem the wrong way.  ApartmentState is only used for COM interop and dotnet will marshal between STA and MTA so the only loss is some perf impact.  I'm thinking that the right thing to do here is to remove support for ApartmentState.  Thoughts?",
      "created_at": "2017-09-28T16:17:17Z",
      "updated_at": "2017-09-28T16:17:17Z"
    },
    {
      "author": "daxian-dbw",
      "author_association": "MEMBER",
      "body": "> and dotnet will marshal between STA and MTA\r\n\r\n@SteveL-MSFT I'm not very clear about the quoted sentence. Can you please elaborate a bit on it?\r\n\r\nMy understanding is that STA is for proper calls to COM object with the single-thread apartment (mainly about COM objects related to the user interface, for example, windows forms). Windows form may not be a problem as it's not supported in .NET Core. However, it may still be possible that user gets a STA COM object by `New-Object` and operate on it, so it might be affected when removing the `Apartment` support from powershell core.\r\n\r\nA question, if we remove `Apartment` support, what would be the default thread `apartment` for powershell?\r\n\r\nI want to point out that on Windows PowerShell, users are able to specify the `ApartmentState` in `PSInvocationSettings` and pass the setting to `powershell.Invoke(...)`. Removing `ApartmentState` support in PS Core is technically a breaking change, so it probably needs to be reviewed by the Committee.",
      "created_at": "2017-09-29T17:35:09Z",
      "updated_at": "2017-09-29T17:35:09Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "@daxian-dbw see [Interop Marshaling](https://docs.microsoft.com/en-us/dotnet/framework/interop/interop-marshaling#marshaling_and_com_apartments)\r\n\r\nI'll close this for now and open a new issue regarding removing ApartmentState support and will discuss with Committee",
      "created_at": "2017-09-29T17:50:52Z",
      "updated_at": "2017-09-29T17:50:52Z"
    }
  ],
  "created_at": "2017-09-07T19:00:36Z",
  "number": 4772,
  "state": "closed",
  "title": "Enable ApartmentState support",
  "updated_at": "2017-10-16T21:54:25Z"
}