{
  "_url": "https://github.com/PowerShell/PowerShell/issues/4788",
  "author": "dantraMSFT",
  "body": "Fix https://github.com/PowerShell/PowerShell/issues/4561\r\n\r\nThis change mitigates intermittent timeout failures in the access denied tests as well as fixes unintended cross-test dependencies.  If PowerShell takes longer that 10 seconds to complete a race can cause the subsequent test to pick up the output file of the previous test and fail (i.e., the expected output error file already exists from the previous test because it was created by the long running PowerShell process after the second test started.)  Worse case, the failure cascades causing the race to propogate through the remaining tests in the set.\r\n\r\nThe fix is two fold:\r\n1: Increase the timeout for waiting for the launched powershell process. (mitigation)\r\n2: Ensure each uses a unique name for the error and done files to avoid polluting the next test.",
  "closed_at": "2017-09-12T18:01:33Z",
  "comments": [
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "@dantraMSFT I think you misunderstood my feedback.  You don't need a different errfile for each variation of the test.  The important part is having the context in the contents so when it fails, the engineer knows which variation it failed on and why.  My suggestion is to get rid of $fileBaseName, it's unncessary.  Just put the contents of $cmdline into $errFile.  Since the validation checks the contents of $errFile and expects $expectedError, it won't match and you'll see the context message in $errFile",
      "created_at": "2017-09-09T00:53:12Z",
      "updated_at": "2017-09-09T00:53:12Z"
    },
    {
      "author": "dantraMSFT",
      "author_association": "CONTRIBUTOR",
      "body": "I'm closing this to use a different approach to handling the timeout issue.",
      "created_at": "2017-09-09T00:59:50Z",
      "updated_at": "2017-09-09T00:59:50Z"
    },
    {
      "author": "dantraMSFT",
      "author_association": "CONTRIBUTOR",
      "body": "Discussed offline with Steve; will leave the test-specific error filename but generate it from a hash of $cmdline instead of requiring it's definition in the test case data.",
      "created_at": "2017-09-11T20:43:19Z",
      "updated_at": "2017-09-11T20:43:19Z"
    },
    {
      "author": "daxian-dbw",
      "author_association": "MEMBER",
      "body": "@dantraMSFT Does the PR description needs to be updated based on your offline discussion with Steve?",
      "created_at": "2017-09-12T00:10:45Z",
      "updated_at": "2017-09-12T00:10:45Z"
    },
    {
      "author": "dantraMSFT",
      "author_association": "CONTRIBUTOR",
      "body": "@daxian-dbw: no, the gist was to avoid the extra parameter.  We consider attempting to use start-process but that proved a dead end.",
      "created_at": "2017-09-12T16:55:40Z",
      "updated_at": "2017-09-12T16:55:40Z"
    },
    {
      "author": "daxian-dbw",
      "author_association": "MEMBER",
      "body": "@dantraMSFT thanks for the clarification.",
      "created_at": "2017-09-12T18:00:25Z",
      "updated_at": "2017-09-12T18:00:25Z"
    }
  ],
  "created_at": "2017-09-08T20:19:10Z",
  "number": 4788,
  "state": "closed",
  "title": "Mitigate intermittent failures in access denied tests.",
  "updated_at": "2017-09-12T18:08:48Z"
}