{
  "_url": "https://github.com/PowerShell/PowerShell/issues/4810",
  "author": "livarcocc",
  "body": "_From @Ayanmullick on September 8, 2017 11:46_\n\n## Expected  behavior\r\nAs an IT Pro I've created a lot of Powershell scripts over the years for my personal use and gotten used to the syntax. And it'd be nice to be able to work with .Net Core in the same syntax. Also, a .Net Core Powershell module would enable integrating .Net into the existing Powershell scripts more easily\r\n\r\n## Actual behavior\r\n\r\nWill there also be a Powershell module equivalent to the dotnet CLI commands for .Net Core 2.0.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\n\n_Copied from original issue: dotnet/cli#7617_",
  "closed_at": "2017-09-11T22:09:26Z",
  "comments": [
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "@livarcocc not sure why this was moved to this repo, I think the original ask was to have a PowerShell module equivalent of the dotnet CLI commands.  This isn't something the PowerShell Team would do, it should be up to the dotnet cli team.",
      "created_at": "2017-09-11T22:09:26Z",
      "updated_at": "2017-09-11T22:09:26Z"
    },
    {
      "author": "reyou",
      "author_association": "NONE",
      "body": "@livarcocc i think this is a very valid request from @Ayanmullick, and I would like to learn what will be the case of this?\r\n\r\nIt would be great to have a common Powershell command window in VS 2017, with merging nuget-package-manager and dotnet CLI manager. ",
      "created_at": "2018-02-20T16:38:20Z",
      "updated_at": "2018-02-20T16:38:20Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "I agree that this is a very valid request, but PowerShell team can't own the modules for everything particularly where we are not area experts.  Perhaps the best course of action is for the community to start this project and have the dotnet CLI team contribute.  The PowerShell team can help with cmdlet review.",
      "created_at": "2018-02-20T16:45:41Z",
      "updated_at": "2018-02-20T16:45:41Z"
    }
  ],
  "created_at": "2017-09-11T21:32:31Z",
  "labels": [
    "Resolution-External"
  ],
  "number": 4810,
  "state": "closed",
  "title": "Powershell Module",
  "updated_at": "2018-02-20T16:45:41Z"
}