{
  "_url": "https://github.com/PowerShell/PowerShell/issues/4901",
  "author": "sulobr",
  "body": "When using -showwindow switch with help or get-help for Exchange Online cmdlet, the details of the cmdlet is not displayed. \r\n\r\ninstruction to connect to EXO is documented below\r\nhttps://technet.microsoft.com/en-us/library/jj984289(v=exchg.160).aspx\r\n\r\nhttps://technet.microsoft.com/en-us/library/mt775114(v=exchg.160).aspx\r\n\r\nfor example \r\nget-help Get-MailboxCalendarFolder -showwindow \r\nhelp Get-MailboxCalendarFolder -showwindow\r\n\r\nGet-Help works in cmdlet line as below but -ShowWindow doesn’t show same details  in the window\r\n\r\nPS C:\\Users\\user1> get-help Get-MailboxCalendarFolder\r\n\r\nNAME\r\n    Get-MailboxCalendarFolder\r\n\r\nSYNOPSIS\r\n    This cmdlet is available in on-premises Exchange Server 2016 and in the cloud-based service. Some parameters and settings may be exclusive to one environment or the other.\r\n\r\n    Use the Get-MailboxCalendarFolder cmdlet to retrieve the publishing or sharing settings for a specified mailbox calendar folder.\r\n\r\n    For information about the parameter sets in the Syntax section below, see Exchange cmdlet syntax.\r\n\r\n\r\nSYNTAX\r\n    Get-MailboxCalendarFolder -Identity <MailboxFolderIdParameter> [-DomainController <Fqdn>] [<CommonParameters>]\r\n\r\n\r\nDESCRIPTION\r\n    The Get-MailboxCalendarFolder cmdlet retrieves information for the specified calendar folder. This information includes the calendar folder name, whether the folder is currently\r\n    published or shared, the start and end range of calendar days published, the level of details published for the calendar, whether the published URL of the calendar can be searched on\r\n    the web, and the published URL for the calendar.\r\n\r\n    You need to be assigned permissions before you can run this cmdlet. Although all parameters for this cmdlet are listed in this topic, you may not have access to some parameters if\r\n    they're not included in the permissions assigned to you. To see what permissions you need, see the \"Calendar configuration\" entry in the Recipients Permissions topic.\r\n\r\n\r\nRELATED LINKS\r\n    Online Version http://technet.microsoft.com/EN-US/library/dba2cebb-3c37-40ce-8ac0-93ec8d79ce0d(EXCHG.160).aspx\r\n\r\nREMARKS\r\n    To see the examples, type: \"get-help Get-MailboxCalendarFolder -examples\".\r\n    For more information, type: \"get-help Get-MailboxCalendarFolder -detailed\".\r\n    For technical information, type: \"get-help Get-MailboxCalendarFolder -full\".\r\nFor online help, type: \"get-help Get-MailboxCalendarFolder -online\"\r\n\r\n\r\nExpected behavior\r\n-----------------\r\n\r\nget-help Get-Mailbox -showwindow or help get-mailbox -showwindow cmdlet should show details of the help documentation in the window\r\n\r\nActual behavior\r\n---------------\r\n\r\nget-help Get-Mailbox -showwindow or help get-mailbox -showwindow cmdlet does not show details of the help documentation in the window. It is blank\r\n\r\n",
  "closed_at": "2017-09-23T00:15:54Z",
  "comments": [
    {
      "author": "sulobr",
      "author_association": "NONE",
      "body": "![showwin2](https://user-images.githubusercontent.com/32208482/30766650-527bb12e-9fab-11e7-9a31-5fe7dd291825.PNG)\r\n",
      "created_at": "2017-09-22T22:33:08Z",
      "updated_at": "2017-09-22T22:33:08Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "`-showwindow` isn't supported on PowerShell Core so we should remove that switch.\r\n\r\nOn Windows PowerShell 5.1, that is a known issue that isn't planned to be fixed since most users use the console output or MSDN.",
      "created_at": "2017-09-23T00:15:54Z",
      "updated_at": "2017-09-23T00:15:54Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "https://github.com/PowerShell/PowerShell/pull/4903 to remove this switch as this feature depends on WPF which isn't on CoreCLR",
      "created_at": "2017-09-23T00:36:39Z",
      "updated_at": "2017-09-23T00:36:39Z"
    }
  ],
  "created_at": "2017-09-22T22:30:31Z",
  "labels": [
    "Resolution-Won't Fix",
    "WG-Cmdlets-Core"
  ],
  "number": 4901,
  "state": "closed",
  "title": "Showwindow switch for help/get-help cmdlet for Exchange Online Powershell cmdlets",
  "updated_at": "2017-09-23T00:36:39Z"
}