{
  "_url": "https://github.com/PowerShell/PowerShell/issues/5050",
  "author": "trondhindenes",
  "body": "Steps to reproduce\r\n------------------\r\nGiven a Powershell module where the module \"name\" is Testtest and the psd1 manifest file is named TestTest (notice casing differences), Powershell Core simply disregards the module. This is fine in most cases, but if using Install-Module to install a module with this error from a nuget feed, the install silently fails, instead of reporting the error. \r\n\r\nWhen using verbose logging with Install-Module the last line logged is:\r\n```powershell\r\ninstall-module Testtest -Scope CurrentUser -Verbose\r\n<snipped>\r\nVERBOSE: InstallPackageLocal' - name='Testtest', version='1.0.8',destination='/tmp/1267197911'\r\n```\r\n\r\nExpected behavior\r\n-----------------\r\nThe last line of the verbose output of a successfully installed package seems to be:\r\n\r\n```powershell\r\nVERBOSE: Module 'TestTest' was installed successfully to path '/home/ubuntu/.local/share/powershell/Modules/TestTest/1.0.10'\r\n```\r\n\r\nIn any situation where Install-Module does not complete with the successful installation of a module, the cmdlet should at least write an error to the console.\r\n\r\nSince Windows and Linux have very different handling of casing in files and paths, it would (imho) make sense to build some \"robustness\" into Powershell to deal with this, for instance by printing warnings/errors when there are discrepancies between casing in a module path and it's name (from the manifest). There are tons of things that could be done in order to improve the overall robustness of case-handling in regards to modules etc.\r\n",
  "closed_at": "2017-10-07T14:29:04Z",
  "comments": [
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "@trondhindenes thanks for reporting this issue, but can you cut and paste it over here? https://github.com/powershell/powershellget/issues\r\n\r\nThanks!",
      "created_at": "2017-10-07T14:29:04Z",
      "updated_at": "2017-10-07T14:29:04Z"
    }
  ],
  "created_at": "2017-10-07T10:58:50Z",
  "labels": [
    "Area-PowerShellGet",
    "Resolution-External"
  ],
  "number": 5050,
  "state": "closed",
  "title": "Powershell Core is unable to enumerate module with casing differences, install-module silently fails",
  "updated_at": "2017-10-07T14:29:04Z"
}