{
  "_url": "https://github.com/PowerShell/PowerShell/issues/5258",
  "author": "PaulHigin",
  "body": "These are two fixes for random hangs found internally.\r\n\r\nThe first fix (job.cs) is for data stream Close calls on PSDataCollection objects because the method also raises public events.  If an exception is thrown on the event handler then the thread never completes job clean up causing a hang.  Fix is to catch all thrown exceptions and report.\r\n\r\nThe second (invokecommandcommand.cs) fixes a hang scenario where a remote job goes into disconnected state while simultaneously handling an exception.  Fix is to use try/finally pattern to ensure Invoke-Command can always complete with jobs in the disconnected state.",
  "closed_at": "2017-11-10T00:22:40Z",
  "comments": [
    {
      "author": "adityapatwardhan",
      "author_association": "MEMBER",
      "body": "@PaulHigin Is it possible to add tests for this?",
      "created_at": "2017-11-06T18:30:55Z",
      "updated_at": "2017-11-06T18:30:55Z"
    },
    {
      "author": "PaulHigin",
      "author_association": "COLLABORATOR",
      "body": "@adityapatwardhan No, not safely.  The code closes all opened runspaces when an \"interactive host\" runspaces closes, which unfortunately includes Pester runspaces.",
      "created_at": "2017-11-06T22:29:02Z",
      "updated_at": "2017-11-06T22:29:02Z"
    },
    {
      "author": "PaulHigin",
      "author_association": "COLLABORATOR",
      "body": "@adityapatwardhan  Whoops, I though this was referring to the recent PowerShell hang on exit issue.  But again, the answer is not to tests since this is fixing rare random hangs.  I might be able to add test hooks, but I don't know if it is worth it.",
      "created_at": "2017-11-06T22:32:10Z",
      "updated_at": "2017-11-06T22:32:10Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "We should just take this PR into account when we develop reliability specific tests as part of https://github.com/PowerShell/PowerShell/issues/4008",
      "created_at": "2017-11-06T23:01:35Z",
      "updated_at": "2017-11-06T23:01:35Z"
    }
  ],
  "created_at": "2017-10-27T17:29:33Z",
  "number": 5258,
  "state": "closed",
  "title": "Porting random hang fixes",
  "updated_at": "2018-01-23T16:46:20Z"
}