{
  "_url": "https://github.com/PowerShell/PowerShell/issues/5296",
  "author": "Earl-S",
  "body": "My servers are all getting a new entry in SeServiceLogonRight (Log on as a service) for every JEA connection made and they are not getting cleaned up. The SID is S-1-5-94-xxx with the name of \"WinRM Virtual Users\\WinRM VA_xxx_Domain_UserID\" where xxx is the next numeric number, Domain and UserID are for the person connected to the endpoint. I have some servers that have over 500 entries in a few days that only differ by the incremented number (each time an automated process runs it appears to create another entry).\r\n\r\nReference this bug report on JEA where I was asked to create a new one here:\r\nhttps://github.com/PowerShell/JEA/issues/27\r\n\r\nSteps to reproduce\r\n------------------\r\nCreate a basic JEA endpoint with Session, Role, and Module files, then Register the endpoint.\r\nRun Invoke-Command against the new endpoint several times.\r\nOpen up Local Security Policy and see that \"Log on as a service\" (SeServiceLogonRight) has had a new entry added for each instance of Invoke-Command.\r\n\r\nExpected behavior\r\n-----------------\r\nJEA should remove the ID from the SeServiceLogonRight when the session closes.\r\n\r\nActual behavior\r\n---------------\r\nJEA leaves the IDs under SeServiceLogonRight indefinitely.\r\n\r\nEnvironment data\r\n----------------\r\nPSVersion 5.1.14409.1012                                                                                                                             \r\nPSEdition Desktop                                                                                                                                    \r\nPSCompatibleVersions {1.0, 2.0, 3.0, 4.0...}                                                                                                                    \r\nBuildVersion 10.0.14409.1012                                                                                                                            \r\nCLRVersion 4.0.30319.42000                                                                                                                            \r\nWSManStackVersion 3.0                                                                                                                                        \r\nPSRemotingProtocolVersion 2.3                                                                                                                                        \r\nSerializationVersion 1.1.0.1   \r\n\r\n",
  "closed_at": "2018-07-23T17:31:28Z",
  "comments": [
    {
      "author": "pra6hu",
      "author_association": "NONE",
      "body": "Is there any update on this? ",
      "created_at": "2018-07-23T13:47:21Z",
      "updated_at": "2018-07-23T13:47:21Z"
    },
    {
      "author": "PaulHigin",
      "author_association": "COLLABORATOR",
      "body": "Sorry, I lost track of this issue.  PowerShell remoting authentication and endpoint session creation is performed at the WinRM layer.  I spoke internally with the WinRM folks and they are aware of the issue.  I have also created an internal bug report for them.  \r\n\r\n@Earl-S I am closing this issue since it outside PowerShell.  But I suggest you also create a UserVoice (https://windowsserver.uservoice.com/forums/301869-powershell) report.",
      "created_at": "2018-07-23T17:31:28Z",
      "updated_at": "2018-07-23T17:31:28Z"
    },
    {
      "author": "rackley096794",
      "author_association": "NONE",
      "body": "This issue has been fixed in Server 2016 with the November 2018 rollup and Server 2019 with the January 2019 rollup.  In addition this right is managed slightly differently - please see the documentation update here:  https://github.com/PowerShell/PowerShell-Docs/pull/3446/files",
      "created_at": "2018-12-20T14:21:23Z",
      "updated_at": "2018-12-20T14:21:23Z"
    },
    {
      "author": "Nick-Rimmer2016",
      "author_association": "NONE",
      "body": "Was this ever resolved for Windows 2012R2? I have the exact same issue on this platform.",
      "created_at": "2019-03-14T16:05:01Z",
      "updated_at": "2019-03-14T16:05:01Z"
    }
  ],
  "created_at": "2017-11-01T20:59:25Z",
  "number": 5296,
  "state": "closed",
  "title": "SeServiceLogonRight is not getting cleaned up after exiting JEA session",
  "updated_at": "2019-03-14T16:05:02Z"
}