{
  "_url": "https://github.com/PowerShell/PowerShell/issues/5602",
  "author": "dantraMSFT",
  "body": "The doc should provide an overview for viewing and/or collecting PowerShell instrumentation on the three platforms.\r\n\r\nFor Windows, cover the change in the provider GUID from Windows PowerShell and the location in the event viewer. Note that Get-EventLog is not available.\r\n\r\nFor Linux, indicate that logging is directed to syslog (or messages) and an overview of filtering using rsyslog  configuration.\r\n\r\nOn MacOS, provide an overview of using Console to view and filter powershell events (i.e., Process -eq pwsh)",
  "closed_at": "2018-01-03T23:04:23Z",
  "comments": [
    {
      "author": "tandasat",
      "author_association": "CONTRIBUTOR",
      "body": "Hi, I am having difficult time to find where PowerShell core puts event logs, and seeing assistance for it.\r\n\r\nOn v6.0.0-rc on Windows 10, I executed command that should generate EID 4104 (eg `[type]$null`) but could not find out where it was stored on Event Viewer (Windows PowerShell's logs are under `Applications and Services Logs\\Microsoft\\Windows\\PowerShell`).\r\n\r\nPlease let me know a right place to ask this question (or any general ones), as I do not think this thread is the right place for such questions. \r\n\r\nThanks!",
      "created_at": "2017-12-03T21:16:35Z",
      "updated_at": "2017-12-03T21:16:35Z"
    },
    {
      "author": "dantraMSFT",
      "author_association": "CONTRIBUTOR",
      "body": "Hi @tandasat \r\n\r\nYou will need to register the ETW manifest before events will appear in the event log.\r\nIn the install directory, look for RegisterManifest.ps1.  \r\nFrom an elevated powershell prompt run the RegisterManifest.ps1 script.  \r\n\r\nEvents will be located in the event log under  Applications and Services Logs\\PowerShellCore.",
      "created_at": "2017-12-04T22:09:13Z",
      "updated_at": "2017-12-04T22:09:13Z"
    },
    {
      "author": "tandasat",
      "author_association": "CONTRIBUTOR",
      "body": "I had to add double quotes for places taking a full paths of files because of spaces in the path (eg, changed to `'wevtutil.exe im \"{0}\" /rf:\"{1}\" /mf:\"{1}\"'` )\r\n\r\nAfter that, it worked as you described. Thank you @dantraMSFT for help!",
      "created_at": "2017-12-05T03:34:47Z",
      "updated_at": "2017-12-05T03:34:47Z"
    },
    {
      "author": "dantraMSFT",
      "author_association": "CONTRIBUTOR",
      "body": "See https://github.com/PowerShell/PowerShell-Docs/pull/1922\r\n",
      "created_at": "2018-01-03T23:04:23Z",
      "updated_at": "2018-01-03T23:04:23Z"
    }
  ],
  "created_at": "2017-12-01T20:36:11Z",
  "number": 5602,
  "state": "closed",
  "title": "Need doc for PowerShell logging on Windows/Linux/Mac",
  "updated_at": "2018-02-08T07:27:43Z"
}