{
  "_url": "https://github.com/PowerShell/PowerShell/issues/5681",
  "author": "SteveL-MSFT",
  "body": "For deployments of PSCore6.x it would make sense to have a very lightweight pkg that is essentially: Engine, PkgMgmt, PSGet, and basic cmdlets (like Get-Command, Import-Module, Archive module).  This pkg would be mostly used on servers being managed and would `install-module` what they need.\r\n\r\nAnother pkg would be for the developer/it-pro which is very rich including everything in `lite`, but also modules useful for authoring and debugging scripts/modules: JSON, WebCmdlets, YAML module, Management module, HelpSystem, etc...",
  "closed_at": null,
  "comments": [
    {
      "author": "markekraus",
      "author_association": "CONTRIBUTOR",
      "body": "I like this. I do have one request: the light weight download cmdlet I've been discussing... I'd like that included in the lite version if possible. The plan is that it wont have any dependency on the web cmdlet code base. But a simple way to download files in native PowerShell would be crucial, IMO, to boot strapping small environments.",
      "created_at": "2017-12-13T02:13:56Z",
      "updated_at": "2017-12-13T02:13:56Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "@markekraus absolutely, the intent of the `lite` pkg is anything needed to bootstrap the system should be part of it, everything else should be downloaded from PSGallery",
      "created_at": "2017-12-13T03:11:19Z",
      "updated_at": "2017-12-13T03:11:19Z"
    },
    {
      "author": "RichardSiddaway",
      "author_association": "NONE",
      "body": "Not against the idea but it will need very careful, precise and extensive explanation to the general user otherwise there'll be complaints/comments/statements that all of the functionality has been ripped out of PowerShell.  This is analogous to the way the help systems work and we're still seeing comments and complaints about PowerShell not containing any help!",
      "created_at": "2017-12-13T12:02:19Z",
      "updated_at": "2017-12-13T12:02:19Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "@RichardSiddaway agree that it should be clear to users of the `lite` version what they are getting.  Ideally, the `rich` version is simply getting a single module from PSGallery that is a meta-module that just depends on all the other modules.  This way it also allows a `lite` user to get parity with `rich` which is then just preinstalled.",
      "created_at": "2017-12-13T20:50:53Z",
      "updated_at": "2017-12-13T20:50:53Z"
    },
    {
      "author": "bergmeister",
      "author_association": "CONTRIBUTOR",
      "body": "@RichardSiddaway I agree with you especially since `Update-Help` is still not working properly. I just tried on a Win10 VM in Azure with the latest updates and even running it as an admin I get:\r\n````powershell\r\nC:\\WINDOWS\\system32> Update-Help\r\nUpdate-Help : Failed to update Help for the module(s) 'PrintManagement' with UI culture(s) {en-US} : Unable to connect\r\nto Help content. The server on which Help content is stored might not be available. Verify that the server is\r\navailable, or wait until the server is back online, and then try the command again.\r\nAt line:1 char:1\r\n+ Update-Help\r\n+ ~~~~~~~~~~~\r\n    + CategoryInfo          : InvalidOperation: (:) [Update-Help], Exception\r\n    + FullyQualifiedErrorId : UnableToConnect,Microsoft.PowerShell.Commands.UpdateHelpCommand\r\n````",
      "created_at": "2017-12-14T19:18:16Z",
      "updated_at": "2017-12-14T19:18:16Z"
    },
    {
      "author": "bergmeister",
      "author_association": "CONTRIBUTOR",
      "body": "@SteveL-MSFT : I like your idea but please don't create too many bundles with different versioning of their modules in the future because otherwise we'll endup with versioning hell similar to when .Net Core started with hundreds of NuGet packages.",
      "created_at": "2017-12-14T19:19:33Z",
      "updated_at": "2017-12-14T19:19:33Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "@bergmeister I'm thinking of literally just the two.  In the future, we will likely have one additional package only intended for managed nodes where interactive console isn't needed at all.  ",
      "created_at": "2017-12-15T00:31:20Z",
      "updated_at": "2017-12-15T00:31:20Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "Related RFC https://github.com/PowerShell/PowerShell-RFC/pull/153",
      "created_at": "2018-12-08T17:46:05Z",
      "updated_at": "2018-12-08T17:46:05Z"
    },
    {
      "author": "kilasuit",
      "author_association": "COLLABORATOR",
      "body": "simlarly the idea behind this would further tie in with #1979 and would require further planning and discussion to make a feasibility but this is something that I do think warrants further engineering time for smaller use cases where you want to start with just the base engine and bolt on features as needed \r\n\r\nsorta like the SKU modules in Windows work but without the licensing overheads",
      "created_at": "2019-01-22T05:21:19Z",
      "updated_at": "2019-01-22T05:21:19Z"
    }
  ],
  "created_at": "2017-12-13T01:37:58Z",
  "number": 5681,
  "state": "open",
  "title": "Have both lite and rich pkgs of PSCore6.x",
  "updated_at": "2020-12-07T19:08:34Z"
}