{
  "_url": "https://github.com/PowerShell/PowerShell/issues/5716",
  "author": "markekraus",
  "body": "## PR Summary\r\n\r\nReference #5669\r\n\r\n* Ran VSCode format based on project defined formatting (applies OTBS)\r\n* Cleaned up empty newlines at the begining of code blocks\r\n* Consistent Formatting for helper function parameters\r\n* Added empty newlines between code blocks in the same scope.\r\n\r\n## PR Checklist\r\n\r\nNote: Please mark anything not applicable to this PR `NA`.\r\n\r\n- [X] [PR has a meaningful title](https://github.com/PowerShell/PowerShell/blob/master/.github/CONTRIBUTING.md#pull-request---submission)\r\n    - [X] Use the present tense and imperative mood when describing your changes\r\n- [X] [Summarized changes](https://github.com/PowerShell/PowerShell/blob/master/.github/CONTRIBUTING.md#pull-request---submission)\r\n- NA User facing [Documentation needed](https://github.com/PowerShell/PowerShell/blob/master/.github/CONTRIBUTING.md#pull-request---submission)\r\n    - NA Issue filed - Issue link:\r\n- [X] [Change is not breaking](https://github.com/PowerShell/PowerShell/blob/master/.github/CONTRIBUTING.md#making-breaking-changes)\r\n- NA [Make sure you've added a new test if existing tests do not effectively test the code changed](https://github.com/PowerShell/PowerShell/blob/master/.github/CONTRIBUTING.md#before-submitting)\r\n    - [X] [Add `[feature]` if the change is significant or affectes feature tests](https://github.com/PowerShell/PowerShell/blob/master/docs/testing-guidelines/testing-guidelines.md#requesting-additional-tests-for-a-pr)\r\n- [X] This PR is ready to merge and is not [Work in Progress](https://github.com/PowerShell/PowerShell/blob/master/.github/CONTRIBUTING.md#pull-request---work-in-progress).\r\n    - If the PR is work in progress, please add the prefix `WIP:` to the beginning of the title and remove the prefix when the PR is ready.\r\n",
  "closed_at": "2018-01-09T21:43:26Z",
  "comments": [
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "We could split the test file later - it is very large. Thoughts?",
      "created_at": "2017-12-20T14:24:44Z",
      "updated_at": "2017-12-20T14:24:44Z"
    },
    {
      "author": "markekraus",
      "author_association": "CONTRIBUTOR",
      "body": "@iSazonov  I think it would be good to split this between the 2 cmdlets. I really dislike how massive this file is. Would just need to make sure WebListener can work fine in that scenario as currently it was made under the assumption it only runs in this one test file. The shared test functions need to be moved to a module too.",
      "created_at": "2017-12-20T14:44:57Z",
      "updated_at": "2017-12-20T14:44:57Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "Based on discussion above I think we should keep our original vertical formatting for hashes. The rest LGTM.",
      "created_at": "2018-01-09T03:24:49Z",
      "updated_at": "2018-01-09T03:24:49Z"
    },
    {
      "author": "markekraus",
      "author_association": "CONTRIBUTOR",
      "body": "@iSazonov I disagree. if we switch back to the vertical formatting it is going to continue to be a pain to keep this file properly formatted. I like the original formatting, but, I also like being able to enforce formatting in this file. We can't have it both ways, but being able to keep this file formatted is the better option.",
      "created_at": "2018-01-09T10:16:19Z",
      "updated_at": "2018-01-09T10:16:19Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "Over the past year we have many examples of vertical formatting of hashes in Testcases. Sometimes these hashes are big. We specifically asked the authors to do so to get well-read tests.\r\nI believe this should be preserved and we should apply the new formatting only to the selected file segments.",
      "created_at": "2018-01-09T11:41:34Z",
      "updated_at": "2018-01-09T11:41:34Z"
    },
    {
      "author": "markekraus",
      "author_association": "CONTRIBUTOR",
      "body": "IMO, this needlessly complicates the project. The vertical alignment does add readability but, it's not like it is unreadable without it. \r\n\r\nIt is painful to have to format the document and then go back and discard specific chunks. every. single. time. I have 30 commits to this file and those are only the official squash merges. I have, on average, 3-5 commits to this file per merge addressing PR feedback. Not to mention all the work I do that I end up not submitting PRs for. That is a ton of wasted time dealing with formatting issues in one file or having to just not auto-format it and have to do more commits when the fomating comes up in PR review. It's a waste of your time and my time for so little gain.\r\n\r\nAnd that's just me. Asking future contributors to format this file, but be selective raises the bar on who can contribute. If we can simply tell contributors \"run 'format this document' in VS Code\" and not worry about vertical alignment or unstaging/discarding chunks, we can make this easy and more approachable for new contributors.\r\n  ",
      "created_at": "2018-01-09T12:05:47Z",
      "updated_at": "2018-01-09T12:07:07Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "😄  Last February I offered to clean the test files to save the time of others (like you), but the team asked me to spend time on more useful things. I think this is due to a lot of MSFT expert experience - formatting does not make any useful features but can add subtle errors. So we formatting only when it's inevitable or/and for new code. I think this is a very important experience and we have to stick with it. I only considered your formatting because you actually remade the tests. I also hoped that we could use the automatic formatting, but it was not justified.",
      "created_at": "2018-01-09T12:25:13Z",
      "updated_at": "2018-01-09T12:25:13Z"
    },
    {
      "author": "markekraus",
      "author_association": "CONTRIBUTOR",
      "body": "Auto-formatting is justified for this file. I am very intimate with it. You could call me an expert on web cmdlets pester tests at this point. I will be contributing to and reviewing changes to this file and the web cmdlets probably for years to come. I'm trying to do everyone (reviewers and contributors alike) a favor here by making auto-formatting possible for this file.\r\n\r\nI will work on a issue requesting this kind of formatting in the VS Code PowerShell extension. At the very least, I'll ask them to add an \"ignore white space in single-line HashTables\" option. That way we can still format it by hand and not have the auto-formatting remove it. If that ever gets added we can update the VSCode settings and I will personally format ever hashtable array with vertical alignment in this project. until then, can we please just stick to the auto-formatting???\r\n  ",
      "created_at": "2018-01-09T12:53:31Z",
      "updated_at": "2018-01-09T12:53:57Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "As for your question, I would prefer to have the same rules for all files, otherwise it would mislead other contributors.\r\nI have no categorical objections. I just informed you.\r\nIf the team approves, I'm OK.",
      "created_at": "2018-01-09T13:05:45Z",
      "updated_at": "2018-01-09T13:05:45Z"
    },
    {
      "author": "daxian-dbw",
      "author_association": "MEMBER",
      "body": "I'm fine to use `vscode-powershell` auto-formatting for this particular test file for two reasons:\r\n1. This test file is huge and complex. It consists of tests authored by different people with different styles from the past (maybe some were from the legacy tests written years back).\r\n2. @markekraus is by far (and maybe the foreseeable future) the main contributor to this file. If he thinks formatting this file would improve his productivity in the upcoming work with this file, then I would like to see it happen 😄 \r\n\r\nI totally understand @iSazonov's concern about the vertical alignment on single-line hashtables as sometimes it's important for readability, such as the [`commandString`](https://github.com/PowerShell/PowerShell/blob/master/test/powershell/engine/Basic/DefaultCommands.Tests.ps1#L11) table in `DefaultCommands.Tests.ps1`.\r\n\r\nFor this particular file, the Hashtable arrays for `TLS` and `redirect` tests are not too bad without the vertical alignment, so I think it's fine. If someday a new test introduces a bigger table that makes it much worse to read without the vertical alignment, we can always revisit it.\r\n  ",
      "created_at": "2018-01-09T18:03:38Z",
      "updated_at": "2018-01-09T18:04:58Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "What about other .ps1/.psm1 files? Shall we approve auto format them? Should we mark files which should be auto formatted/non-formatted?",
      "created_at": "2018-01-10T03:56:55Z",
      "updated_at": "2018-01-10T03:56:55Z"
    },
    {
      "author": "daxian-dbw",
      "author_association": "MEMBER",
      "body": "I don't expect PRs that auto formats a large number of files as that will be impossible to review and possibly not a good use of time. But if it's a particular file like the `WebCmdlet.test.ps1`, whose formatting is affecting the upcoming work on it, then I think it's OK to auto-format it.",
      "created_at": "2018-01-10T17:19:59Z",
      "updated_at": "2018-01-10T17:19:59Z"
    }
  ],
  "created_at": "2017-12-19T17:25:59Z",
  "number": 5716,
  "state": "closed",
  "title": "Convert Web Cmdlets test to OTBS Formating",
  "updated_at": "2018-01-19T18:58:30Z"
}