{
  "_url": "https://github.com/PowerShell/PowerShell/issues/5744",
  "author": "FranklinYu",
  "body": "[Fedora 27 has been released on November 14th](https://fedoraproject.org/wiki/Releases/27/Schedule). Any plan to support this platform (or has it already been supported)? Current README and installation instructions only mention Fedora 25 and 26.",
  "closed_at": "2017-12-26T02:41:50Z",
  "comments": [
    {
      "author": "markekraus",
      "author_association": "CONTRIBUTOR",
      "body": "I haven't tried it, but the instruction 25 and 26 look to be the same and I don't see anything in the Fedora 27 release notes that stick out as an issue. (If anything, the fact that libcurl now uses OpenSSL instead of NSS in 27 is a good thing). Assuming the kernel is not extremely different between 26 and 27, the instructions for 26 should probably work for 27. ",
      "created_at": "2017-12-24T23:53:40Z",
      "updated_at": "2017-12-24T23:53:40Z"
    },
    {
      "author": "FranklinYu",
      "author_association": "NONE",
      "body": "I thought so; I was just wondering whether Fedora 27 is left out intentionally.\r\n\r\nThen I expect that Fedora 27 would also be tested, and bug of PowerShell on Fedora 27 (if any) would be fixed (or at least accept pull request)?",
      "created_at": "2017-12-25T17:31:11Z",
      "updated_at": "2017-12-25T17:31:11Z"
    },
    {
      "author": "markekraus",
      "author_association": "CONTRIBUTOR",
      "body": "> I was just wondering whether Fedora 27 is left out intentionally.\r\n\r\nProbably not! It is a new OS version and much of the Microsoft Team's focus has been on getting 6.0.0 ready for GA release.  I doubt it has been excluded intentionally.\r\n\r\n> PowerShell on Fedora 27 (if any) would be fixed (or at least accept pull request)?\r\n\r\nAt the very least, we would check if the bug is reproducible on one of the listed OS's (At least until 27 is added to the list). I suspect that any bug that shows up in 27 would reproduce in 26.  Regardless, if a bug is discovered in 27 and it can be fixed without regression in other OSes, than it could still be valuable. Even if MS doesn't officially support it, the Community may have interest in resolving the bug. ",
      "created_at": "2017-12-25T23:10:55Z",
      "updated_at": "2017-12-25T23:19:29Z"
    },
    {
      "author": "FranklinYu",
      "author_association": "NONE",
      "body": "Good to hear that. Looking forward to the GA release, and thanks for all the efforts.",
      "created_at": "2017-12-26T02:41:50Z",
      "updated_at": "2017-12-26T02:41:50Z"
    }
  ],
  "created_at": "2017-12-24T23:38:31Z",
  "labels": [
    "Issue-Question",
    "OS-Linux",
    "Resolution-Answered"
  ],
  "number": 5744,
  "state": "closed",
  "title": "Support Fedora 27",
  "updated_at": "2018-02-08T07:29:12Z"
}