{
  "_url": "https://github.com/PowerShell/PowerShell/issues/5779",
  "author": "StingyJack",
  "body": "A -NoNewLine would be nice here since the usual convention in .net languages is WriteLine to include crlf and Write to not.\r\n\r\nThis is probably true for the other Write-* functions (except Write-Output).",
  "closed_at": null,
  "comments": [
    {
      "author": "bergmeister",
      "author_association": "CONTRIBUTOR",
      "body": "Can you please give an example of a use case where this is needed/helpful and concatenating the string before calling `Write-Verbose` is not possible? Or is this only for convenience?",
      "created_at": "2018-01-04T07:09:59Z",
      "updated_at": "2018-01-04T07:09:59Z"
    },
    {
      "author": "StingyJack",
      "author_association": "CONTRIBUTOR",
      "body": "Any place where you would use normally use Debug.Write, Trace.Write, or Console.Write in .net languages.  Its not often, but is useful sometimes when trying to produce coherent output and you dont want a bunch of stringbuilders/etc, because all the `|Out-Null` just makes more visual cruft to deal with, or because you cant (or shouldnt) wait until a full \"sentence\" is formed to emit a diagnostic message\r\n\r\n",
      "created_at": "2018-01-05T04:33:39Z",
      "updated_at": "2018-01-05T04:33:39Z"
    },
    {
      "author": "fvanroie",
      "author_association": "NONE",
      "body": "I came accross the same issue, wanting to update log messages on the same line, as the cmdlet progresses. This would be a nice feature indeed.",
      "created_at": "2018-04-10T15:31:41Z",
      "updated_at": "2018-04-10T15:31:41Z"
    },
    {
      "author": "bergmeister",
      "author_association": "CONTRIBUTOR",
      "body": "This should be relatively easy to implement. Do you approve @SteveL-MSFT ?",
      "created_at": "2018-04-10T21:33:08Z",
      "updated_at": "2018-04-10T21:33:08Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "I don't see any controversy in adding this capability, but would suggest also adding it to `write-debug`  and `write-warning`at the same time.",
      "created_at": "2018-04-10T23:22:17Z",
      "updated_at": "2018-04-10T23:22:17Z"
    },
    {
      "author": "bergmeister",
      "author_association": "CONTRIBUTOR",
      "body": "@SteveL-MSFT I have done a quick, hacky PoC where I just change the `WriteVerboseLine` method in the `ConsoleHostUserInterface` class [here](https://github.com/PowerShell/PowerShell/blob/c1c5344a8897262433141ecbc13bb06ac2c4bbef/src/Microsoft.PowerShell.ConsoleHost/host/msh/ConsoleHostUserInterface.cs#L1242) to call the `Write` instead of the `WriteLine` method.\r\nIf I then execute a script with the content `Write-Verbose foo -Verbose; Write-Verbose foo -Verbose`, I get `VERBOSE: fooVERBOSE: foo` as an output. Clearly the problem is that we would have to remove the `VERBOSE: ` string that is always pre-pended but then one would not see whether it is a verbose message or not. Or is it better to rather add the `-NoNewline` switch to `Write-Information` instead? Similar problems with pre-pended text apply to `Write-Debug` and `Write-Warning`. What are your thoughts?",
      "created_at": "2018-04-21T20:46:00Z",
      "updated_at": "2018-04-21T20:47:55Z"
    },
    {
      "author": "BrucePay",
      "author_association": "COLLABORATOR",
      "body": "@SteveL-MSFT  @bergmeister @StingyJack `Write-Verbose`, `Write-Debug` etc are not at _all_ like the `Write()`, `WriteLine()` methods in .NET. `Write-Verbose` (`Error`, `Debug`, etc.) write objects to the host application which then decides what to do with them. In the console host, it currently prefixes the string with VERBOSE: and then writes it to the console. A graphical host might pop up a dialog instead.  Also consider the impact of action preferences on their presentation. For example:\r\n```\r\nPS[1] (7) > Write-Debug -debug \"A debug message\"\r\nDEBUG: A debug message\r\n\r\nConfirm\r\nContinue with this operation?\r\n[Y] Yes  [A] Yes to All  [H] Halt Command  [S] Suspend  [?] Help (default is \"Y\"):\r\n```\r\nThere is essentially a complete separation between what is written and how it is rendered. So it really doesn't make sense to have `-NoNewline` for `Write-Verbose` because there is no guarantee that it will simply be written to the \"console\". For that purpose, you would use `Write-Host -NoNewline` as in\r\n```\r\nwrite-host -NoNewline \"Hi there\" -ForegroundColor yellow\r\n```\r\n\r\n@fvanroie \r\n> I came accross the same issue, wanting to update log messages on the same line, as the cmdlet progresses. This would be a nice feature indeed.\r\n\r\nThis is exactly what we have `Write-Progress` for. Does it not work for your scenarios?\r\n",
      "created_at": "2018-04-23T00:20:05Z",
      "updated_at": "2018-04-23T00:20:05Z"
    },
    {
      "author": "fvanroie",
      "author_association": "NONE",
      "body": "I have this process that receives log data in bits and pieces. Using Verbose this is also echoed to the user. The only issue I had was that the last line has to be buffered since an incoming message could be split halfway a line that continues in the next update. So that's what led me to searching for a -NoNewline option.\r\n\r\nWrite-Verbose it great to output continuous long text blocks.\r\nWrite-Progress is more fitting for shorter status messages as opposed to long scrolling text.\r\n\r\nAnyway, it's not that big of a deal to me. I didn't want to mix Write-Verbose for full lines and Write-Progress for split lines, so I just buffer the last line now and output it when each line is complete.",
      "created_at": "2018-06-12T21:45:50Z",
      "updated_at": "2018-06-12T21:47:07Z"
    },
    {
      "author": "StingyJack",
      "author_association": "CONTRIBUTOR",
      "body": "> This is exactly what we have Write-Progress for. Does it not work for your scenarios?\r\n\r\n `$global:ProgressPreference = 'SilentlyContinue'` ends up in most of my scripts as Write-Progress seems to just slow things down.  Perhaps its just that modules misuse it. \r\n\r\n> For that purpose, you would use Write-Host...\r\n\r\nYes and have to listen to every cargo cult parrot - and PSScriptAnalyzer - tell me how awful I am for using Write-Host. I like _less_ aggravation. More importantly, I dont want a script or module emitting verbose messages all the time, I just want them emitted when i ask for them.  Write-Host doesn't do that.\r\n\r\n> A graphical host might pop up a dialog instead. Also consider the impact of action preferences on their presentation. \r\n\r\nIf the calling application is not a console, it has already got some kind of handling for displaying the output streams. Along with the ability to display a stream, comes the responsibility of rendering it sensibly.   If someone makes an application that shows a popup for every verbose message, they deserve that special place in hell where they must play \"punch the monkey\" but can never win.\r\n",
      "created_at": "2018-06-17T04:57:57Z",
      "updated_at": "2018-06-17T04:57:57Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "@StingyJack `Write-Progress` in PSCore6 was fixed awhile back to only update on a timer (rather than on every update) which improved perf significantly.",
      "created_at": "2018-06-18T15:36:33Z",
      "updated_at": "2018-06-18T15:36:33Z"
    },
    {
      "author": "ev-dev",
      "author_association": "NONE",
      "body": "Yikes! stumbled over here _way_ past the party but still just want to mention that this is definitely one of the random little inconsistencies of the core cmdlets that seems to have been thrown on the 'Some Day' pile (deservedly so), but now has been lost to the sands of time...\r\n\r\nConsidering the `Write-Host` cmdlet was given the `-NoNewline` switch for a reason, it seems pretty rational to me that the switch should belong in the parameters of all of the `Write-(Information|Warning|Verbose|Debug|Error)` cmdlets as well.\r\n\r\nIndeed, it's a pretty trivial feature, but I did find myself in a situation where I wanted to condense my console output as much as possible, but I also wanted to see info messages which I couldn't write to stream #1 (success) since I was relying storing return/output Objects in a variable.\r\n\r\nCould be an easy win for someone familiar with the codebase (wish I was)!",
      "created_at": "2022-05-13T20:50:22Z",
      "updated_at": "2022-05-13T20:50:22Z"
    }
  ],
  "created_at": "2018-01-03T13:27:45Z",
  "labels": [
    "Issue-Enhancement",
    "WG-Cmdlets-Utility"
  ],
  "number": 5779,
  "state": "open",
  "title": "Add a -NoNewLine to Write-Verbose",
  "updated_at": "2022-05-13T20:50:23Z"
}