{
  "_url": "https://github.com/PowerShell/PowerShell/issues/5792",
  "author": "bergmeister",
  "body": "## PR Summary\r\nMove definition of `Launch PowerShell` checkbox to the top to allow toggling it using the spacebar (the Enter key already defaults to the `Finish` button).\r\nThis is quite common amongst best practice WiX installers to make it possible to navigate through the dialogs without having to touch the mouse. This behvaiour is the same as the licence dialogue that allows toggling the checkbox using the space bar as well,\r\nThis does not affect the visual appearance.\r\nAlso reuse product name variable\r\n\r\n## PR Checklist\r\n\r\nNote: Please mark anything not applicable to this PR `NA`.\r\n\r\n- [x] [PR has a meaningful title](https://github.com/PowerShell/PowerShell/blob/master/.github/CONTRIBUTING.md#pull-request---submission)\r\n    - [x] Use the present tense and imperative mood when describing your changes\r\n- [x] [Summarized changes](https://github.com/PowerShell/PowerShell/blob/master/.github/CONTRIBUTING.md#pull-request---submission)\r\n- [x]  User facing [Documentation needed](https://github.com/PowerShell/PowerShell/blob/master/.github/CONTRIBUTING.md#pull-request---submission) This should go into the MSI document\r\n    - [ ] Issue filed - Issue link:\r\n- [x] [Change is not breaking](https://github.com/PowerShell/PowerShell/blob/master/.github/CONTRIBUTING.md#making-breaking-changes)\r\n- [ ] NA [Make sure you've added a new test if existing tests do not effectively test the code changed](https://github.com/PowerShell/PowerShell/blob/master/.github/CONTRIBUTING.md#before-submitting)\r\n    - [ ]  NA [Add `[feature]` if the change is significant or affectes feature tests](https://github.com/PowerShell/PowerShell/blob/master/docs/testing-guidelines/testing-guidelines.md#requesting-additional-tests-for-a-pr)\r\n- [x] This PR is ready to merge and is not [Work in Progress](https://github.com/PowerShell/PowerShell/blob/master/.github/CONTRIBUTING.md#pull-request---work-in-progress).\r\n    - If the PR is work in progress, please add the prefix `WIP:` to the beginning of the title and remove the prefix when the PR is ready.\r\n",
  "closed_at": "2018-01-06T07:53:46Z",
  "comments": [
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "It works. But I caught another problem: I install current build PowerShell-6.1.0-preview.7428-win-x64.msi over previous PowerShell-6.1.0-preview.7420-win-x64.msi and lost the local Explorer menu for PowerShell 😕 \r\n  ",
      "created_at": "2018-01-05T18:41:32Z",
      "updated_at": "2018-01-05T18:42:14Z"
    },
    {
      "author": "bergmeister",
      "author_association": "CONTRIBUTOR",
      "body": "@iSazonov : I cannot repro your problem. I installed `6.1.0-preview.7420-win-x64` first and then `6.1.0-preview.7436-win-x64` over it and the context menu is still there. Are you sure you did not forget to tick the checkbox again when installing it the 2nd time? Maybe it is missleading that the checkbox says `Add context menu` and the word `Add` should maybe be replaced with something like `Configure`. I might be able to change the behaviour but I would like to get clarification first what the expected behaviour should be when not checking the checkbox the 2nd time. I think what happens behind the scenes is that the upgrade uninstalls some things first (leading to the removal of registry entries) and then does the upgrade installation (one could almost say, it is a feature not a bug :stuck_out_tongue_winking_eye:).\r\nOne could argue for and against either case, e.g.:\r\n- Person A wants to upgrade PowerShell but this time decided (s)he does not want the context menu any more, so he/she does not tick the checkbox to get rid of it. In this case the current behaviour would be nice because otherwise the person has to uninstall and re-install just to get rid of the context menu.\r\n- Person B wants to only upgrade PowerShell but keep the current configuration without having to remember the configuration. In this case the current behaviour is not good.\r\n\r\nThe only way to fulfill both cases would be to detect that it is an upgrade install and set the defaults to the current configuration. This might be quite difficult and error prone to implement.\r\n  ",
      "created_at": "2018-01-05T22:19:45Z",
      "updated_at": "2018-01-05T22:24:16Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "@bergmeister I would defer worrying about those cases until there is sufficient feedback we need to support it (whichever case)",
      "created_at": "2018-01-06T01:05:18Z",
      "updated_at": "2018-01-06T01:05:18Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "@bergmeister Never mind, I used non-rebased branch.",
      "created_at": "2018-01-06T07:54:46Z",
      "updated_at": "2018-01-06T07:54:46Z"
    }
  ],
  "created_at": "2018-01-04T23:18:53Z",
  "number": 5792,
  "state": "closed",
  "title": "Windows installer: Allow `Launch PowerShell` checkbox to be toggled using the space bar (the Enter key already defaults to the `Finish` button)",
  "updated_at": "2018-01-06T07:54:46Z"
}