{
  "_url": "https://github.com/PowerShell/PowerShell/issues/5894",
  "author": "JamesWTruher",
  "body": "Tests are included to ensure that the assembly can be used to create a very simple cmdlet. I'll use this a the template to create the PowerShell Standard 5.1 assembly.\r\n\r\nThere is no actual implementation here, just the scaffolding of the classes, but this can be used to create assemblies (like cmdlet assemblies) which would then run against the actual code assembly. The expectation is that this source will be used to create the nupkg for distribution.\r\n\r\nThis also includes the source which was used for the PowerShell Standard 3.0 nuget package. The PowerShell Standard 3.0 assembly was initially created by jason, I'm including it in this PR to ensure that we keep track of it, since the compiled assembly is already available here: https://www.nuget.org/packages/PowerShellStandard.Library/3.0.0-preview-01",
  "closed_at": "2018-02-06T00:24:29Z",
  "comments": [
    {
      "author": "TravisEz13",
      "author_association": "MEMBER",
      "body": "- normally reference assemblies are included in a `ref` folder under `src`.  see:  https://github.com/dotnet/corefx/tree/master/src/System.Collections/ref  Is there a reason you put this in docs?\r\n- How are we going to build this?  \r\n- if it's going to be in the docs folder, an `md` file describing the project and how to use it would be appropriate.",
      "created_at": "2018-01-17T01:27:36Z",
      "updated_at": "2018-01-17T01:27:36Z"
    },
    {
      "author": "JamesWTruher",
      "author_association": "MEMBER",
      "body": "The decision was to create a repo for the PowerShellStandard rather than add it to this repo, so I'm closing this",
      "created_at": "2018-02-06T00:24:29Z",
      "updated_at": "2018-02-06T00:24:29Z"
    }
  ],
  "created_at": "2018-01-13T01:23:34Z",
  "number": 5894,
  "state": "closed",
  "title": "Create PowerShell Standard 6.0 reference assembly",
  "updated_at": "2018-02-06T00:24:29Z"
}