{
  "_url": "https://github.com/PowerShell/PowerShell/issues/5999",
  "author": "bergmeister",
  "body": "## PR Summary\r\n\r\nCloses #5979\r\n\r\nThis is an early working prototype on which I'd like to get feedback on please. It basically re-uses the existing custom dialog and adds 2 new checkboxes to run run `RegisterManifest.ps1` and `Enable-PSRemoting` (with the first one being ticked by default) using the installed pwsh.exe.\r\nQuestions to be discussed include e.g. how should pwsh.exe be called and how error should be handled. Currently PowerShell errors are getting ignored by WiX.\r\n\r\n## PR Checklist\r\n\r\nNote: Please mark anything not applicable to this PR `NA`.\r\n\r\n- [x] [PR has a meaningful title](https://github.com/PowerShell/PowerShell/blob/master/.github/CONTRIBUTING.md#pull-request---submission)\r\n    - [x] Use the present tense and imperative mood when describing your changes\r\n- [x] [Summarized changes](https://github.com/PowerShell/PowerShell/blob/master/.github/CONTRIBUTING.md#pull-request---submission)\r\n- [x] User facing [Documentation needed](https://github.com/PowerShell/PowerShell/blob/master/.github/CONTRIBUTING.md#pull-request---submission)\r\n    - [x] Issue filed - Issue link: https://github.com/PowerShell/PowerShell-Docs/issues/2007\r\n- [x] [Change is not breaking](https://github.com/PowerShell/PowerShell/blob/master/.github/CONTRIBUTING.md#making-breaking-changes)\r\n- [ ] [Make sure you've added a new test if existing tests do not effectively test the code changed](https://github.com/PowerShell/PowerShell/blob/master/.github/CONTRIBUTING.md#before-submitting)\r\n    - [feature] [Add `[feature]` if the change is significant or affects feature tests](https://github.com/PowerShell/PowerShell/blob/master/docs/testing-guidelines/testing-guidelines.md#requesting-additional-tests-for-a-pr)\r\n- [x] This PR is ready to merge and is not [Work in Progress](https://github.com/PowerShell/PowerShell/blob/master/.github/CONTRIBUTING.md#pull-request---work-in-progress). I think the recently introduced installer regression should be reverted first before merging this.\r\n    - If the PR is work in progress, please add the prefix `WIP:` to the beginning of the title and remove the prefix when the PR is ready.\r\n",
  "closed_at": "2018-02-22T14:07:11Z",
  "comments": [
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "Scenario - silent installation from command line or automation tools. In the case we should return an error if any from this options failed.",
      "created_at": "2018-01-24T14:54:17Z",
      "updated_at": "2018-01-24T14:55:43Z"
    },
    {
      "author": "bergmeister",
      "author_association": "CONTRIBUTOR",
      "body": "@iSazonov I agree, but would you swallow the error when being run via UI? Or should the user see only an informational message or should the error get reported as an error? Given that `Enable-PSRemoting` will throw in most scenarios (until we found a solution for it), should there be an additional MSI parameter that determines if errors get suppressed or not?\r\nAlso, I am wondering if this PR should be changed to add only the checkbox with adding the Windows event logging due to the current problems of `Enable-PSremoting`",
      "created_at": "2018-01-24T17:55:27Z",
      "updated_at": "2018-01-24T23:07:35Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "@bergmeister perhaps we can just scope this to Windows Event Logging registration and defer remoting",
      "created_at": "2018-01-25T01:16:22Z",
      "updated_at": "2018-01-25T01:16:22Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "Based on my silent scenario I believe UI should write an error (ex.: \"Run as Administrator\"), block next steps and rollback on pressing `Cancel`.",
      "created_at": "2018-01-25T04:18:52Z",
      "updated_at": "2018-01-25T04:18:52Z"
    },
    {
      "author": "bergmeister",
      "author_association": "CONTRIBUTOR",
      "body": "@SteveL-MSFT Just in time before the next pre-release.\r\n I decided to ignore the return value for the moment being because it sounds like you plan to add custom c# actions in the future that would give the possibility of showing a custom error message.\r\nSince the feature provided by the new checkboxes are optional, I think we do not need to require success but I will leave this decision up to you. This is the final result.\r\n![image](https://user-images.githubusercontent.com/9250262/36346107-d307f782-142f-11e8-937b-aae12bed76c4.png)\r\n",
      "created_at": "2018-02-17T22:15:30Z",
      "updated_at": "2018-02-17T22:22:42Z"
    },
    {
      "author": "bergmeister",
      "author_association": "CONTRIBUTOR",
      "body": "@iSazonov I added details about the added MSI properties to the referenced documentation issue but can you also please put the documentation label on this PR please",
      "created_at": "2018-02-28T12:45:09Z",
      "updated_at": "2018-02-28T12:45:09Z"
    },
    {
      "author": "DarwinJS",
      "author_association": "CONTRIBUTOR",
      "body": "Would be nice if the MSI property were more self explanatory like \"LOG_TO_EVENTLOG\"\r\n\r\nWhen I have to consult documentation to figure out the purpose of a varaible like this it feels like it does not follow \"code as documentation\" principles well enough.  But all the more so when it is a variable that users of will have absolutely no other context for (won't be looking at the code that uses it when they need to use it)",
      "created_at": "2018-05-03T12:10:23Z",
      "updated_at": "2018-05-03T12:12:01Z"
    },
    {
      "author": "DarwinJS",
      "author_association": "CONTRIBUTOR",
      "body": "It seems that the way the custom actions are written over these properties means that the configuration cannot be applied during an upgrade due to the condition \"Not Installed\".  Yet functionally there does not seem to be a reason to prevent them from running during upgrade.\r\n\r\nWhile the following condition is more complex, it should simply limit the actions from not running during \"complete uninstall\".  It also makes sure the action is not suppressed during an integrated major upgrade uninstall performed by \"RemoveExistingProducts\"\r\n\r\n```\r\nREMOVE ~= “ALL” AND NOT MaintenanceMode ~= “REMOVE” AND NOT UPGRADINGPACKAGECODE\r\n```\r\nThe code that these actions execute would also need to be internally idempotent - not mess up if the changes they make are already present.\r\n\r\nI dug through my snippet library to find that one - I also have one here that detects if the package is currently self-healing.",
      "created_at": "2018-05-04T02:42:37Z",
      "updated_at": "2018-05-04T02:45:27Z"
    }
  ],
  "created_at": "2018-01-23T23:16:18Z",
  "number": 5999,
  "state": "closed",
  "title": "Add options to enable PSRemoting and register Windows Event Logging Manifest to MSI installer",
  "updated_at": "2018-10-15T21:44:20Z"
}