{
  "_url": "https://github.com/PowerShell/PowerShell/issues/6030",
  "author": "TravisEz13",
  "body": "# Microsoft Security Advisory CVE-2018-0764\r\n\r\n## Denial of Service when parsing XML documents\r\n\r\n### Executive Summary\r\n\r\nMicrosoft is releasing this security advisory to provide information about a vulnerability in the open source versions of PowerShell Core.  This advisory also provides guidance on what developers can do to update their scripts and module correctly.\r\n\r\nMicrosoft is aware of a Denial of Service vulnerability in the open source versions of PowerShell Core when improper processing of XML documents by .NET Core occurs. An attacker who successfully exploited this vulnerability could cause a denial of service against a .NET application. A remote unauthenticated attacker could exploit this vulnerability by issuing specially crafted requests to an application using PowerShell to process requests.\r\n\r\nThe update addresses the vulnerability by correcting how .NET core handles XML document processing.\r\n\r\nSystem administrators are advised to update PowerShell Core to version 6.0.1. This version will also address CVE-2018-0786.\r\n\r\n\r\n## Affected Software\r\n\r\nThe vulnerability affects PowerShell Core prior to version `6.0.1`\r\n\r\n## Advisory FAQ\r\n\r\n### How do I know if I am affected?\r\n\r\nIf all of the following are true:\r\n\r\n1. Run `pwsh -v` (if, you cannot launch PowerShell Core using `pwsh` you are affected).  If the reported version starts with `6.0.0`, you are affected.\r\n1. You are using PowerShell to parse XML.\r\n\r\n### How do I update to an unaffected version?\r\n\r\nFollow the instructions at [Get PowerShell](https://github.com/PowerShell/PowerShell#get-powershell) to install the latest version of PowerShell Core.\r\n\r\n## Other Information\r\n\r\n### Reporting Security Issues\r\n\r\nIf you have found a potential security issue in PowerShell Core, please email details to secure@microsoft.com.\r\n\r\n### Support\r\n\r\nYou can ask questions about this issue on GitHub in the PowerShell organization. This is located at https://github.com/PowerShell/. The Announcements repo (https://github.com/PowerShell/Announcements) will contain this bulletin as an issue and will include a link to a discussion issue where you can ask questions.\r\n\r\n### What if the update breaks my script or module?\r\n\r\nYou can uninstall the newer version of PowerShell Core and install the previous version of PowerShell Core. This should be treated as a temporary measure. Therefore, the script or module should be updated to work with the patched version of PowerShell Core.\r\n\r\n### External Links\r\n\r\n[CVE-2018-0764](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2018-0764)\r\n",
  "closed_at": "2018-04-05T21:56:01Z",
  "comments": [],
  "created_at": "2018-01-25T21:58:11Z",
  "number": 6030,
  "state": "closed",
  "title": "Discussion: Microsoft Security Advisory CVE-2018-0764: Denial of Service when parsing XML documents",
  "updated_at": "2018-04-05T21:56:01Z"
}