{
  "_url": "https://github.com/PowerShell/PowerShell/issues/6031",
  "author": "TravisEz13",
  "body": "# Microsoft Security Advisory CVE-2018-0786\r\n\r\n## Security Feature Bypass in X509 Certificate Validation\r\n\r\n### Executive Summary\r\n\r\nMicrosoft is releasing this security advisory to provide information about a vulnerability in the open source versions of PowerShell Core 6.0. This advisory also provides guidance on what developers can do to update their scripts and module correctly.\r\n\r\nMicrosoft is aware of a security vulnerability in the open source versions of PowerShell Core where an attacker could present a certificate that is marked invalid for a specific use, but a .NET Core component uses it for that purpose. This action disregards the Enhanced Key Usage tagging.\r\n\r\nThe security update addresses the vulnerability by ensuring that .NET Core components completely validate certificates.\r\n\r\nSystem administrators are advised to update their PowerShell Core to version 6.0.1.  This version will also address CVE-2018-0764.\r\n\r\n## Affected Software\r\n\r\nThe vulnerability affects PowerShell Core prior to version `6.0.1`\r\n\r\n## Advisory FAQ\r\n\r\n### How do I know if I am affected?\r\n\r\nIf all of the following are true:\r\n\r\n1. Run `pwsh -v` (if, you cannot launch PowerShell Core using `pwsh` you are affected).  If the reported version starts with `6.0.0`, you are affected.\r\n1. You also use one of the .NET assemblies referenced in https://github.com/dotnet/announcements/issues/51\r\n\r\n### How do I update to an unaffected version?\r\n\r\nFollow the instructions at [Get PowerShell](https://github.com/PowerShell/PowerShell#get-powershell) to install the latest version of PowerShell Core.\r\n\r\n## Other Information\r\n\r\n### Reporting Security Issues\r\n\r\nIf you have found a potential security issue in PowerShell Core, please email details to secure@microsoft.com.\r\n\r\n### Support\r\n\r\nYou can ask questions about this issue on GitHub in the PowerShell organization. This is located at https://github.com/PowerShell/. The Announcements repo (https://github.com/PowerShell/Announcements) will contain this bulletin as an issue and will include a link to a discussion issue where you can ask questions.\r\n\r\n### What if the update breaks my script or module?\r\n\r\nYou can uninstall the newer version of PowerShell Core and install the previous version of PowerShell Core. This should be treated as a temporary measure. Therefore, the script or module should be updated to work with the patched version of PowerShell Core.\r\n\r\n### External Links\r\n\r\n[CVE-2018-0786](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2018-0786)\r\n\r\n",
  "closed_at": "2018-04-05T21:55:51Z",
  "comments": [
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "@TravisEz13 @SteveL-MSFT What about new \"Announcement\" (yellow)[ label](https://github.com/dotnet/core/labels/Announcement) if team want to discuss announcements in the repo? ",
      "created_at": "2018-01-26T11:12:54Z",
      "updated_at": "2018-01-26T11:13:12Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "@iSazonov good suggestion.  I'll add that label.",
      "created_at": "2018-01-26T20:18:31Z",
      "updated_at": "2018-01-26T20:18:31Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "To keep it consistent in our repo, I'm going to use `Issue-Announcement` with the same color as other Issue types.",
      "created_at": "2018-01-26T20:23:15Z",
      "updated_at": "2018-01-26T20:23:15Z"
    }
  ],
  "created_at": "2018-01-25T21:58:16Z",
  "labels": [
    "Resolution-Fixed",
    "Issue-Announcement"
  ],
  "number": 6031,
  "state": "closed",
  "title": "Discussion: Microsoft Security Advisory CVE-2018-0786: Security Feature Bypass in X509 Certificate Validation ",
  "updated_at": "2018-04-05T21:55:51Z"
}