{
  "_url": "https://github.com/PowerShell/PowerShell/issues/6047",
  "author": "Alextocode",
  "body": "Dear team, \r\n\r\nI am trying to find a solution for optimizing a script that I use at work to automatically build software packages.\r\n\r\nIn general there are different .exe and .zip files that are copied from a share into another share and later one zipped.\r\nBecause this is really slow I considered to try make it working with a workflow using foreach -parallel.\r\n\r\nMaybe you can tell me, what I am doing wrong.\r\n\r\nSteps to reproduce\r\n------------------\r\nHere is my code excerpt:\r\n```\r\nworkflow Copy-ItemParallel\r\n{\r\n param (\r\n [array]$sourceelements, [string]$destination)\r\n  {\r\n    foreach -parallel($element in $sourcelements)\r\n    {\r\n        Copy-Item -Path $element -Destination $destination -force\r\n    }\r\n }\r\n}\r\n```\r\nExpected behavior\r\n-----------------\r\nThe workflow can be executed when being called passing an array of source files and a unique destination path.\r\n\r\nActual behavior\r\n---------------\r\nI receive an error I do not really find something about when using Google.\r\nI am using a German Powershell so let me try to translate the error into English.\r\n\r\n_Workflow \"Copy-ItemParallel\" could not be started: The requested process (\"Create\", \"Get\" or \"Remove\") could not be executed, because the type \"JobSourceAdapter\" that is passed in the task definition (job definition) is not registered. You need to register the type \"JobSourceAdapter\" either via an explicit call or via using Cmdlet \"Import-Module\" and passing an assembly name._\r\n\r\n\r\n\r\nEnvironment data\r\n----------------\r\n\r\nPS C:\\WINDOWS\\system32> $PSVersionTable\r\n\r\nName                           Value                                                \r\n----                           -----                                                \r\nPSVersion                      5.1.16299.98                                         \r\nPSEdition                      Desktop                                              \r\nPSCompatibleVersions           {1.0, 2.0, 3.0, 4.0...}                              \r\nBuildVersion                   10.0.16299.98                                        \r\nCLRVersion                     4.0.30319.42000                                      \r\nWSManStackVersion              3.0                                                  \r\nPSRemotingProtocolVersion      2.3                                                  \r\nSerializationVersion           1.1.0.1     \r\n```\r\n",
  "closed_at": "2018-01-27T11:38:17Z",
  "comments": [
    {
      "author": "markekraus",
      "author_association": "CONTRIBUTOR",
      "body": "Hi @Alextocode ! this GitHub repository is for PowerShell Core (6.0.0 and newer) issues only.  For Windows PowerShell (5.1 and older) bug reporting please use the Windows PowerShell [UserVoice](https://windowsserver.uservoice.com/forums/301869-powershell). If you are not experiencing a bug and are looking for general assistance with using PowerShell, You might find the following resources helpful:\r\n\r\n* https://stackoverflow.com/questions/tagged/powershell\r\n* https://powershell.org/forums/\r\n* https://www.reddit.com/r/PowerShell/\r\n* http://slack.poshcode.org/\r\n\r\n\r\n",
      "created_at": "2018-01-27T11:38:17Z",
      "updated_at": "2018-01-27T11:38:17Z"
    },
    {
      "author": "Alextocode",
      "author_association": "NONE",
      "body": "Okay @markekraus I will have a look. I was not aware that this has been changed, a few months ago I was allowed to post a question/suggestion regarding PowerShell here and I had also 5.1",
      "created_at": "2018-01-27T11:42:54Z",
      "updated_at": "2018-01-27T11:42:54Z"
    },
    {
      "author": "markekraus",
      "author_association": "CONTRIBUTOR",
      "body": "In general, if the problem applies to 6.0.0 we can help here. However, WorkFlows have been deprecated and are no longer available beginning with 6.0.0. https://github.com/PowerShell/PowerShell/blob/master/docs/BREAKINGCHANGES.md#powershell-workflow",
      "created_at": "2018-01-27T11:46:23Z",
      "updated_at": "2018-01-27T11:46:23Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "@Alextocode Any file operations over network is always slow. You could use PowerShell remoting to run your scripts directly on remote systems.",
      "created_at": "2018-01-27T16:42:24Z",
      "updated_at": "2018-01-27T16:42:24Z"
    },
    {
      "author": "Alextocode",
      "author_association": "NONE",
      "body": "@markekraus  oha, this sounds interesting, but this means currently there is no real option for parallel processes in 6.0?\r\n\r\nI need to check also whether I can install PowerShell 6.0 on our servers anyway.",
      "created_at": "2018-01-27T17:04:39Z",
      "updated_at": "2018-01-27T17:04:39Z"
    },
    {
      "author": "Alextocode",
      "author_association": "NONE",
      "body": "@iSazonov Yep, but unfortunately the server is one of our main servers I won't get access to. Only my boss and our service admin got access there using the domain admin, it is blocked for all other IT admin users.\r\nTherefore I can't run a PSSession there.\r\nI fear I will have to keep it as it is. In general it does not hurt that much, because the scripts are executed once every morning to build the packages for the day. However since big packages take more than 2 minutes to be copied and zipped I wondered if there can be done some optimization.\r\nThe actual script execution time is only 0,5s :D although it does a lot of business logic using a PowerShell class, a cmdlet with dynamic parameters, bla bla bla :D",
      "created_at": "2018-01-27T17:07:22Z",
      "updated_at": "2018-01-27T17:07:22Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "You can connect from PowerShell Core to Windows PowerShell. Ah, you haven't permissions.\r\nI'd copy files to local host, zip them locally and then copy to remote shares in parallel.",
      "created_at": "2018-01-27T17:07:38Z",
      "updated_at": "2018-01-27T17:10:09Z"
    },
    {
      "author": "Alextocode",
      "author_association": "NONE",
      "body": "As far as I know to enter a PSRemote session there are credentials necessary to execute on the remote computer. As mentioned for the source server I don't have them, I can just access the share with my scripts.\r\nHowever I think I will do some more evaluation now, if there are some other options.",
      "created_at": "2018-01-27T17:10:26Z",
      "updated_at": "2018-01-27T17:10:26Z"
    },
    {
      "author": "markekraus",
      "author_association": "CONTRIBUTOR",
      "body": "@Alextocode There are several options for parallel processing in PowerShell, The 2 most common are Jobs (`Start-Job` and friends) and PowerShell Runspaces.",
      "created_at": "2018-01-27T21:21:48Z",
      "updated_at": "2018-01-27T21:21:48Z"
    }
  ],
  "created_at": "2018-01-27T11:12:30Z",
  "number": 6047,
  "state": "closed",
  "title": "Usage Question: Importing Assemblies for workflow.",
  "updated_at": "2018-02-04T09:53:59Z"
}