{
  "_url": "https://github.com/PowerShell/PowerShell/issues/6078",
  "author": "TravisEz13",
  "body": "We should only have one opt-out mechanism.  We should remove the file opt-out as it is not flexible enough for all situations.\r\n",
  "closed_at": "2018-04-13T17:29:40Z",
  "comments": [
    {
      "author": "daxian-dbw",
      "author_association": "MEMBER",
      "body": "I agree that we should only have one way to opt-out. If .NET Core uses the environment variable only, then we should do the same.",
      "created_at": "2018-02-01T02:34:59Z",
      "updated_at": "2018-02-01T02:34:59Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "I agree - we should not litter the home folder.\r\n\r\nI'd also cosider Enterprises - I believe they want use GPO for Windows. Most MSFT products have such registry keys to turn on/off telemetry.",
      "created_at": "2018-02-01T04:02:11Z",
      "updated_at": "2018-02-01T11:49:14Z"
    },
    {
      "author": "thezim",
      "author_association": "CONTRIBUTOR",
      "body": "Is opting out an option during the install now? Personally I would prefer to have to opt in.\r\n\r\n@iSazonov environment variables are stored in the in registry so this shouldn't be an issue.\r\n\r\nMy only concern that users can typically override system environment variables with there user environment variables in controlled enterprises. Only looking for variables value may allow users to override system level policy for telemetry.",
      "created_at": "2018-02-01T23:16:59Z",
      "updated_at": "2018-02-02T00:07:25Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "@thezim \r\n> environment variables are stored in the in registry so this shouldn't be an issue.\r\n\r\nWe can set environment variable by GPP but security men require _forced security policy_.",
      "created_at": "2018-02-02T03:31:58Z",
      "updated_at": "2018-02-02T03:31:58Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "Let's be clear that any new telemetry will likely be opt-in and be described in a RFC.  The current basic startup telemetry we have now helps provide data of PSCore6 adoption and determines if we increase or decrease our investments.  Since we ship packages outside of GitHub, we can't just track download numbers (which are unreliable anyways).",
      "created_at": "2018-02-02T04:55:22Z",
      "updated_at": "2018-02-02T04:55:22Z"
    }
  ],
  "created_at": "2018-01-31T18:18:27Z",
  "number": 6078,
  "state": "closed",
  "title": "remove file opt-out from telemetery and only use environment variable",
  "updated_at": "2018-04-13T18:43:56Z"
}