{
  "_url": "https://github.com/PowerShell/PowerShell/issues/6083",
  "author": "davidmthomsen",
  "body": "I'm just wondering what I would need to do to import the Active Directory module into Powershell Core. I tried Import-Module ActiveDirectory but I'm sure there is more needed. \r\n\r\n<!-- provide the output of $PSVersionTable -->\r\n\r\n```powershell\r\n> $PSVersionTable\r\n$PSVersionTable                                                                                                                                                                                                              \r\n\r\nName                           Value                                                                                                                                                                                                         \r\n----                           -----                                                                                                                                                                                                         \r\nPSVersion                      6.0.0                                                                                                                                                                                                         \r\nPSEdition                      Core                                                                                                                                                                                                          \r\nGitCommitId                    v6.0.0                                                                                                                                                                                                        \r\nOS                             Darwin 16.7.0 Darwin Kernel Version 16.7.0: Thu Jan 11 22:59:40 PST 2018; root:xnu-3789.73.8~1/RELEASE_X86_64                                                                                                 \r\nPlatform                       Unix                                                                                                                                                                                                          \r\nPSCompatibleVersions           {1.0, 2.0, 3.0, 4.0...}                                                                                                                                                                                       \r\nPSRemotingProtocolVersion      2.3                                                                                                                                                                                                           \r\nSerializationVersion           1.1.0.1                                                                                                                                                                                                       \r\nWSManStackVersion              3.0  \r\n```\r\n",
  "closed_at": "2018-02-01T11:48:28Z",
  "comments": [
    {
      "author": "SwarfegaGit",
      "author_association": "CONTRIBUTOR",
      "body": "The AD module doesn't work in Core.  I believe teams responsible for existing modules that work on Windows PowerShell are working on new versions but they are not yet available.\r\n\r\nYou should be able to work around this though if you are able to create a session to a remove Windows machine that has the module installed.  A Windows 7 machine with RSAT installed for example.\r\n\r\n````powershell\r\nImport-PSSession -Session (New-PSSession -ComputerName WindowsServer01) -Module Import-Module ActiveDirectory\r\n````\r\n\r\nFrom this point you can run the AD cmdlets from Core but they are actually being executed on the remote computer.",
      "created_at": "2018-02-01T09:07:57Z",
      "updated_at": "2018-02-01T09:10:04Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "I can confirm that ActiveDirectory module is not compatible with PowerShell Core at all and we have to wait new ActiveDirectory module version.",
      "created_at": "2018-02-01T11:48:28Z",
      "updated_at": "2018-02-01T11:48:28Z"
    },
    {
      "author": "davidmthomsen",
      "author_association": "NONE",
      "body": "Just wondering if a new ActiveDirectory module version has been created? Would love to be able to use PsLoggedon on a Mac. ",
      "created_at": "2018-07-06T17:08:45Z",
      "updated_at": "2018-07-06T17:08:45Z"
    },
    {
      "author": "markekraus",
      "author_association": "CONTRIBUTOR",
      "body": "@davidmthomsen The PowerShell team have been working with the AD team on it. @SteveL-MSFT demoed a PowerShell Core native version of the ActiveDirectory module in the May PowerShell Community Call. As far as I know, it has not been released yet. Also, it may only be available on Windows as the APIs for DirectoryServices in .NET Core are only available in the Windows Compatibility Pack. It might be that way until .NET Core includes a x-plat implementation. Steve might have more info on that.",
      "created_at": "2018-07-06T17:15:08Z",
      "updated_at": "2018-07-06T17:15:08Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "https://twitter.com/Steve_MSFT/status/1016438391687147520",
      "created_at": "2018-07-09T21:50:57Z",
      "updated_at": "2018-07-09T21:50:57Z"
    },
    {
      "author": "justinhauer",
      "author_association": "NONE",
      "body": "@SteveL-MSFT has there been any headway on this in the last month? When I try to import the active directory module I have no luck, just errors",
      "created_at": "2018-08-26T22:48:41Z",
      "updated_at": "2018-08-26T22:48:41Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "@jdogg89 what build of Win10 are you using and what build of PSCore6.1?",
      "created_at": "2018-08-30T00:24:47Z",
      "updated_at": "2018-08-30T00:24:47Z"
    },
    {
      "author": "LuizHAP",
      "author_association": "NONE",
      "body": "@SteveL-MSFT i can't import ActiveDirectory in Windows 7 Build 7601. I got the same error",
      "created_at": "2018-10-04T13:14:57Z",
      "updated_at": "2018-10-04T13:14:57Z"
    },
    {
      "author": "SwarfegaGit",
      "author_association": "CONTRIBUTOR",
      "body": "@luizhap that's correct. Windows 7 won't get this feature with PowerShell Core.",
      "created_at": "2018-10-04T13:42:05Z",
      "updated_at": "2018-10-04T13:42:05Z"
    },
    {
      "author": "MaximoTrinidad",
      "author_association": "NONE",
      "body": "New Windows 10 Client and Servers supported moving forward.\r\nFYI - Windows 7 EOL (End-Of-Life), support ends on January 14th 2020\r\n\r\n:)",
      "created_at": "2018-10-04T16:07:25Z",
      "updated_at": "2018-10-04T16:07:25Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "For those that want to use ActiveDirectory module on Windows older than the Oct 2018 update with PSCore6, you can use https://www.powershellgallery.com/packages/WindowsCompatibility ",
      "created_at": "2018-10-04T16:21:11Z",
      "updated_at": "2018-10-04T16:21:11Z"
    },
    {
      "author": "rayterrill",
      "author_association": "NONE",
      "body": "Is this still not available in PS Core? I see the GA of the Windows Compatibility Module, but wondering if this is available straight up in PS Core yet. Also, is there a place where we can check compatibility of modules with PS Core? I see lots MS blog posts touting compatibility numbers, but no links to something that shows what’s been converted, when, and what remains.",
      "created_at": "2018-11-17T16:38:51Z",
      "updated_at": "2018-11-17T16:38:51Z"
    },
    {
      "author": "justinhauer",
      "author_association": "NONE",
      "body": "I was trying to run the ps core docker image based on Ubuntu to run this in kubernetes. It was impossible to import the AD modules and make what I wanted to work so I just shelfed my work on this... Maybe you can import the AD module now...",
      "created_at": "2018-11-17T16:49:41Z",
      "updated_at": "2018-11-17T16:49:41Z"
    },
    {
      "author": "rayterrill",
      "author_association": "NONE",
      "body": "@jdogg89 I have this working now on PS Core on Ubuntu 16.04 but it’s kludgy as hell. :) WinRM/SSH into a DC, run “PowerShell” to get a full PowerShell .NET, then run the AD cmdlets (this is part of our Terraform process with a custom AD provider).",
      "created_at": "2018-11-17T17:27:08Z",
      "updated_at": "2018-11-17T17:27:08Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "To port a module it is necessarily to port underlying APIs. Currently .Net Core haven't ported APIs for LDAP and it is impossible to port AD module. \r\nIf an API already ported each product group makes a decision about porting their module - there is no general plan.",
      "created_at": "2018-11-17T18:27:53Z",
      "updated_at": "2018-11-17T18:27:53Z"
    },
    {
      "author": "rayterrill",
      "author_association": "NONE",
      "body": "For me it’s less about timeline as far as forecasting future than when something was ported over historically and at what version number, so we can make sure we haven’t missed anything and upgrade. Also would be super helpful to see what has been ported and what hasn’t so we can keep track of that as things are ported over.",
      "created_at": "2018-11-17T19:24:08Z",
      "updated_at": "2018-11-17T19:24:08Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "@rayterrill if you want to use the AD Module from Linux, you can install SSH on Windows, then establish the PSSession, and use Import-PSSession to have proxy cmdlets you run locally on your Linux machine.  With PSCore6.1 as the SSH endpoint (rather than Windows PowerShell).\r\n\r\n@joeyaiello perhaps you can author a blog post on the specific modules that work on what build of Windows",
      "created_at": "2018-11-17T20:06:39Z",
      "updated_at": "2018-11-17T20:06:39Z"
    },
    {
      "author": "rayterrill",
      "author_association": "NONE",
      "body": "@SteveL-MSFT I'll look into. We're currently doing something similar - WinRM'ing into a Windows machine with PSCore6.1 as the SSH endpoint, then running powershell 'WHATEVER WE WANT TO RUN' in the context of that PSCore6.1/SSH session so it runs under full .NET powershell vs PSCore. Kludgy, but it works currently.\r\n\r\nWould love a blog post from @joeyaiello or anyone else on the specific modules that work and on what build of windows - even0 just the BIG ones that DON'T currently work and the workarounds you need to do to make them work would be ideal for our use case (thinking AD, DNS, etc).",
      "created_at": "2018-11-18T02:49:12Z",
      "updated_at": "2018-11-18T02:49:12Z"
    },
    {
      "author": "mkuendig",
      "author_association": "NONE",
      "body": "@SteveL-MSFT Has there been any news to AD on powershell core? Or PS7? We tried with PS7rc2 on centos8 but couldn't get it to work. We have added windows compatibility, see the AD module but it won't install. Any tips to that? Thanks! (we would like standalone AD access from a linux VM, no windows available there, except the AD box, which is managed and we don't have access to it).",
      "created_at": "2020-02-14T07:54:52Z",
      "updated_at": "2020-02-14T07:55:55Z"
    },
    {
      "author": "doctordns",
      "author_association": "COLLABORATOR",
      "body": "The Active Directory module works fine natively in PowerShell 7 RC in Windows. The AD Deployment module does NOT work natively, but works fine using the Win32 Compat solution. I have tested both extensively for a book I am working on.  To use the module on Linux tou need to remote in to a DC.",
      "created_at": "2020-02-14T09:32:02Z",
      "updated_at": "2020-02-14T09:33:29Z"
    },
    {
      "author": "mkuendig",
      "author_association": "NONE",
      "body": "thanks @doctordns Won't work for us, we can't remote into the DC. We won't get access to PS on that managed AD. So we need a native AD solution that runs on Linux. Our use-case is very simple. We want to create a new user in AD from a linux VM.",
      "created_at": "2020-02-14T10:33:35Z",
      "updated_at": "2020-02-14T10:34:40Z"
    },
    {
      "author": "doctordns",
      "author_association": "COLLABORATOR",
      "body": "This is where you need JEA. With JEA, you:\r\n1. Create a security group in the AD and populate it\r\n2. Create a Role Definition - what commands/aliases etc should be available to someone in that role.\r\n3. Create a session definition - this defines which groups can assess which roles.\r\n4. Create an endpoint for this session definition.\r\n\r\nOnce set up, you can use Invoke-Command or Enter-PSSession and have a session restricted to the commands you are allowed.  \r\n\r\nOr why not just use Linux virtualisation, and create/run a Windows Server and run the tools from there.  ",
      "created_at": "2020-02-14T10:42:12Z",
      "updated_at": "2020-02-14T10:42:12Z"
    },
    {
      "author": "MaximoTrinidad",
      "author_association": "NONE",
      "body": "@doctordns \r\n\r\nJEA is a good tool!\r\n\r\nBut, unless I'm mistaken, I understand that JEA it's only for Windows PowerShell.  \r\nI haven't heard anything about the efforts to convert/migrate to PowerShell Core.\r\n\r\n:)",
      "created_at": "2020-02-14T14:47:56Z",
      "updated_at": "2020-02-14T14:48:19Z"
    },
    {
      "author": "doctordns",
      "author_association": "COLLABORATOR",
      "body": "I keep forgetting JEA is WIndows only.!\r\n\r\nSo to summarise, the OP has two options I can see:\r\n1. Remote directly into the DC and make use of Implicit Remoting.\r\n2. Use a 'jump box' approach - remote into a WIndows Server 2019 box that has the AD module loaded. You'll need CredSSP installed though.",
      "created_at": "2020-02-14T15:57:13Z",
      "updated_at": "2020-02-14T15:57:13Z"
    }
  ],
  "created_at": "2018-02-01T02:46:48Z",
  "number": 6083,
  "state": "closed",
  "title": "Import-Module ActiveDirectory",
  "updated_at": "2020-02-14T15:57:13Z"
}