{
  "_url": "https://github.com/PowerShell/PowerShell/issues/643",
  "author": "andschwa",
  "body": "OMI and the PSRP provider need to be packaged appropriately such that the PowerShell packages can depend on them. OMI must be aware of the location of PowerShell (currently packaged to `/usr/local/share/powershell`).\n- [x] Package PowerShell\n- [ ] ~~Build new packages for OMI, blocked on Microsoft/omi#27~~\n- [ ] ~~Package PSRP provider~~\n- [ ] Setup Ubuntu package feed\n",
  "closed_at": "2016-07-05T19:05:52Z",
  "comments": [
    {
      "author": "KrisBash",
      "author_association": "CONTRIBUTOR",
      "body": "We’ve done a lot of work to get to a point where we only have one OMI daemon on the system for all use cases (SC, DSC, OMS). I think it’s desirable to make sure that any necessary changes to OMI get into the upstream OMI and we use the existing OMI packages for this. Is that consistent with your plans?\n",
      "created_at": "2016-03-08T19:45:26Z",
      "updated_at": "2016-03-08T19:45:26Z"
    },
    {
      "author": "andschwa",
      "author_association": "MEMBER",
      "body": "Yes, we would intend to keep just one OMI daemon, and integrate the PSRP feature changes into OMI's master branch.\n\nIf I can easily updated the existing OMI packages, that would be great. I'll work with @niroyb on this.\n\n@KrisBash what is the status of Microsoft/omi#24?\n",
      "created_at": "2016-03-08T19:52:45Z",
      "updated_at": "2016-03-08T19:52:45Z"
    },
    {
      "author": "andschwa",
      "author_association": "MEMBER",
      "body": "I've seen OMI packages, just need to figure out how to create them outside of other projects. @jeffaco, @niroyb pointed me to `installbuilder`, but I can't find any script or make target to produce a deb/rpm for OMI, do you know how?\n",
      "created_at": "2016-03-14T18:16:59Z",
      "updated_at": "2016-03-14T18:16:59Z"
    },
    {
      "author": "jeffaco",
      "author_association": "NONE",
      "body": "We have no builder of OMI packages that can be run stand-alone. Well, sort of.\n\nThe actual installbuilder files for OMI are checked into OMI itself. But you need to be careful on how to configure OMI to work with our products. Otherwise, you can have an OMI that installs into \"our\" directory (/opt/omi), yet it won't work with our products. That would be a disaster.\n\nThere are only two places that I'm aware of where this is actually built: SCX and DSC.\n\nBoth are fairly light-weight projects. If you just did a \"configure --enable-ulinux; make\" in SCXcore, you'd get what you needed. But if you were willing to check out SCXcore, I could give you a few targeted commands to JUST build OMI.\n\nIs that enough for you? Or do you need something more?\n\nWhat if you took any of the output packages up on the build share for SCX, and ran the shell bundle with `--extract`. If you did this, you'd get an up-to-date version of OMI as well (from the master branch).\n\nI'd suggest you stop by, tell me exactly what you need, and I'll work with you to satisfy your needs.\n",
      "created_at": "2016-03-14T21:00:30Z",
      "updated_at": "2016-03-14T21:00:30Z"
    },
    {
      "author": "andschwa",
      "author_association": "MEMBER",
      "body": "Ideally, we wouldn't take a dependency on SCXCore or DSC in order to build an OMI package for PowerShell. My goal is to get an OMI \"2.0\" Debian package that the PowerShell package and @paulcallen's PSRP provider can take a dependency on. Thus a `master` branch build isn't enough; I need to make one for the `psrp/features` branch (and be able to make new ones as it gets updated).\n\nIt sounds like OMI is incapable of producing its own packages, is this something we can remedy?\n",
      "created_at": "2016-03-14T21:09:45Z",
      "updated_at": "2016-03-14T21:09:45Z"
    },
    {
      "author": "jeffaco",
      "author_association": "NONE",
      "body": "I could give you specific 'make' instructions on how to build OMI. Note that you would need to take a dependency on project \"pal\" (this is a public repo), as that's where installbuilder happens to live. If we moved that, that would impact a bunch of projects (SCXcore, dsc, apache, mysql, ...)\n\n@KrisBash Are you okay with PowerShell building OMI themselves, assuming they use identical build steps to what SCXcore does?\n",
      "created_at": "2016-03-14T21:22:57Z",
      "updated_at": "2016-03-14T21:22:57Z"
    },
    {
      "author": "andschwa",
      "author_association": "MEMBER",
      "body": "@KrisBash Can you follow up?\n",
      "created_at": "2016-03-23T22:32:58Z",
      "updated_at": "2016-03-23T22:32:58Z"
    },
    {
      "author": "andschwa",
      "author_association": "MEMBER",
      "body": "@TravisEz13 adding you as an assignee.\n",
      "created_at": "2016-06-15T20:05:57Z",
      "updated_at": "2016-06-15T20:05:57Z"
    },
    {
      "author": "andschwa",
      "author_association": "MEMBER",
      "body": "This issue is covering several things that should be separate. OMI and PSRP packages are being discussed externally in email threads with @paulcallen, @jeffaco, and @palladia; I'll let them figure out tracking. Separately from that, package feeds for PowerShell don't seem to be in our scope any more, I believe the intention is to ship the packages in the official feeds. @joeyaiello, @KrisBash, is this right?\n",
      "created_at": "2016-06-24T16:55:08Z",
      "updated_at": "2016-06-24T16:55:08Z"
    },
    {
      "author": "andschwa",
      "author_association": "MEMBER",
      "body": "Until @KrisBash can resolve the questions around official feeds, I'm closing this with #1279.\n",
      "created_at": "2016-07-05T19:05:52Z",
      "updated_at": "2016-07-05T19:05:52Z"
    }
  ],
  "created_at": "2016-03-08T18:29:48Z",
  "number": 643,
  "state": "closed",
  "title": "Setup package feed",
  "updated_at": "2016-07-05T19:05:52Z"
}