{
  "_url": "https://github.com/PowerShell/PowerShell/issues/6639",
  "author": "DarwinJS",
  "body": "I was talking to @BrucePay about the idea of supporting [bool]\"false\" resolving to the boolean value $False.\r\n\r\nThis mainly affects when calling PowerShell scripts from DSLs and other shells.  There is no problem with this when calling a powershell script from powershell as it understands it's own boolean type.\r\n\r\nI am mainly interested in [bool]\"false\" resolving to $False.  I don't have strong feelings on whether to change the behavior [bool]\"anyotherstring\" resolving to \"true\".\r\n\r\nThese are some of the issues this would seem to help with:\r\n- DSLs that commonly use the string \"true\" when they do not have a true boolean (e.g. CloudFormation)\r\n- The problem of passing booleans across shells because there is no standard \"boolean\" type between shells\r\n- The problem of composing powershell command lines in code that use powershell switches - omitting or including the switch depending on the desired result is a pain.  Being able to always specify the switch , but control it's value with a variable makes things a lot less complex.\r\n\r\nIn some cases this *could* be resolved with using 0 and 1 - but the other problem is extant code and coding skills - for example for me to get everyone in our huge organization to change their true / false strings to 0 and 1 is a monumental effort that would never fully take.  Just fixing this in PowerShell would mean not having to re-code people's defacto practices.",
  "closed_at": null,
  "comments": [
    {
      "author": "mklement0",
      "author_association": "CONTRIBUTOR",
      "body": "> I don't have strong feelings on whether to change the behavior [bool]\"anyotherstring\" resolving to \"true\".\r\n\r\nCertainly in _implicit_ Boolean conversions it is important to retain the existing behavior, because simply using a command's output - which may be a string, notably always one when calling external utilities - as an implicit conditional for \"Was there any output?\" is a common idiom (`if (<command>) ...`)\r\n\r\nWith respect to _explicit_ Boolean conversions (casts):  At least personally I've written code such as `$hadOutput = [bool] (<command>)`, so a string other than `'true'` / `'false'` breaking the cast is problematic.\r\n\r\nThus, one approach would be to simply special-case string `'false'` (and its case variants) and convert that to `$False`, while keeping the existing empty/non-empty dichotomy in all other cases.\r\n\r\nThat has the advantage of not needing to introduce a potentially awkward distinction between implicit and explicit (cast-based) conversions.\r\n\r\nTechnically, it's a breaking change, but it probably falls into [Bucket 3: Unlikely Grey Area](https://github.com/PowerShell/PowerShell/blob/master/docs/dev-process/breaking-change-contract.md#bucket-3-unlikely-grey-area).\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
      "created_at": "2018-04-14T14:33:30Z",
      "updated_at": "2018-04-14T14:33:30Z"
    },
    {
      "author": "markekraus",
      "author_association": "CONTRIBUTOR",
      "body": "I have run into situations where I thought this would be excellent, bu I have also run into situations where this would have been breaking.\r\n\r\nThe breaking examples are those that work on the `$null` possibility where there is a tri-state `\"true\"`/`\"false\"`/`$null` on a string result. \r\n\r\n```powershell\r\nif($result){\r\n    $IsSet = $true\r\n    $IsTrue = [Bool]::Parse($result)\r\n} else {\r\n    $isSet= $false\r\n}\r\n```\r\n\r\nI think it was the Reddit API where I was having to do that because it returns string literals instead of Boolean literals and the condition is different whether the string is present or not (bad API design... gripe for another day). In any case, I'm not sure if this proposed change would actually break that or not. if the string is `\"false\"` and the condition coerces the string to boolean false, code that depended on the existence of string to return true would break. But I did want to point out that this would be a breaking change and I think it is a steep above bucket 3.\r\n\r\nThat said, I'm on board with this change even though I know it will break my code.",
      "created_at": "2018-04-14T16:18:00Z",
      "updated_at": "2018-04-14T16:18:00Z"
    },
    {
      "author": "DarwinJS",
      "author_association": "CONTRIBUTOR",
      "body": "Interesting use case. I guess you could move the coercion from the parameter to a compare statement and you would be able to preserve the string but retain a true Boolean compare?",
      "created_at": "2018-04-14T17:05:38Z",
      "updated_at": "2018-04-14T17:05:38Z"
    },
    {
      "author": "markekraus",
      "author_association": "CONTRIBUTOR",
      "body": "Yea, there are workarounds like switching to `[String]::IsNullOrEmpty()`.\r\n\r\nI've seen this elsewhere but I can't remember any specific instances. In any case, it will break any situation where a conditional is being done on a string that may potentially be `\"false\"` (assuming conditionals coerce to a boolean). Code that used to go one path would now go another. I'm not really sure how to do some analytics to see how prevalent an issue it would be. I think it would be a step above rare though.\r\n\r\nOn the other hand. I have also run into code that was already going the wrong path because the author assumed `\"false\"` would be `$false`.. so this change may actually fix some already broken code. 🤣 ",
      "created_at": "2018-04-14T17:13:22Z",
      "updated_at": "2018-04-14T17:31:30Z"
    },
    {
      "author": "DarwinJS",
      "author_association": "CONTRIBUTOR",
      "body": "@markekraus  - you comment brings up that I should clarify I am advocating that the cast only work on the EXACT string \"false\" (case insensitive) - not on a substring that finds that value in the string.  I assumed this is how a cast of a string would work - but clarifying in case that assumption is incorrect.",
      "created_at": "2018-04-14T17:29:07Z",
      "updated_at": "2018-04-14T17:29:07Z"
    },
    {
      "author": "markekraus",
      "author_association": "CONTRIBUTOR",
      "body": "I used \"contain\" because I think of strings and variables as containers. I have updated it to the following:\r\n\r\n>  In any case, it will break any situation where a conditional is being done on a string that may potentially be `\"false\"` (assuming conditionals coerce to a boolean).",
      "created_at": "2018-04-14T17:32:50Z",
      "updated_at": "2018-04-14T17:33:02Z"
    }
  ],
  "created_at": "2018-04-12T18:33:26Z",
  "labels": [
    "Issue-Enhancement",
    "WG-Language"
  ],
  "number": 6639,
  "state": "open",
  "title": "[bool]\"false\" and [bool]\"true\"",
  "updated_at": "2018-04-14T17:33:02Z"
}