{
  "_url": "https://github.com/PowerShell/PowerShell/issues/6652",
  "author": "rjmholt",
  "body": "#### Meta-issue to track work on improving the experience of PowerShell class usage as much as possible.\r\n\r\n## Note on By-Design Behaviours\r\n\r\nPowerShell classes currently are a bit finnicky. Some of this is a necessary pain because of the design constraints behind classes.\r\n\r\nClasses are currently implemented as compiling to .NET IL so that we can take advantage of the .NET object model. Not doing this would mean us reinventing (and having to maintain) the wheel on essentially all object-oriented features available in .NET (or anywhere else) and paying a high runtime overhead on shimming compatibility with the .NET object model (e.g. faking inheritance from .NET classes).\r\n\r\nInstead, we compile PowerShell classes to dynamic assemblies and bake in calls to PowerShell in the generated IL. To do this at runtime would mean either breaking dynamic- and module-scoped behaviours in classes, or emitting a new dynamic assembly every time we hit a class definition (and since PowerShell's highest compilation unit is the scriptblock, and scriptblocks are permitted in for-loops, the performance penalty here could be extreme). (I'm still a bit hazy on the details about the mechanisms here, especially in terms of why caching is made impossible by module scope or in comparison to `Add-Type`, but @daxian-dbw or @lzybkr will be able to add to/correct me).\r\n\r\nThe need to compile classes at parse-time means the types required to define a class (in IL) must also be known at parse-time. The module-scoping issue means that a `using module` statement is required to import classes from modules (@daxian-dbw might like to add information here about the specifics governing this need), or by exporting class usage in PowerShell functions (classes having a sort of module-private behaviour).\r\n\r\n## Issues to Improve\r\n\r\nThere are, however, a few improvements possible to PowerShell classes that might not run up against the design constraints given above. Below is a list of open issues for classes in PowerShell.\r\n\r\n### Classes in modules\r\n- [ ] #2449 Exporting classes in PS modules consistently.\r\n- [ ] #2505 Classes in nested modules are not updated by `Import-Module -Force`.\r\n- [ ] #2962 Using `ScriptsToProcess` with `using module` stops classes from being imported\r\n- [ ] #2964 `using module` imports nested module classes in a script but not interactively.\r\n- [ ] #4112 `using module` doesn't load classes when `FunctionToExport` or `CmdletToExport` are specified in the `.psd1`\r\n- [ ] #4114 `using module` does not find classes in nested modules.\r\n- [ ] #4713 PS classes cannot invoke non-exported functions from their module (possibly a `New-Module` problem).\r\n- [ ] #6293 Making PS classes exportable module members.\r\n\r\n### Type errors\r\n- [ ] #1762 Custom attributes can't be defined and used in the same PS module\r\n- [x] ~~#2074 Types not available at parse-time used in PS class bodies cause parse errors. @daxian-dbw noted that we need some types at parse-time (such as method return type) to generate the IL, but type resolution inside method/constructor scriptblocks may not be needed and be more appropriate at runtime.~~ Noted as by design.\r\n- [ ] #3641 Type availability at parse-time. Need to implement the metadata reader (#6653).\r\n- [ ] See also: [PSScriptAnalyzer #850](https://github.com/PowerShell/PSScriptAnalyzer/issues/850)\r\n\r\n### Other bugs\r\n- [ ] #2224 Some class errors occur at runtime when they can be detected at parse-time. (We may want to loosen the error-checking behaviour here if it makes sense to do so).\r\n- [ ] #2963 `New-Object` does not work for PS classes as it does for .NET classes.\r\n- [ ] #5337 PS Classes in collectible assemblies cause XML serialisation problems.\r\n- [x] #7622 `protected internal` override doesn't work (program diverges on method call).\r\n- [ ] #8235 Properties and methods with the same name are permitted in a declaration, but attempting to call the method results in an error that no such method exists.\r\n\r\n### New feature requests\r\n- [ ] #2223 Interface declarations\r\n- [ ] #2485 Validation attributes for PS classes\r\n- [ ] #2876 `static extern` methods and struct definition in PowerShell\r\n- [ ] #5099 Static class member imports\r\n- [ ] #6418 Other proposed class extensions.\r\n- [x] #8028 Support `enum` types other than `Int32`\r\n\r\nA couple of other resources on these issues:\r\n- @devblackops' talk on issues with PS classes: [video](https://www.youtube.com/watch?v=i1DpPU_xxBc&list=PLfeA8kIs7CocGXuezOoYtLRdnK9S_Mq3e), [code](https://github.com/devblackops/pssummit2018-classes).\r\n- The SAPIEN page on the `using` statement: [here](https://info.sapien.com/index.php/scripting/scripting-classes/import-powershell-classes-from-modules).",
  "closed_at": null,
  "comments": [
    {
      "author": "sancarn",
      "author_association": "NONE",
      "body": "Have `override` methods been suggested?\r\n\r\nFor example I have had to implement GUIs while [overriding the WndProc method](https://gist.github.com/sancarn/00e44231eba3ac20123e10601f236175#windows-message-loop) before. So a way to override methods would be a great addition to Powershell classes.\r\n\r\nEdit:\r\n----\r\nI noticed #6418 suggested overriding property setters and getters. I suppose that is similar to this.",
      "created_at": "2018-05-05T22:57:04Z",
      "updated_at": "2018-05-05T22:57:43Z"
    },
    {
      "author": "christru",
      "author_association": "NONE",
      "body": "Is there any community projects that work around these issues for example? I cannot for the life of me get a decent project implemented in PS w/ classes broken out into a sensible manner without running into one of the above issues..",
      "created_at": "2018-05-16T04:27:33Z",
      "updated_at": "2018-05-16T04:27:33Z"
    },
    {
      "author": "devblackops",
      "author_association": "CONTRIBUTOR",
      "body": "@christru You can take a look at my PoshBot module here: https://github.com/poshbotio/PoshBot\r\n\r\nThat module is almost entirely PowerShell class based.",
      "created_at": "2018-05-16T05:55:32Z",
      "updated_at": "2018-05-16T05:55:32Z"
    },
    {
      "author": "christru",
      "author_association": "NONE",
      "body": "@devblackops as I’m litterally watching your YouTube video talk on classes.  Thanks buddy!",
      "created_at": "2018-05-16T05:57:59Z",
      "updated_at": "2018-05-16T05:57:59Z"
    },
    {
      "author": "devblackops",
      "author_association": "CONTRIBUTOR",
      "body": "@christru Cool. I did the same talk at the PowerShell Summit. It is a more polished version. https://www.youtube.com/watch?v=i1DpPU_xxBc&list=PLfeA8kIs7CocGXuezOoYtLRdnK9S_Mq3e",
      "created_at": "2018-05-16T06:00:24Z",
      "updated_at": "2018-05-16T06:00:24Z"
    },
    {
      "author": "IISResetMe",
      "author_association": "COLLABORATOR",
      "body": "@rjmholt I believe https://github.com/PowerShell/PowerShell/issues/8302 (classes don't produce valid interface property methods) should be filed under \"Other bugs\"",
      "created_at": "2018-11-22T00:41:52Z",
      "updated_at": "2018-11-22T00:41:52Z"
    },
    {
      "author": "rjmholt",
      "author_association": "COLLABORATOR",
      "body": "@IISResetMe currently classes don't allow overrides. Wouldn't the `virtual` addition be part of the interface inheritance?",
      "created_at": "2018-11-22T02:11:21Z",
      "updated_at": "2018-11-22T02:11:21Z"
    },
    {
      "author": "IISResetMe",
      "author_association": "COLLABORATOR",
      "body": "@rjmholt well, we already mark all generated methods `virtual`, allowing class definitions to inherit existing interfaces:\r\n\r\n```powershell\r\nclass PleaseDisposeOfMe : IDisposable\r\n{\r\n  [void]Dispose(){ <# free unmanaged resources #> }\r\n}\r\n```\r\n\r\nbut since we never mark the underlying get/set methods of properties virtual (looks like an oversight), you can't actually implement an interface with a property:\r\n\r\n```powershell\r\nclass MyPrincipal : System.Security.Principal.IPrincipal\r\n{\r\n  [System.Security.Principal.IPrincipal]$Identity\r\n  [bool]IsInRole()\r\n}\r\n\r\nAt line:2 char:1\r\n+ class MyPrincipal : System.Security.Principal.IPrincipal\r\n+ ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r\nError during creation of type \"MyPrincipal\". Error message:\r\nMethod 'get_Identity' in type '<404e3736>.MyPrincipal' from assembly '⧹powershell, Version=0.0.0.0, Culture=neutral, PublicKeyToken=null' does not have an implementation.\r\n    + CategoryInfo          : ParserError: (:) [], ParentContainsErrorRecordException\r\n    + FullyQualifiedErrorId : TypeCreationError\r\n```",
      "created_at": "2018-11-22T12:10:58Z",
      "updated_at": "2018-11-22T12:10:58Z"
    },
    {
      "author": "KirkMunro",
      "author_association": "CONTRIBUTOR",
      "body": "Forgive some ignorance on my part, but looking at the number of issues and the complications that exist in classes in PowerShell today, I can't help but feel this is a design problem rather than a collection of issues/bugs to be addressed.\r\n\r\nWouldn't it make more sense and be much easier if:\r\n\r\n* PowerShell had a new module type specifically for class definitions, called something like class module that could only include class definitions, with a psx1 file extension; nothing else would be allowed in these files (no functions, variables, command invocations, etc.)\r\n* `Import-Module` automatically recognized psx1 files defined in `RootModule`, or class modules included in `NestedModules`, or `RequiredModules` fields in a module manifest, as well as psx1 modules that don't have a manifest at all, and loaded the types defined in those psx1 files accordingly (`RequiredModules` first, then `NestedModules`, then `RootModule`, so that you can derive from other types in other modules)\r\n* PowerShell automatically identified classes derived from `PSCmdlet` and added them to the current session without the extra work that is being done [here](https://www.indented.co.uk/cmdlets-without-a-dll/).\r\n* PowerShell automatically exported classes that are associated with cmdlets that are exported from a module.\r\n* PowerShell supported `ClassesToExport` in module manifests to identify types in modules so that implicit loading could still work, even with classes.\r\n* `Export-ModuleMember` had a `-Class` parameter to explicitly identify which classes you want to export\r\n\r\nOne of the drivers behind this approach is that it would do away with the need for `using` for modules containing classes, and supports `#requires`, `NestedModules`, `RequiredModules`, which makes installing modules from the PowerShell Gallery work as expected, and everything else that people already do with `Import-Module` today. Having both `using` and `Import-Module` is confusing and already requires a lot of re-thinking when it comes to how you set up modules to properly load classes. It also facilitates defining an equivalent of binary modules from within PowerShell itself.\r\n\r\nThere are more thoughts behind this, but I've shared enough to see what others think for now.",
      "created_at": "2018-12-05T16:51:47Z",
      "updated_at": "2018-12-05T18:37:07Z"
    },
    {
      "author": "KirkMunro",
      "author_association": "CONTRIBUTOR",
      "body": "On second thought, I'd prefer not having to deal with `Export-ModuleMember` or `ClassesToExport` as suggested in those last two bullets at all, having psx1 files be a PowerShell-ish equivalent of a type library, with types automatically exported just as they are with dlls (ideally with something resembling public/private to control visibility). With that approach, the last three bullets wouldn't be necessary -- classes would just be loaded and available once a module was imported.",
      "created_at": "2018-12-05T18:42:16Z",
      "updated_at": "2018-12-05T18:44:04Z"
    },
    {
      "author": "lzybkr",
      "author_association": "MEMBER",
      "body": "My random thoughts:\r\n\r\n* Not adding `ClassesToExport` was intentional, and type are public to help make the interactive experience good.\r\n* I'm skeptical that auto-loading types is a good idea, at least as a default.\r\n* Defining cmdlets via classes is useful and doesn't require a new module type.\r\n* Not being able to define functions seems a bit harsh, but I like the intention. In a new module type we could have strict functions, and these functions could even be compiled like cmdlets, convert parameters to properties, etc. This isn't exactly easy, but I think it's fairly mechanical.",
      "created_at": "2018-12-05T18:56:03Z",
      "updated_at": "2018-12-05T18:56:03Z"
    },
    {
      "author": "Jaykul",
      "author_association": "CONTRIBUTOR",
      "body": "Yeah, _clearly_ it would be a great thing if Importing a module automatically included Cmdlet-derived classes as commands. \r\n\r\nBut that circles around to `Import-Module` _and also_ `using module`  -- needing to explicitly `using` a module, even though I've already explicitly imported (or `Nested` or `Required`) it is one of the biggest pain point with classes for users.\r\n\r\n@lzybkr I don't quite understand why you think leaving off the `ClassesToExport` feature and requiring me to export them by outputting them (or the user to import them with a _second_ line of code) is a good thing: binary modules do this _as a matter of course_,  I mean, I don't need that to result in auto-loading, but I want `Import-Module` to be **enough** so that every class I use as a parameter type (or a property of a parameter type) is available to the user.\r\n\r\nOf course, I also think we should actually _namespace_ the classes by module (i.e. `[ModuleName.ClassName]`) -- that would certainly become _critical_ if you started thinking about auto-loading / implicit loading. \r\n",
      "created_at": "2018-12-05T19:13:17Z",
      "updated_at": "2018-12-05T19:13:17Z"
    },
    {
      "author": "lzybkr",
      "author_association": "MEMBER",
      "body": "Uh, I wasn't suggesting \"outputting them\" either - you define a class in a psm1, it's exported. All classes are exported, simple as that.\r\n\r\nI was never a fan of the `*ToExport` properties in the manifest, it feels like it violates the [DRY principle](https://en.wikipedia.org/wiki/Don%27t_repeat_yourself). As an optimization, it seems fine, but I'd rather it be a build artifact.\r\n\r\nAnd classes are modeled more like an assembly - public types don't require any entries in the module manifest.\r\n\r\nThe need for `Import-Module` and `using module` isn't really by design, it's more like we didn't have enough time to work out all the issues and people found workarounds that we live with because it seems to work. Obviously the intention was to have a more static world that you could reason about.\r\n\r\n",
      "created_at": "2018-12-06T00:52:07Z",
      "updated_at": "2018-12-06T00:52:07Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "Any chances we could get constructor chaining on the radar at some point, too? 😄 ",
      "created_at": "2018-12-16T21:47:11Z",
      "updated_at": "2018-12-16T21:47:11Z"
    },
    {
      "author": "fMichaleczek",
      "author_association": "NONE",
      "body": "@rjmholt rjmholt  One of my old issues about classes  (from MS Connect) was not on your,  so I search all issues open  (missed + new) and compare with your list : \r\n\r\n [#1760](https://github.com/PowerShell/PowerShell/issues/1760) Inheritance from class with abstract property is inconsistent \r\n[#1751](https://github.com/PowerShell/PowerShell/issues/1751) format-* cmdlets cannot display hidden class members \r\n[#2217](https://github.com/PowerShell/PowerShell/issues/2217) Allow (some) method names that happen to be keywords \r\n[#2219](https://github.com/PowerShell/PowerShell/issues/2219) Properties with accessor and mutator methods\r\n[#2225](https://github.com/PowerShell/PowerShell/issues/2225) Comment-based Help for classes \r\n[#2841](https://github.com/PowerShell/PowerShell/issues/2841) PowerShell class defined in 'New-Module -ScriptBlock' doesn't work as expected\r\n[#2876](https://github.com/PowerShell/PowerShell/issues/2876) Enable native interop with static extern class methods \r\n[#4113](https://github.com/PowerShell/PowerShell/issues/4113) Running `using module f:\\tmp\\test` in global scope doesn't load the powershell class defined in the module to the global scope, while `using module f:\\tmp\\test\\test.psm1` does \r\n[#4713](https://github.com/PowerShell/PowerShell/issues/4713) PowerShell class methods cannot invoke non-exported functions.\r\n[#5332](https://github.com/PowerShell/PowerShell/issues/5332) Inheritance from interface and class are inconsistent \r\n[#5392](https://github.com/PowerShell/PowerShell/issues/5392) Suggestion: Implement Yield Return for Class Methods\r\n[#5796](https://github.com/PowerShell/PowerShell/issues/5796) Method parameter attributes are ignored \r\n[#6722](https://github.com/PowerShell/PowerShell/issues/6722) Type checking in PowerShell class method bodies is not needed \r\n[#7287](https://github.com/PowerShell/PowerShell/issues/7287) Custom classes and enums are not recognized by tab completion \r\n[#7294](https://github.com/PowerShell/PowerShell/issues/7294) Classes: an uninitialized [string] property defaults to $null rather than the empty string #7294\r\n[#7506](https://github.com/PowerShell/PowerShell/issues/7506) Permit specifying parameter names for constructors / .NET methods \r\n[#7654](https://github.com/PowerShell/PowerShell/issues/7654) \"Using module\" statement does not reload module after changes are made _(Note : We are forced to used the keyword using to import properly another module)\r\n[#7736](https://github.com/PowerShell/PowerShell/issues/7736) When powershell class method has same name as property, the property disapear and is not accessible from any instance \r\n[#8235](https://github.com/PowerShell/PowerShell/issues/8235) Class : Methods and properties can't have the same name\r\n[#8475](https://github.com/PowerShell/PowerShell/issues/8475) `using module` fails to check already-loaded modules for available custom types #8475\r\n[#8767](https://github.com/PowerShell/PowerShell/issues/8767) [BUG] Custom classes can be redefined in the same scope, via dot-sourcing, take effect in delayed fashion \r\n[#8828](https://github.com/PowerShell/PowerShell/issues/8828) class based DscResource requires inherited class to be in same file\r\n[#9106](https://github.com/PowerShell/PowerShell/issues/9106) keywords in class method names meaningless error message\r\n[#9174](https://github.com/PowerShell/PowerShell/issues/9174) Custom class methods do not complain about an unassigned $args variable \r\n[#9313](https://github.com/PowerShell/PowerShell/issues/9313) PowerShell classes leak to other runspaces on macOS #9313\r\n[#9445](https://github.com/PowerShell/PowerShell/issues/9445)PowerShell class syntax doesn't support multiple conversion operators with the same input type \r\n\r\n\r\n\r\n",
      "created_at": "2019-04-23T14:59:15Z",
      "updated_at": "2019-04-23T15:00:02Z"
    },
    {
      "author": "fMichaleczek",
      "author_association": "NONE",
      "body": "I began to report classes issues with PS 5.0 Preview April and nothing has changed in 4 years. (no interface,  forbidden methods names not consistant, override isn't implemented , bugged using...)\r\n\r\nFrom my point of view,  there is only one solution to solve this big issue : \r\n- Classes with function support with a limited scenario (Class parser to IL)\r\n- SuperClasses without function support but able to manage a runspace/runspace pool (Class parser to assembly)\r\n\r\nThis SuperClass  need a very big improvement in the parser because we don't want another limited classes. To be clear, I want a class parser like PSLambda for Roslyn.\r\n\r\nI don't know if, writing a new extended parser and asking Roslyn to do the job, is more difficult than resolved all these issues. But we are all waiting for a real statement from PowerShell comitee around classes.\r\n\r\n@SteveL-MSFT To be honested, the aim behind classes are not to write  2 or 3 + 10 methods ... functions already do that !  Can we take a full scenario to determine priority ? I've got one if you want : AspNet Core on PowerShell. (even [IronPython](https://github.com/IronLanguages/ironpython-aspnet-mvc) had this scenario in net4)\r\n\r\nI want to resolve this issue in priority because it's very very dangerous : [#5332](https://github.com/PowerShell/PowerShell/issues/5332)",
      "created_at": "2019-04-23T16:59:23Z",
      "updated_at": "2019-04-23T18:14:47Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "For reference #9382. Maybe we could make friends with these areas.",
      "created_at": "2019-04-23T17:49:44Z",
      "updated_at": "2019-04-23T17:49:44Z"
    },
    {
      "author": "msftrncs",
      "author_association": "CONTRIBUTOR",
      "body": "@rjmholt, I think #8028 has been completed and closed now as of PS Core 6.2.",
      "created_at": "2019-04-25T18:46:02Z",
      "updated_at": "2019-04-25T18:46:02Z"
    },
    {
      "author": "JustinGrote",
      "author_association": "CONTRIBUTOR",
      "body": "Hopefully this is a 7.1 target! :)",
      "created_at": "2019-11-29T20:28:08Z",
      "updated_at": "2019-11-29T20:28:08Z"
    },
    {
      "author": "ili101",
      "author_association": "NONE",
      "body": "Hi. Can you please add [Named and Optional Arguments (C# Programming Guide)](https://docs.microsoft.com/en-us/dotnet/csharp/programming-guide/classes-and-structs/named-and-optional-arguments) to the list?\r\nOptional: https://github.com/PowerShell/PowerShell/issues/9701 https://github.com/PowerShell/PowerShell/issues/7534\r\nNamed: https://github.com/PowerShell/PowerShell/issues/13520 https://github.com/PowerShell/PowerShell/issues/13307",
      "created_at": "2020-08-26T08:18:01Z",
      "updated_at": "2020-08-26T18:13:51Z"
    },
    {
      "author": "JustinGrote",
      "author_association": "CONTRIBUTOR",
      "body": "Didn't see this in the issue list, I can create a separate issue:\r\n\r\nThe array representation of a class (e.g. `Mything[]`) can't be referenced if the class definition is in another file.\r\n\r\n```ps\r\n#Class.ps1\r\nclass Test {[String]$Name}\r\n```\r\n\r\n```\r\n#Usage.ps1\r\n. $PSScriptRoot/Class.ps1\r\n$myTest = [Test]@{Name='Yay'}\r\n[Test[]]$myTest\r\n```\r\nWill error with `ArgumentException: Could not find type [].`. Put them in the same file and it works fine however.\r\n\r\nEDIT: This was actually more of a Pester thing, -BeOfType doesn't work with Powershell Classes. Workaround: Use `$item.GetType().Name | Should -Be 'ClassName'`. This should still work natively ideally so leaving it here.",
      "created_at": "2022-01-25T21:58:41Z",
      "updated_at": "2022-01-26T00:03:14Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "@JustinGrote Please open new issue to discuss your scenario. Then I could add the issue to the tracking list.",
      "created_at": "2022-01-26T15:12:30Z",
      "updated_at": "2022-01-26T15:12:30Z"
    }
  ],
  "created_at": "2018-04-14T00:34:14Z",
  "number": 6652,
  "state": "open",
  "title": "Fix Various PowerShell Class Issues",
  "updated_at": "2022-08-08T20:30:22Z"
}