{
  "_url": "https://github.com/PowerShell/PowerShell/issues/6672",
  "author": "SteveL-MSFT",
  "body": "PowerShell currently only compiles a script block after it's run 32 times, we should allow scripts authors to tag script blocks where they choose to have compiled initially.",
  "closed_at": "2018-04-18T10:10:23Z",
  "comments": [
    {
      "author": "BrucePay",
      "author_association": "COLLABORATOR",
      "body": "Compilation is expensive and consumes space. Doing it unnecessarily will slow everything down. So consider a set of modules all annotated to compile but only a subset are actually called. You end up taking the time/space hit from compiling unnecessarily. As was the case with the `register` keyword in C, the compiler can figure out low-level resource allocation better than the script author so I don't think this is a desirable thing long-term. Improving hotspot detection seems like a better place to invest resources.",
      "created_at": "2018-04-18T08:01:54Z",
      "updated_at": "2018-04-18T08:01:54Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "@BrucePay compilation is expensive, but this would be opt-in by the user.  Perhaps consider it a hint than a directive.",
      "created_at": "2018-04-18T08:09:32Z",
      "updated_at": "2018-04-18T08:09:32Z"
    },
    {
      "author": "BrucePay",
      "author_association": "COLLABORATOR",
      "body": "@SteveL-MSFT history has shown this to be a bad idea (Java hotspot, V8, etc). People aren't good at flow analysis of significant code basis. Modern C compilers ignore `register` because it actively interferes with compiler register allocation i.e. it makes things worse. I expect that we would end up in a similar situation.\r\n",
      "created_at": "2018-04-18T08:31:15Z",
      "updated_at": "2018-04-18T08:31:15Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "I can accept that if such a capability was introduced, too many people would simply use it to compile their scripts which will introduce other problems.",
      "created_at": "2018-04-18T10:10:22Z",
      "updated_at": "2018-04-18T10:10:22Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "Users could use classes if want compilation. Another option is `Add-Type` to get critical fast code.",
      "created_at": "2018-04-19T05:06:34Z",
      "updated_at": "2018-04-19T05:06:34Z"
    }
  ],
  "created_at": "2018-04-18T07:15:17Z",
  "number": 6672,
  "state": "closed",
  "title": "Introduce attribute to tag a script block as something that should be compiled",
  "updated_at": "2018-05-26T18:40:39Z"
}