{
  "_url": "https://github.com/PowerShell/PowerShell/issues/6753",
  "author": "FriedrichWeinmann",
  "body": "## PR Summary\r\n\r\nAdds commands that enable string manipulation on the pipeline. Specifically emulates common string operators, as well as frequently used string methods.\r\n\r\nNew Commands added:\r\n\r\n - Add-String\r\n - Format-String\r\n - Get-SubString\r\n - Join-String\r\n - Set-String\r\n - Split-String\r\n\r\n## PR Checklist\r\n\r\n- [ ] [PR has a meaningful title](https://github.com/PowerShell/PowerShell/blob/master/.github/CONTRIBUTING.md#pull-request---submission)\r\n    - Use the present tense and imperative mood when describing your changes\r\n- [x] [Summarized changes](https://github.com/PowerShell/PowerShell/blob/master/.github/CONTRIBUTING.md#pull-request---submission)\r\n- [x] [Change is not breaking](https://github.com/PowerShell/PowerShell/blob/master/.github/CONTRIBUTING.md#making-breaking-changes)\r\n- [ ] [Make sure all `.h`, `.cpp`, `.cs`, `.ps1` and `.psm1` files have the correct copyright header](https://github.com/PowerShell/PowerShell/blob/master/.github/CONTRIBUTING.md#pull-request---submission)\r\n- [ ] This PR is ready to merge and is not [Work in Progress](https://github.com/PowerShell/PowerShell/blob/master/.github/CONTRIBUTING.md#pull-request---work-in-progress).\r\n    - If the PR is work in progress, please add the prefix `WIP:` to the beginning of the title and remove the prefix when the PR is ready.\r\n- **User-facing changes**\r\n    - [ ] Not Applicable\r\n    - **OR**\r\n    - [x] User-facing [Documentation needed](https://github.com/PowerShell/PowerShell/blob/master/.github/CONTRIBUTING.md#pull-request---submission)\r\n        - [ ] Issue filed - Issue link:\r\n- **Testing - New and feature**\r\n    - [ ] Not Applicable or can only be tested interactively\r\n    - **OR**\r\n    - [x] [Make sure you've added a new test if existing tests do not effectively test the code changed](https://github.com/PowerShell/PowerShell/blob/master/.github/CONTRIBUTING.md#before-submitting)\r\n        - [ ] [Add `[feature]` if the change is significant or affects feature tests](https://github.com/PowerShell/PowerShell/blob/master/docs/testing-guidelines/testing-guidelines.md#requesting-additional-tests-for-a-pr)\r\n\r\nSee also:\r\nhttps://github.com/PowerShell/PowerShell/issues/6697",
  "closed_at": "2019-02-26T22:48:26Z",
  "comments": [
    {
      "author": "FriedrichWeinmann",
      "author_association": "NONE",
      "body": "Still needs a corresponding documentation update, specifically command help for the new commands. Do I just add new platyPS compatible markdown files to the command reference in the documentation repository?",
      "created_at": "2018-04-27T07:11:49Z",
      "updated_at": "2018-04-27T07:11:49Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "@FriedrichWeinmann Please follow [our RFC process](https://github.com/PowerShell/PowerShell/blob/fc627a1dba69ad839fcb7fe76b9aa4733e2b371f/.github/CONTRIBUTING.md#making-design-changes) - we should get RFC approved by PowerShell Committee before implementing new cmdlets. The RFC should contains motivations (addressed scenarios), design proposal and alternative considerations.\r\n",
      "created_at": "2018-04-27T09:02:06Z",
      "updated_at": "2018-04-27T09:10:20Z"
    },
    {
      "author": "FriedrichWeinmann",
      "author_association": "NONE",
      "body": "Hi @iSazonov ,\r\n\r\nthanks for pointing me at the relevant section on that - I tried reading it all, but there's just ... a lot for a first attempt. Sure, will file an RFC if that's desirable - Bruce just told me to go file an issue at PSConfEU. I coded the actual implementation based on that pretty much as ...\r\n\r\n - A way to give people a preview - a comparison base of what it might look like. Being able to touch the actual design, rather than having a dusty document is just more real for many people.\r\n - A way to figure out how this whole process works (given the complexity I was sure I would be getting it wrong the first time around, no matter what)\r\n\r\nSo yes, even if the initial reception was rather positive in general, I went ahead with the full knowledge that I might be wasting my time if the proposal got reject or large revisions - like those proposed by you - were decided upon.\r\n\r\nI'll be filing that RFC as soon as I can make the time to fully read that documentation and process and write it all up - might take a day or two alas :(\r\n\r\nIf you have any guidance to offer regarding the documentation question as well - whether for this or for future issues - that would be much appreciated.",
      "created_at": "2018-04-27T09:19:09Z",
      "updated_at": "2018-04-27T09:19:09Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "@FriedrichWeinmann The PR is good for first-time. Now I don't don't want to waste your time and push review comments before we get approved RFC.\r\n\r\nCreating RFC is the same - fork RFC repo, create branch, commit, push PR, get and address feedbacks. Minimum time for waiting feedback is one month.\r\n\r\nThe RFC should contains:\r\n- motivations (addressed scenarios). We need samples what is current expirience, why it is bad and how we want address this. It will be a good base for tests and documentation.\r\n- design proposal. From my experience we do not need small details.\r\n- alternative considerations. For the proposal it can be operators, third-party modules, .Net Core methods, one cmdlet design and so on. We should understand why the proposal is better - UX, performance, resource consumption and so on.",
      "created_at": "2018-04-27T09:51:39Z",
      "updated_at": "2018-04-27T09:51:39Z"
    },
    {
      "author": "FriedrichWeinmann",
      "author_association": "NONE",
      "body": "Heya @iSazonov : RFC filed: https://github.com/PowerShell/PowerShell-RFC/pull/127 :)\r\n\r\nThanks for the preliminary feedback on the PR, I'm assuming it's ok to keep it open marked as WIP in the meantime, allowing people to try things out for the sake of the discussion.\r\n\r\nThat said, if you could tell me how - or rather where - in the end command help should be contributed, that would be great. I'm sure it's written in one of those guides, but it really is a forest of documentation :(",
      "created_at": "2018-05-04T15:40:55Z",
      "updated_at": "2018-05-04T15:40:55Z"
    },
    {
      "author": "markekraus",
      "author_association": "CONTRIBUTOR",
      "body": "@FriedrichWeinmann if your asking where command help goes, that would be in the [PowerShell-Docs](https://github.com/PowerShell/PowerShell-Docs) repo. Best bet would be to use PlatyPS to generate the initial markdown files, copy and modify the metadata from one of the existing Docs project files, update the markdown documentation, and then submit the PR to the docs repo.",
      "created_at": "2018-05-04T19:19:59Z",
      "updated_at": "2018-05-04T19:19:59Z"
    },
    {
      "author": "BrucePay",
      "author_association": "COLLABORATOR",
      "body": "@iSazonov  I asked @FriedrichWeinmann to file the issue to gauge interest _before_ expending the effort on writing the RFC. Based on our discussions in Germany, he already had substantially implemented things and so now we have code, tests (and documentation?).  But it does need to be reviewed by the committee before proceeding. As far as the RFC goes, I imagine it should be pretty simple - fill in the section on  motivation and the specification part is the code, tests and the documentation - essentially this PR.  (note: If there was much code or if it was complex, I would expect a more detailed specification but it's not. The parameter specifications are longer than the method bodies) But the rest of the committee members will have to agree with that. ",
      "created_at": "2018-05-05T05:57:18Z",
      "updated_at": "2018-05-05T05:57:18Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "@BrucePay \r\n>  As far as the RFC goes\r\n\r\nWe have already received a community feedback that MSFT makes rules and processes and then violate them itself. I believe @joeyaiello and @SteveL-MSFT remember about it. I see no reasons why we should again violate our obligations to the community.",
      "created_at": "2018-05-05T17:43:55Z",
      "updated_at": "2018-05-05T17:43:55Z"
    },
    {
      "author": "BrucePay",
      "author_association": "COLLABORATOR",
      "body": "@iSazonov I am acutely aware of our issues WRT process. And I didn't say that there shouldn't be an RFC, I'm merely pointing out that, because there is working code, the design portion need not be that detailed. The cmdlet signatures are in the code. The behaviour is in the code. And most specifically the tests, which make the behaviour clear, are there as well.",
      "created_at": "2018-05-07T07:04:21Z",
      "updated_at": "2018-05-07T07:04:21Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "@PowerShell/powershell-committee appreciates the publishing of the RFC.  This PR should not be merged until the RFC is approved and any accepted feedback is addressed in this PR.  Thanks for the contribution!",
      "created_at": "2018-05-16T22:54:10Z",
      "updated_at": "2018-05-16T22:54:10Z"
    },
    {
      "author": "stale[bot]",
      "author_association": "NONE",
      "body": "This PR has been automatically marked as stale because it has not had activity in the last 30 days. It will be closed if no further activity occurs within 10 days.\nThank you for your contributions.\nCommunity members are welcome to grab these works.\n",
      "created_at": "2018-06-15T23:25:16Z",
      "updated_at": "2018-06-15T23:25:16Z"
    },
    {
      "author": "stale[bot]",
      "author_association": "NONE",
      "body": "This PR has be automatically close because it is stale. If you wish to continue working on the PR, please first update the PR, then reopen it.\nThanks again for your contribution.\nCommunity members are welcome to grab these works.\n",
      "created_at": "2018-06-26T00:01:09Z",
      "updated_at": "2018-06-26T00:01:09Z"
    },
    {
      "author": "BrucePay",
      "author_association": "COLLABORATOR",
      "body": "Reopening so we can resume making progress on this (sincere apologies to @FriedrichWeinmann  for the delays). And now that we have experimental features, this could be done as an experimental feature so we can get (broader) feedback on the names and functionality. (And @SteveL-MSFT  Is working on some new commands that will make it easier to discover, enable and manage these features.)",
      "created_at": "2018-11-28T19:31:37Z",
      "updated_at": "2018-11-28T19:31:37Z"
    },
    {
      "author": "stale[bot]",
      "author_association": "NONE",
      "body": "This PR has been automatically marked as stale because it has not had activity in the last 30 days. It will be closed if no further activity occurs within 10 days.\nThank you for your contributions.\nCommunity members are welcome to grab these works.\n",
      "created_at": "2019-02-16T22:35:25Z",
      "updated_at": "2019-02-16T22:35:25Z"
    },
    {
      "author": "stale[bot]",
      "author_association": "NONE",
      "body": "This PR has been automatically closed because it is stale. If you wish to continue working on the PR, please first update the PR, then reopen it.\nThanks again for your contribution.\nCommunity members are welcome to grab these works.\n",
      "created_at": "2019-02-26T22:48:25Z",
      "updated_at": "2019-02-26T22:48:25Z"
    }
  ],
  "created_at": "2018-04-27T07:09:24Z",
  "number": 6753,
  "state": "closed",
  "title": "WIP: Add string cmdlets that emulate operator functionality on pipeline",
  "updated_at": "2019-02-26T22:48:26Z"
}