{
  "_url": "https://github.com/PowerShell/PowerShell/issues/6779",
  "author": "dantraMSFT",
  "body": "A security review of the proposed fix for https://github.com/PowerShell/psl-omi-provider/issues/114 (Basic Auth over HTTP does not work from PowerShell) has determined that Basic Auth over HTTP should not be supported Linux. the primary reasons include:\r\n\r\n1: Both credentials and payload are sent un-encrypted.\r\n2: Neither the client nor the server (omi) provide a method for disabling this combination.\r\n3: It's too easy for users to use PSRP in an insecure manner.\r\n\r\nAs the above issue implies, this combination is currently broken in PowerShell on Linux. Instead of fixing it, the proposed change is to explicitly disable it and report a more appropriate error message.\r\n\r\nThe recommendation going forward will be to use Negotiate which results in the following:\r\n\r\nFrom the OMI/Setup NTLM doc... \r\n- The password is hashed using an irreversable algorithm, so the password is more secure than Basic.\r\n - The client and server support encryption of your data over http connections, so SSL certificates are not required.",
  "closed_at": "2018-06-27T22:27:42Z",
  "comments": [
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "@PowerShell/powershell-committee reviewed this and is ok with explicitly not supporting Basic+HTTP and returning an error recommending using Negotiate Authn",
      "created_at": "2018-04-30T21:07:11Z",
      "updated_at": "2018-04-30T21:07:11Z"
    },
    {
      "author": "joeyaiello",
      "author_association": "CONTRIBUTOR",
      "body": "To be clear, this means macOS will only support Basic+HTTPS auth today. We should probably write some documentation or pointers to how someone can do this (i.e. stand up certs on the server-side, and how they should be distributed to clients). ",
      "created_at": "2018-05-01T18:24:38Z",
      "updated_at": "2018-05-01T18:25:04Z"
    },
    {
      "author": "dantraMSFT",
      "author_association": "CONTRIBUTOR",
      "body": "I found a regression in handling of Basic Auth over HTTP.  When a -Uri is used and the scheme is https, the change does not detect it and fails with the Basic Auth over HTTP not supported error. \r\n\r\nThe repro is see with outlook.office365.com:\r\n\r\n$session = New-PSSession -ConfigurationName Microsoft.Exchange -ConnectionUri https://outlook.office365.com/powershell-liveid -Credential $cred -Authentication Basic -AllowRedirection",
      "created_at": "2018-05-17T18:41:26Z",
      "updated_at": "2018-05-17T18:41:26Z"
    }
  ],
  "created_at": "2018-04-30T19:24:15Z",
  "labels": [
    "Resolution-Fixed",
    "WG-Remoting",
    "Breaking-Change",
    "Committee-Reviewed"
  ],
  "number": 6779,
  "state": "closed",
  "title": "Explicitly disallow Basic Auth over HTTP with PSRP on Linux",
  "updated_at": "2018-10-15T21:44:55Z"
}