{
  "_url": "https://github.com/PowerShell/PowerShell/issues/6804",
  "author": "SteveL-MSFT",
  "body": "Currently, we have tests specifically validating env vars for defining http and https proxies.  However, these env vars are simply a side effect of corefx using libcurl on non-Windows and not something explicitly supported by corefx nor the webcmdlets.  We should remove these tests as we're not testing libcurl directly.",
  "closed_at": "2018-05-04T00:17:11Z",
  "comments": [
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "I am full agree that this env variables are only for `curl`. Current .Net Core 2.1 socket based http client don't use `curl` so we can safely remove the tests.",
      "created_at": "2018-05-03T06:19:38Z",
      "updated_at": "2018-05-03T06:19:38Z"
    },
    {
      "author": "markekraus",
      "author_association": "CONTRIBUTOR",
      "body": "hmmm @iSazonov and @SteveL-MSFT have a look at  #3112\r\n\r\nThis missed my radar because it was not labeled. But After considering it... I'm on board with supporting these directly in the Web Cmdlets code.\r\n\r\nI think it _may_ be surprising that these env vars are suddenly ignored on Linux. I'm not sure if these env vars were ever documented with PowerShell 6.0.0. But perhaps in the 6.1.0 documentation we should call this out as a breaking change with the workaround of `-Proxy $env:http_proxy` or `$PSDefaultParameterValues[\"invoke-webrequest:proxy\"] = $env:http_proxy`. At least until we consider adding support or not.",
      "created_at": "2018-05-03T13:33:51Z",
      "updated_at": "2018-05-03T13:33:51Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "Thanks for catching this!\r\nGiven that users can directly use dotnet `HttpClient`, I guess we should not focus on it at all because `HttpClient` no longer use `curl`. Best to open a feature request in dotnet repo. We can consider this as a _regression_ in dotnet.",
      "created_at": "2018-05-03T14:10:56Z",
      "updated_at": "2018-05-03T14:10:56Z"
    },
    {
      "author": "markekraus",
      "author_association": "CONTRIBUTOR",
      "body": "@iSazonov \r\n\r\n>  I guess we should not focus on it at all because HttpClient no longer use curl.\r\n\r\nExcept that there is an ask to support it generally on both Windows and Linux. I will consider that request, but not in the 6.1.0 time frame. ",
      "created_at": "2018-05-03T14:28:37Z",
      "updated_at": "2018-05-03T14:28:37Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "@markekraus forgot I opened that a long time back :)  I don't believe we ever ended up documenting these env vars in PowerShell-Docs.  We can just leave the tests as they are for now particularly if there's interest to adding formal support in the future.",
      "created_at": "2018-05-04T00:17:11Z",
      "updated_at": "2018-05-04T00:17:11Z"
    }
  ],
  "created_at": "2018-05-02T18:47:58Z",
  "number": 6804,
  "state": "closed",
  "title": "Remove webcmdlet tests validating `http_proxy` and `https_proxy` env vars",
  "updated_at": "2018-05-04T00:17:11Z"
}