{
  "_url": "https://github.com/PowerShell/PowerShell/issues/6941",
  "author": "bergmeister",
  "body": "As per title, the `CodeFactor` check makes most PRs red because it flags up issues that are unrelated to the PR.\r\nThis is due to the files containing a lot of other code. Neither do I want to change unrelated code as part of the PR nor seeing the PR checks as red, we should not have a '50 shades of red' build.\r\nThe team should clean up the warnings first or suppress some of the warnings since so far most of them are purely stylistic.\r\n.Net Core has the [Microsoft.CodeAnalysis.FxCopAnalyzers](https://www.nuget.org/packages/Microsoft.CodeAnalysis.FxCopAnalyzers) NuGet package, which is a subset of the CA warnings that most people are familiar with from the full .Net framework, I found those warnings more useful rather than having a linter check, since linters are more useful when being used in VS Code extensions",
  "closed_at": "2018-06-05T11:53:17Z",
  "comments": [
    {
      "author": "markekraus",
      "author_association": "CONTRIBUTOR",
      "body": "ref: #6930  #4708\r\n\r\nI personally think CodeFactor should be disabled until it can be useful. That could be either after CodeFactor makes it more surgically applied to the PR changes or until the project has a cohesive style that rule and CI checks can actually be applied against.\r\n\r\nI definitely agree with you on not wanted PRs merged with failed checks. Right now CodeFactor is noise.",
      "created_at": "2018-05-26T21:31:29Z",
      "updated_at": "2018-05-26T21:32:01Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "Currently CodeFactor is optional and don't block current PRs.\r\nWe have already opened #6930 to get feedback about CodeFactor. Please leave comments there what rules should be turned off or configured.\r\nWe never fix CodeFactor issues if we disable it.",
      "created_at": "2018-05-27T11:05:29Z",
      "updated_at": "2018-05-27T11:06:26Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "We continue to adjust CodeFactor setting step by step. Please discuss next steps in 4708.",
      "created_at": "2018-06-05T11:53:17Z",
      "updated_at": "2018-06-05T11:53:17Z"
    }
  ],
  "created_at": "2018-05-26T20:17:10Z",
  "labels": [
    "Issue-Question",
    "Resolution-Answered"
  ],
  "number": 6941,
  "state": "closed",
  "title": "CodeFactor PR check flags up problems on ontouched and unrelated lines/methods",
  "updated_at": "2018-06-05T11:53:17Z"
}