{
  "_url": "https://github.com/PowerShell/PowerShell/issues/6999",
  "author": "Jaykul",
  "body": "In PowerShell 6 we've finally gotten descriptions with our verbs to help us understand when to use them, but sometimes, they're just not helpful:\r\n\r\n```\r\nPS C:\\> Get-Verb Get, Find, Select, Search\r\n\r\nVerb   AliasPrefix Group  Description\r\n----   ----------- -----  -----------\r\nFind   fd          Common Looks for an object in a container that is unknown, implied, optional, or specified\r\nGet    g           Common Specifies an action that retrieves a resource\r\nSearch sr          Common Creates a reference to a resource in a container\r\nSelect sc          Common Locates a resource in a container\r\n```\r\n\r\nWhat's does \"creates a reference\" mean? I know that description has been used before -- but it was confusing then, too.\r\n\r\nShouldn't `Search` be something more like: \"Searches a container for an object\"?\r\n\r\n\r\nWhile we are at it:\r\n\r\n* Shouldn't the description for `Get` be just \"Retrieves a resource\" to maintain consistent language?\r\n* Shouldn't the description for `Select` be about reshaping objects, or selecting _part_ of an object? I'm not aware of any use of the verb \"Select\" to locate things _in containers_ -- it's used to pick a few properties from an object, or pick a few nodes from an xml document, or pick a few strings from a file ... etc.\r\n\r\n",
  "closed_at": null,
  "comments": [
    {
      "author": "dragonwolf83",
      "author_association": "NONE",
      "body": "`Select-String` does fit the description of locating a resource in a container considering it uses wildcard and regex to \"locate\". I guess you could extend that into `Select-Object` because it uses wildcards to \"locate\" properties. However, I agree the definition is incomplete because it is primarily used to reshape objects and choose a subset of properties.\r\n\r\n`Search` and `Find` are both very confusing and too similar in verbs. I would even argue one of those verbs is better than `Select-String`.\r\n\r\nToo many similar verbs and not enough clarity and examples on why they differ is the biggest problem with most of the verbs.",
      "created_at": "2018-06-05T23:03:54Z",
      "updated_at": "2018-06-05T23:03:54Z"
    },
    {
      "author": "Jaykul",
      "author_association": "CONTRIBUTOR",
      "body": "It's worth noting that the original (PowerShell 1 era) verb list specifically said that \"Get\" replaced both \"Search\" and \"Find\" 😉  but the description for `Search` in particular is just confusing.\r\n\r\nAnd yes, I think `Select-String` should have been called `Find-String` ... as evidenced by the fact that it's main use parallels the old `find` command.\r\n\r\nThe key problem I have with the description of `Select` is that this verb is not for locating things. If it were for locating, then surely it would be redundant with `Search`, `Find`, and `Get` 🙁 In fact, it also generally operates on a pipeline, not a container ...  and it's best use is for reshaping, as people are used to using it in many query languages.",
      "created_at": "2018-06-06T17:11:09Z",
      "updated_at": "2018-06-06T17:11:09Z"
    }
  ],
  "created_at": "2018-06-05T13:43:36Z",
  "labels": [
    "Issue-Discussion"
  ],
  "number": 6999,
  "state": "open",
  "title": "Search verb description is confusing",
  "updated_at": "2018-06-06T17:11:09Z"
}