{
  "_url": "https://github.com/PowerShell/PowerShell/issues/7069",
  "author": "royalharikrishna",
  "body": "In WFC a shared disk device has a dependency on a cluster resource like SQL Server. With the introduction of CSV (Cluster Shared Volumes) this dependency isn't there any longer because we assume that a CSV is always there. That's right (sometimes), but if a SAN failure happens, the CSV or several volumes presenting the CSV will be gone and SQL Server will start again. Ths brings SQL Server in an unpredictable situation and happened. \r\nSo we like to have a PowerShell-Script (running on every node on the cluster) monitoring the CSV and stopping the group hosting the SQL resources if CSV failures happen.",
  "closed_at": "2020-01-30T11:49:38Z",
  "comments": [
    {
      "author": "BrucePay",
      "author_association": "COLLABORATOR",
      "body": "Hi @royalharikrishna I'm not sure what the actual issue is. Is there some problem in PowerShell that is preventing you from writing your script?",
      "created_at": "2018-06-16T20:09:49Z",
      "updated_at": "2018-06-16T20:09:49Z"
    },
    {
      "author": "Tadas",
      "author_association": "CONTRIBUTOR",
      "body": "I think you want to read these, no need to complicate your WFC with an ad-hoc PowerShell script.\r\n\r\n- http://level7techgroup.com/blog/?p=823\r\n- https://docs.microsoft.com/en-us/sql/sql-server/failover-clusters/windows/add-dependencies-to-a-sql-server-resource?view=sql-server-2017\r\n\r\nUnless someone wants to write the script this can probably be closed...\r\n",
      "created_at": "2018-07-05T17:04:15Z",
      "updated_at": "2018-07-05T17:04:15Z"
    }
  ],
  "created_at": "2018-06-14T10:39:04Z",
  "labels": [
    "Issue-Question"
  ],
  "number": 7069,
  "state": "closed",
  "title": "In WFC a shared disk device has a dependency on a cluster resource like SQL Server. With the introduction of CSV (Cluster Shared Volumes) this dependency isn't there any longer because we assume that a CSV is always there. That's right (sometimes), but if a SAN failure happens, the CSV or several volumes presenting the CSV will be gone and SQL Server will start again. Ths brings SQL Server in an unpredictable situation and happened. So we like to have a PowerShell-Script (running on every node on the cluster) monitoring the CSV and stopping the group hosting the SQL resources if CSV failures happen.",
  "updated_at": "2020-01-30T11:49:38Z"
}