{
  "_url": "https://github.com/PowerShell/PowerShell/issues/7110",
  "author": "iSazonov",
  "body": "\r\nWhy double quote delimiter has a special behavior (skipping columns) in Import-Csv?\r\nIs this expected/documented/RFC-defined behavior?\r\n\r\n```powershell\r\n# Input 1.csv\r\n# a1\"\"a3\r\n# v1\"v2\"v3\r\n\r\nImport-csv .\\1.csv -Delimiter '\"'\r\n\r\n# Output\r\na1 a3\r\n-- --\r\nv1 v3\r\n```\r\n\r\n```powershell\r\n# Input 2.csv\r\n# a1,,a3\r\n# v1,v2,v3\r\n\r\nImport-csv .\\2.csv -Delimiter ','\r\n\r\n# Output\r\nWARNING: One or more headers were not specified. Default names starting with \"H\" have been used in place of any missing headers.\r\n\r\na1 H1 a3\r\n-- -- --\r\nv1 v2 v3\r\n```",
  "closed_at": "2018-10-05T04:17:12Z",
  "comments": [
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "@SteveL-MSFT Have you any information about the special behavior? Is this side affect (bug) in the code or a standard?",
      "created_at": "2018-09-20T14:31:51Z",
      "updated_at": "2018-09-20T14:31:51Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "That's probably somewhere between a \"why would you use that as delimiter\" and \"special case that needs dealing with\". CSV entries with spaces need to be enclosed with (usually) double quotes. I don't know if there's another possible enclosing character that can be relied upon, really (single quotes maybe?)\r\n\r\nThe trouble with CSV is there isn't a concrete \"standard\" just a bunch of very similar implementations with some differences scattered throughout.\r\n\r\nBut I've never seen a CSV with double quotes as delimiter before... I'd be of the inclination that it be treated as a reserved character and not be permitted as a delimiter for parsing at all, but... ",
      "created_at": "2018-09-20T17:35:41Z",
      "updated_at": "2018-09-20T17:35:41Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "> But I've never seen a CSV with double quotes as delimiter before... \r\n\r\nThe Issue is that we _accept_ the delimiter and _skip_ one column. So I'd expect that we either do not accept the delimiter or do not skip the column.",
      "created_at": "2018-09-21T04:06:16Z",
      "updated_at": "2018-09-21T04:06:16Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "The former sounds perfectly fine to me, but I'm unsure if there's a valid reason to use a double quote as a delimiter.",
      "created_at": "2018-09-21T11:15:42Z",
      "updated_at": "2018-09-21T11:15:42Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "Took a look at the code, as noted above, double quotes is a special character for containing whitespace so that this:\r\n\r\n> \"foo,bar\",\"apple\"\r\n\r\nbecomes:\r\n\r\n> foo,bar  apple\r\n\r\nand not:\r\n\r\n> foo  bar  apple\r\n\r\nSo using `\"` as the delimiter breaks this.  I think that unless there's a real scenario to use the double quote as a delimiter, it's not worth making a change.  Otherwise, we'd special case if double quote is used, you cannot have whitespace as part of a value.",
      "created_at": "2018-09-21T17:08:51Z",
      "updated_at": "2018-09-21T17:08:51Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "@SteveL-MSFT My question is should we address  scenario from my repo steps where we lost column?",
      "created_at": "2018-09-23T06:29:26Z",
      "updated_at": "2018-09-23T06:29:26Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "@iSazonov there's probably a bug in the logic when double quotes are used as the delimiter as there's special code already to handle double quotes to preserve whitespace.  I think the question is whether it's worthwhile to spend time investigating and fixing something that is a corner case.",
      "created_at": "2018-09-25T00:40:50Z",
      "updated_at": "2018-09-25T00:40:50Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": ">  I think the question is whether it's worthwhile to spend time investigating and fixing something that is a corner case.\r\n\r\nYes, I think we can label this with Up-For-Grabs and Hackathon.",
      "created_at": "2018-09-25T03:36:31Z",
      "updated_at": "2018-09-25T03:36:31Z"
    }
  ],
  "created_at": "2018-06-19T13:30:37Z",
  "number": 7110,
  "state": "closed",
  "title": "Double quote delimiter in Import-Csv",
  "updated_at": "2018-10-05T04:17:12Z"
}