{
  "_url": "https://github.com/PowerShell/PowerShell/issues/7441",
  "author": "mikemaccana",
  "body": "The powershell 6 preview 4 icon is very, er, edgy:\r\n\r\n![image](https://user-images.githubusercontent.com/172594/43642270-74327cae-9716-11e8-96e1-1609d7c511bc.png)\r\n\r\nMore to the point, it's not [Windows icon guidelines](https://docs.microsoft.com/en-us/windows/uwp/design/shell/tiles-and-notifications/app-assets) \r\n\r\n - it's got a lot of detail - Windows icons are generally a few basic shapes\r\n - not all the detail is recognisable - what is the curvy pink line?\r\n\r\nThis may be a test icon for preview releases (in which case close this bug) but a modern version of the previous icon (removing the gloss etc) would be much better. ",
  "closed_at": "2018-12-06T00:00:35Z",
  "comments": [
    {
      "author": "thezim",
      "author_association": "CONTRIBUTOR",
      "body": "It is hair of the avatar. You can see better [here](\r\nhttps://github.com/PowerShell/PowerShell/blob/master/assets/avatar_128.svg). Choosing an icon is always [difficult](https://code.visualstudio.com/blogs/2017/10/24/theicon).",
      "created_at": "2018-08-03T12:47:48Z",
      "updated_at": "2018-08-17T10:32:53Z"
    },
    {
      "author": "mikemaccana",
      "author_association": "NONE",
      "body": "Thanks @thzom. I know the mascot, and even still I wasn't sure what I'm looking at. The detail looks even harder to distinguish in application windows:\r\n\r\n![image](https://user-images.githubusercontent.com/172594/43644111-786679b0-9725-11e8-8fbf-677cc9cbda87.png)\r\n\r\nVScode eventually settled on a really lovely icon. It could be worth asking @chrisdias to make something beautiful for Powershell! \r\n\r\n",
      "created_at": "2018-08-03T13:01:55Z",
      "updated_at": "2018-08-03T13:01:55Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "This PR https://github.com/PowerShell/PowerShell/pull/7086 was provided to help disambiguate between stable and preview releases of PSCore6 as they co-exist side-by-side and many of our contributors have both pinned to the taskbar (including myself).\r\n\r\nIf anyone has contributions to alternate icons, please propose something and we can discuss.",
      "created_at": "2018-08-04T06:05:21Z",
      "updated_at": "2018-08-04T06:05:21Z"
    },
    {
      "author": "mikemaccana",
      "author_association": "NONE",
      "body": "Even at large sizes, and having seen the powershell woman avatar (which TBH I'm not a fan of - it's a bit edgy and doesn't really go with Powershell's clean vibe) during the install, it's not clear it's her face and hair in the icon\r\n\r\n![image](https://user-images.githubusercontent.com/172594/44256637-ad3e2c00-a201-11e8-990c-6328b0e79321.png)\r\n",
      "created_at": "2018-08-17T08:41:48Z",
      "updated_at": "2018-08-17T08:41:48Z"
    },
    {
      "author": "mikemaccana",
      "author_association": "NONE",
      "body": "Thanks @SteveL-MSFT. vscode uses blue for stable, green for development builds, so why not:\r\n\r\n![ps_black_64](https://user-images.githubusercontent.com/172594/44257200-36a22e00-a203-11e8-8f99-894cb2be2a72.png)\r\n\r\nThis just the shapes from the original (minus the pseudo-3D shadows) with the colors changed to green",
      "created_at": "2018-08-17T08:48:49Z",
      "updated_at": "2018-08-17T08:53:02Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "@mikemaccana You'll need to get more community support to enact a change of the icon",
      "created_at": "2018-08-17T15:56:57Z",
      "updated_at": "2018-08-17T15:56:57Z"
    },
    {
      "author": "mikemaccana",
      "author_association": "NONE",
      "body": "Yep agreed. Thinking about it, it's probably better to get the regular Powershell icon (which also doesn't match the Windows style) updated too - remove the shadows, single color, clean sharp edges and focus on shape like Windows 10 icons. @SteveL-MSFT could you get someone from Microsoft to update the icon?",
      "created_at": "2018-08-30T09:55:07Z",
      "updated_at": "2018-08-30T10:13:58Z"
    },
    {
      "author": "mikemaccana",
      "author_association": "NONE",
      "body": "@SteveL-MSFT Hello again! Here's an updated suggestion that fits in more with other Windows 10 icons but is still recognisable as Powershell, while being significantly different from the previous icon per #7086. Happy to send a PR.\r\n\r\n![image](https://user-images.githubusercontent.com/172594/44930703-1328c880-ad57-11e8-810a-6c03f83c42dd.png)\r\n\r\n\r\n",
      "created_at": "2018-08-31T18:50:41Z",
      "updated_at": "2018-08-31T18:50:41Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "I might advocate for using slightly thicker lines for a less spindly look, but that looks *lovely*. Nice work!\r\n",
      "created_at": "2018-08-31T18:59:55Z",
      "updated_at": "2018-08-31T18:59:55Z"
    },
    {
      "author": "thezim",
      "author_association": "CONTRIBUTOR",
      "body": "Don’t forget that other operating systems may have [guidelines](\r\nhttps://developer.apple.com/design/human-interface-guidelines/macos/icons-and-images/app-icon/) as well. Personally I think the current non-preview icon is good and distinguishable from its Windows counterpart which is important. For the preview version I feel it is a little too busy and prefer the green version in this issue so far.",
      "created_at": "2018-08-31T19:04:19Z",
      "updated_at": "2018-08-31T19:04:19Z"
    },
    {
      "author": "mikemaccana",
      "author_association": "NONE",
      "body": "@vexx32 Thanks for the positive feedback! Yeah I agree, it's the same size but doing it negatively makes it look thinner. Will update shortly. ",
      "created_at": "2018-08-31T19:09:51Z",
      "updated_at": "2018-08-31T19:09:51Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "I would also probably encourage that the icon should keep a similar look on OSX -- black/dark background, blue console prompt foreground type of style.\r\n\r\nThis could also be a good branchpoint for the preview icon; say, having the preview icon retain the black background but be given a green foreground color, or something similar.",
      "created_at": "2018-08-31T19:11:18Z",
      "updated_at": "2018-08-31T19:11:47Z"
    },
    {
      "author": "mikemaccana",
      "author_association": "NONE",
      "body": "Cropped it to make it thicker while still keeping the same proportions as the original icon, and sharpened the edges:\r\n\r\n![image](https://user-images.githubusercontent.com/172594/44935254-db764c80-ad67-11e8-955d-44a0bfefdeb9.png)\r\n\r\nThe preview icon is based on the vscode insiders color:\r\n\r\n![image](https://user-images.githubusercontent.com/172594/44935531-f3020500-ad68-11e8-9358-489c5467977f.png)\r\n\r\nAgreed re: OS X. Vscode did something similar to what @vexx32 mentioned - see https://code.visualstudio.com/blogs/2017/10/24/theicon. Alas I don't have a Mac to test on!",
      "created_at": "2018-08-31T20:58:36Z",
      "updated_at": "2018-08-31T21:14:48Z"
    },
    {
      "author": "thezim",
      "author_association": "CONTRIBUTOR",
      "body": "@mikemaccana do you have your work in a repo yet, in SVG? Would like to see how they look on macOS.",
      "created_at": "2018-08-31T21:16:07Z",
      "updated_at": "2018-08-31T21:16:07Z"
    },
    {
      "author": "mikemaccana",
      "author_association": "NONE",
      "body": "@thezim Yep I just committed it to https://github.com/mikemaccana/powershell-profile/, including the SVG and both icons",
      "created_at": "2018-08-31T21:22:35Z",
      "updated_at": "2018-08-31T21:22:35Z"
    },
    {
      "author": "thezim",
      "author_association": "CONTRIBUTOR",
      "body": "@mikemaccana It definitely need a margin to fit in on macOS. I've included my full Dock so you can see the context. Click to enlarge.\r\n\r\n![new-ps](https://user-images.githubusercontent.com/14023826/44936951-ecfa2d00-ad44-11e8-94a8-47b73c440b79.png)",
      "created_at": "2018-08-31T21:44:25Z",
      "updated_at": "2018-08-31T21:44:25Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "I'd be tempted to say you'll still want some kind of a background behind the prompt symbol, at least on MacOS. ",
      "created_at": "2018-08-31T22:09:01Z",
      "updated_at": "2018-08-31T22:09:01Z"
    },
    {
      "author": "mikemaccana",
      "author_association": "NONE",
      "body": "@vexx32 @thezim I've made a new issue for an icon that meets the macOS guidelines - can we move Mac discussion there? Thanks! ",
      "created_at": "2018-08-31T22:21:32Z",
      "updated_at": "2018-08-31T22:48:02Z"
    },
    {
      "author": "thezim",
      "author_association": "CONTRIBUTOR",
      "body": "Remember the guidelines are just that. I think there needs to area where the two can meet. The selling point of PowerShell Core is it is cross platform and having consitency cross platforms is important. This shouldnt be overlooked by taking a hardline with \"guidelines\".\r\n\r\n@SteveL-MSFT can you weigh in on this before efforts are made?",
      "created_at": "2018-08-31T23:18:17Z",
      "updated_at": "2018-08-31T23:18:17Z"
    },
    {
      "author": "MSAdministrator",
      "author_association": "NONE",
      "body": "Personally, I like this first one shared (with thinner lines). ++++",
      "created_at": "2018-09-01T00:34:15Z",
      "updated_at": "2018-09-01T00:34:15Z"
    },
    {
      "author": "mikemaccana",
      "author_association": "NONE",
      "body": "Thanks for the committee review @SteveL-MSFT. https://github.com/PowerShell/PowerShell/issues/7441#issuecomment-417787361 is the most recent, and the one that meets mostly with other Windows icons and the W10 guidelines. @thezim indeed Powershell is cross platform, but look at other cross platform apps - Office, vscode, etc - the icons used are native to the OS style. ",
      "created_at": "2018-09-03T09:29:42Z",
      "updated_at": "2018-09-03T11:47:19Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "@PowerShell/powershell-committee appreciates the input, however, branding and trade dress is currently owned by the PowerShell team.  There will be opportunities in the future where we may look for community input in these areas, however, at this time we are not looking to update our icons.",
      "created_at": "2018-12-06T00:00:35Z",
      "updated_at": "2018-12-06T00:00:35Z"
    },
    {
      "author": "mikemaccana",
      "author_association": "NONE",
      "body": "@SteveL-MSFT OK, obviously you reviewed it and you think it sucks. Fair enough. But can you please get someone - an actual graphic designer in Microsoft - to make a Windows-10 style PS icon?\r\n\r\nCurrently we have a mix of:\r\n\r\n - A modern flat, outline-style icon used by VSCode's official powershell extensions\r\n - The anime-face avatar used in Powershell Core 6.1\r\n - The blue background powershell icon used for Windows Powershell\r\n\r\nNone of these are ideal.",
      "created_at": "2018-12-12T17:43:40Z",
      "updated_at": "2018-12-12T17:43:40Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "@mikemaccana I know you don't like the current icons, but the ones were are currently using are from an actual graphic designer at Microsoft",
      "created_at": "2018-12-15T00:48:05Z",
      "updated_at": "2018-12-15T00:48:05Z"
    },
    {
      "author": "mikemaccana",
      "author_association": "NONE",
      "body": "Steve are you sure? It seems a little odd a professional would create three\nwildly different icons for the same product. Whether I like them or not is\noff topic.\n\nOn Sat, 15 Dec 2018 at 12:48 am, Steve Lee <notifications@github.com> wrote:\n\n> @mikemaccana <https://github.com/mikemaccana> I know you don't like the\n> current icons, but the ones were are currently using are from an actual\n> graphic designer at Microsoft\n>\n> —\n> You are receiving this because you were mentioned.\n> Reply to this email directly, view it on GitHub\n> <https://github.com/PowerShell/PowerShell/issues/7441#issuecomment-447520507>,\n> or mute the thread\n> <https://github.com/notifications/unsubscribe-auth/AAKiMuN_iduyBgaeEVRmNWey14yTnkJlks5u5EbZgaJpZM4Vt4VX>\n> .\n>\n",
      "created_at": "2018-12-15T01:17:32Z",
      "updated_at": "2018-12-15T01:17:32Z"
    },
    {
      "author": "ghost",
      "author_association": "NONE",
      "body": "@mikemaccana I find some of your points actually support the PowerShell team's decisions, actually.\n\nOffice and VSCode are graphical applications intended to be accessed and manipulated through a GUI shell. PowerShell is just that, another shell that also implements it's own language; it's NOT an app.\n\nOn every system except for NT, the user will be accessing pwsh the same as any other shell, via their terminal emulator, and that is the icon they will likely see (if using a GUI at all). The PowerShell Core icons in your GUI shell's path are just a courtesy shortcut, extra to any features of the project. On NT, try creating your own shortcut for conhost invocations, and be aware that changes are on the horizon for how that might work.\n\nThe point is, PowerShell Core's \"logo\" should be understood like Bash or Python's: It's just part of the project branding.\n\nHave a look at some other shell and language logos. Most of those projects, when packaged downstream, don't even distribute shortcuts for invoking their shells EXCEPT on NT.\n\nThe very nature of conforming to each platform suggests to me that it's worth considering getting rid of the shortcuts entirely at some point. It doesn't seem like the kind of thing that should be the PowerShell team's responsibility, and I assume these courtesy shortcuts are for ease of use to aid in adoption.\n\nRegardless, for intersystem maintainers, I wouldn't necessarily encourage any habits that rely on their form or function outside of teaching new users how to invoke other shells.",
      "created_at": "2018-12-15T07:07:25Z",
      "updated_at": "2018-12-15T07:07:25Z"
    },
    {
      "author": "mikemaccana",
      "author_association": "NONE",
      "body": "(deleted previous reply as email replies aren't formatted properly)\r\n\r\nThere hasn't been a 'decision'. There's just very obviously been different groups that have made different versions of the same logo and no effort to do as the issue title says.\r\n\r\nAs you say, Linux shells don't have icons because they're generally invoked via a terminal app. In Windows they're not invoked  this way. That supports having a properly maintained icon.\r\n\r\n**Let's kill the thread and I'll throw away the contribution.** These conversations - being gaslit into thinking there's actually a current consistent powershell icon and I just can't see it and this one and being told we should throw away all shell shortcuts - are inane and unpleasant. \r\n\r\nI've muted the thread and have unsubscribed.",
      "created_at": "2018-12-15T10:15:22Z",
      "updated_at": "2018-12-15T10:16:04Z"
    }
  ],
  "created_at": "2018-08-03T12:15:58Z",
  "labels": [
    "Issue-Discussion",
    "Committee-Reviewed"
  ],
  "number": 7441,
  "state": "closed",
  "title": "The Powershell 6.1 preview 4 icon varies from Windows icon guidelines",
  "updated_at": "2018-12-15T10:16:04Z"
}