{
  "_url": "https://github.com/PowerShell/PowerShell/issues/7576",
  "author": "dantraMSFT",
  "body": "The two tests that verify Test-Connection with IPv4 implicit/explicit options assume that GetHostEntry() returns the AddressList with the IPv4 address as the first entry.\r\n\r\nI'm seeing, on Ubuntu 18.04, that the order is reversed, the IPv6 address is reported first.\r\n\r\nThe test should be updated by searching the IPHostEntry.AddressList for the entry with  AddressFamily -eq InterNetwork.\r\n\r\nThe failure also occurs on Cent0S 7\r\n\r\nActually, this test has a number of issues:\r\n\r\n1: It assumes the address list returned by GetHostEntry and GetHostAddresses have a predictable order.\r\nThis means that $var->AddressList[0] is not consistent across OS installations and is not guaranteed to be consistent across runs; at least the API doesn't indicate such.\r\n\r\nLikely the best solution for this is to query both API's in BeforeAll, build a lookup table and chagne the Should statements to verify the IP address(es) Test-Connection reports are in the the associated table.\r\n\r\n2: It assumes that localhost has an IPV6 address (::1).\r\nUbuntu 18.04, not domain joined, does not.\r\n\r\nThe test 'Force IPv6' should be skipped for this case.  Querying in BeforeAll and checking the IP address list is sufficient.\r\n\r\n3: It assumes that GetHostByName('localhost') returns the FQDN name.\r\nOn the same, clean Ubuntu 18.04 system, the return value is 'localhost'\r\n\r\nThe test 'ResolveDestination for address' is a NOP for this case.\r\n\r\n4: $targetName is used as the starting name in a number of tests; it is localhost\r\nThis is a minor note but it makes the tests that reference it misleading.  Using 'localhost' directly would clarify this.\r\n",
  "closed_at": "2019-11-18T19:47:51Z",
  "comments": [
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "I think the changes in #10697 should cover the stated issues pretty well. The API surface has changed a bit since then as well, so if we find additional issues with either our tests or the cmdlet itself, we can go ahead and reopen / open a new issue as appropriate. 😊 ",
      "created_at": "2019-11-18T19:47:51Z",
      "updated_at": "2019-11-18T19:47:51Z"
    }
  ],
  "created_at": "2018-08-20T17:36:46Z",
  "number": 7576,
  "state": "closed",
  "title": "Test-Connect/Ping Tests forcing IPv4 is unreliable - assumes GetHostEntry address list is in a specific order",
  "updated_at": "2019-11-20T05:10:13Z"
}