{
  "_url": "https://github.com/PowerShell/PowerShell/issues/7781",
  "author": "christophwille",
  "body": "I built a small sample that works on Windows fine, but doesnt on Mac. I verified in pwsh interactively first that it works for pscore 6.1 (lists mailboxes) both on Windows and Mac:\r\n\r\nhttps://github.com/christophwille/pscore-playground/blob/master/NetCorePSCore-Simple/NetCorePSCore/Program.cs#L54\r\n\r\nThe C# code itself worked already with v6 on Windows and only one package reference\r\n\r\nhttps://github.com/christophwille/pscore-playground/blob/master/NetCorePSCore-Simple/NetCorePSCore/NetCorePSCore.csproj#L9\r\n\r\nI added about every package I could think of via #7333 but it still fails with (Mac: you won't get further than New-PSSession)\r\n\r\n!Errors! Operation is not supported on this platform. :: This parameter set requires WSMan, and no supported WSMan client library was found. WSMan is either not installed or unavailable for this system. :: Cannot validate argument on parameter 'Session'. The argument is null. Provide a valid value for the argument, and then try running the command again. :: The term 'Get-Mailbox' is not recognized as the name of a cmdlet, function, script file, or operable program.\r\nCheck the spelling of the name, or if a path was included, verify that the path is correct and try again.\r\n\r\nMost likely I am still missing something in terms of NuGet package or setup. Thanks for any ideas.\r\n",
  "closed_at": "2020-02-01T00:00:37Z",
  "comments": [
    {
      "author": "adityapatwardhan",
      "author_association": "MEMBER",
      "body": "@dantraMSFT  Can you have a look at this?",
      "created_at": "2018-09-14T19:19:07Z",
      "updated_at": "2018-09-14T19:19:07Z"
    },
    {
      "author": "dantraMSFT",
      "author_association": "CONTRIBUTOR",
      "body": "@adityapatwardhan, I'm pretty sure the host has to take a dependency on the native nuget package the PowerShell depends on; otherwise, the native binaries wont be available. ",
      "created_at": "2018-09-14T21:57:34Z",
      "updated_at": "2018-09-14T21:57:34Z"
    },
    {
      "author": "christophwille",
      "author_association": "NONE",
      "body": "Is there a sample on how this has to be done, a gist or some instructions? I added everything and the kitchen sink (m.ps.consolehost, m.m.i,...) and the result is still the same. I must be missing something, but I don't know what that something is (ie I might be initializing ps the wrong way, really missing a NuGet, ...). \r\n\r\nI could not add Microsoft.Powershell.Native because that is 6.0.4 on the myget source.",
      "created_at": "2018-09-15T08:32:13Z",
      "updated_at": "2018-09-15T08:32:13Z"
    },
    {
      "author": "christophwille",
      "author_association": "NONE",
      "body": "Just tested on Ubuntu 18.04 with version as-is in my repository: it works there. Now the question is which of the NuGet made it work there (if any outside of SDK), but still the question remains re:Mac why it doesn't there.",
      "created_at": "2018-09-17T12:01:53Z",
      "updated_at": "2018-09-17T12:01:53Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "Most of issues is with ssh version.",
      "created_at": "2020-01-30T12:31:54Z",
      "updated_at": "2020-01-30T12:31:54Z"
    },
    {
      "author": "msftbot[bot]",
      "author_association": "NONE",
      "body": "This issue has been marked as answered and has not had any activity for **1 day**. It has been closed for housekeeping purposes.",
      "created_at": "2020-02-01T00:00:36Z",
      "updated_at": "2020-02-01T00:00:36Z"
    }
  ],
  "created_at": "2018-09-14T09:21:18Z",
  "number": 7781,
  "state": "closed",
  "title": ".NET Core WSMan Remoting to Exchange Online",
  "updated_at": "2020-02-01T00:00:37Z"
}