{
  "_url": "https://github.com/PowerShell/PowerShell/issues/7794",
  "author": "ghost",
  "body": "An option to hide the 2 \"Windows PowerShell\" items in the WinX menu on Windows 10 and replace them with \"PowerShell Core\".\r\n\r\nI want the WinX menu to launch powershell core instead of Windows PowerShell.",
  "closed_at": null,
  "comments": [
    {
      "author": "bergmeister",
      "author_association": "CONTRIBUTOR",
      "body": "I would rather prefer if the installed added items for PowerShell Core instead because an installer should not modify components such as Windows PowerShell that are deeply embedded into the OS. cc @SteveL-MSFT ",
      "created_at": "2018-09-16T18:14:45Z",
      "updated_at": "2018-09-16T18:14:45Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "At the very least the *option* to hide the existing entries should (eventually) be presented.\n\nBut if that becomes a thing, there should be a way to revert back or add back the windows PowerShell entries. Perhaps there could also be a cmdlet added for this purpose?",
      "created_at": "2018-09-16T20:02:49Z",
      "updated_at": "2018-09-16T20:02:49Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "Since PowerShell Core currently exists outside of Windows, we should not be making any changes to Windows itself that affects Windows PowerShell (although I do love seeing the interest/passion for this).  At some point (hopefully sooner than later), we'll have sufficient usage and compatibility that we can formally start considering having PowerShell Core inbox.",
      "created_at": "2018-09-17T16:48:10Z",
      "updated_at": "2018-09-17T16:48:10Z"
    },
    {
      "author": "ghost",
      "author_association": "NONE",
      "body": "Steve,\r\n\r\nChanging the Win-X menu does not modify powershell. For the most part, it's registry entries that point to a bunch of shortcut links. Changing the shortcuts links on the file system updates the menu.\r\n\r\nWindows Powershell itself affected. This is just adding (and optionally hiding the Windows Powershell shortcuts) in the WinX menu.\r\n\r\nThis is similar to the option of replacing the command prompt shortcuts in the WinX menu with Powershell. I don't understand your concern Steve when Windows already allows this option.",
      "created_at": "2018-09-17T21:38:00Z",
      "updated_at": "2018-09-17T21:41:25Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "@robertbaker I realize that the settings are stored in the registry, but are those registry settings documented?  The problem with making system level changes like this is when a customer calls Customer Support and they ask the customer to Win-X PowerShell, it will do something different than what Support expects (as an example).  If we can add PSCore to the menu, I'd certainly be open to that rather than replacing.",
      "created_at": "2018-09-18T21:31:33Z",
      "updated_at": "2018-09-18T21:31:33Z"
    },
    {
      "author": "ghost",
      "author_association": "NONE",
      "body": "Steve,\r\n\r\nThe WinX menu is per user. The shortcuts are in %localappdata%, I was incorrect previously, however this is great news.\r\n\r\nI would prefer both options to be available, I really want to replace it. can. Windows PowerShell is deprecated. I personally have no need to keep it in the menu or use Windows PowerShell.\r\n\r\n \"Replace Windows PowerShell with PowerShell Core\"\r\n\r\nI'm of those who install PowerShell Core and would use it in place of Windows PowerShell.\r\n\r\nAt the same time, others may have different needs.",
      "created_at": "2018-09-19T02:32:17Z",
      "updated_at": "2018-09-19T04:51:29Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "I wouldn't have an issue with adding a checkbox saying \"Replace Windows PowerShell Win-X menu with PowerShell Core\" and make it opt-in.  cc @joeyaiello ",
      "created_at": "2018-09-21T21:29:10Z",
      "updated_at": "2018-09-21T21:29:10Z"
    },
    {
      "author": "ThoAppelsin",
      "author_association": "NONE",
      "body": "If anybody wants to do this for themselves, head to the following directory, possibly via the run menu (Windows + R): `%APPDATA%\\Microsoft\\Windows\\Start Menu\\Programs\\Windows PowerShell`\r\n\r\nThere, replace the \"Windows PowerShell\" shortcut with the PowerShell shortcut, renaming it to be the same as the replaced shortcut. The item on the Windows + X menu will still be saying \"Windows PowerShell\", but will launch PowerShell instead. Admin version also simply works, too.\r\n\r\n",
      "created_at": "2019-02-06T13:21:01Z",
      "updated_at": "2019-02-06T13:21:01Z"
    },
    {
      "author": "bergmeister",
      "author_association": "CONTRIBUTOR",
      "body": "@SteveL-MSFT Given that you said you want to migrate to MSIX in 6.2, does it mean that items like this should maybe be marked as blocked until later (since the implementation in MSIX is probably different and would make the migration harder)?",
      "created_at": "2019-02-06T13:31:43Z",
      "updated_at": "2019-02-06T13:32:30Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "@bergmeister I've also heard that MSIX is going to be available downlevel...",
      "created_at": "2019-02-06T18:45:32Z",
      "updated_at": "2019-02-06T18:45:32Z"
    },
    {
      "author": "DesertBear",
      "author_association": "NONE",
      "body": "In addition to the 'Win + X' menu items, with PowerShell 5.1 *.PS1 files are set to open in Windows Notepad by default.  When Notepad is the default application, when right-clicking on a *.PS1 file the right-click menu gives the option to 'Run With PowerShell'.  This menu option still opens *.PS1 files in Windows PowerShell 5.1 rather than Powershell 7.  Therefore, when considering updating the 'Win + X' menu items to open Powershell 7, the 'Run With PowerShell' right-click menu item should be considered as well.",
      "created_at": "2020-03-13T20:18:22Z",
      "updated_at": "2020-03-13T20:18:22Z"
    },
    {
      "author": "BinToss",
      "author_association": "NONE",
      "body": "> If anybody wants to do this for themselves, head to the following directory, possibly via the run menu (Windows + R): `%APPDATA%\\Microsoft\\Windows\\Start Menu\\Programs\\Windows PowerShell`\r\n> \r\n> There, replace the \"Windows PowerShell\" shortcut with the PowerShell shortcut, renaming it to be the same as the replaced shortcut. The item on the Windows + X menu will still be saying \"Windows PowerShell\", but will launch PowerShell instead. Admin version also simply works, too.\r\n\r\nSomething I had a hard time figuring out is the hidden numerals in the shortcut names.\r\n![image](https://user-images.githubusercontent.com/7243190/85818081-98e3e800-b724-11ea-8ff2-20a8447a2259.png)\r\n",
      "created_at": "2020-06-26T03:48:48Z",
      "updated_at": "2020-06-26T03:48:48Z"
    }
  ],
  "created_at": "2018-09-16T00:57:08Z",
  "number": 7794,
  "state": "open",
  "title": "Add Win+X option to installer",
  "updated_at": "2020-06-26T03:48:48Z"
}