{
  "_url": "https://github.com/PowerShell/PowerShell/issues/7837",
  "author": "jherby2k",
  "body": "I understand that, via PowerShell 5+, Write-Host is now the same as Write-Information but with $InformationAction = 'Continue'. But how can I achieve the same result as Write-Host from a binary module?\r\n\r\nI'd prefer my Information messages to be opt-out, not opt-in. That's what Debug messages are for, IMO.",
  "closed_at": "2018-10-21T11:55:51Z",
  "comments": [
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "Debug messages are pseudo-breakpoints, really. So... not the same thing.\r\n\r\nAnd having information messages be opt out is generally considered a bad idea because PS is an automation tool. If you want to code a wrapper function that provides a more user-focused interface, which automatically enables verbose or information streams as it runs subcommands, that's up to you, but it's generally considered best practice to expose automation-focused commands that do not pollute the output stream or the host environment with text the user hasn't explicitly asked for.\r\n\r\nThat out of the way... I'm not super familiar with how it works, but here's the file for Write-Host (took a bit of searching and digging, but there it is): https://github.com/PowerShell/PowerShell/blob/0f0c46dfe51440470b86f67b258e14aea32fa0aa/src/Microsoft.PowerShell.Commands.Utility/commands/utility/WriteConsoleCmdlet.cs\r\n\r\nIf you use that as a base, I'm sure you can implement something similar. 😄 ",
      "created_at": "2018-09-22T00:43:27Z",
      "updated_at": "2018-09-22T00:43:27Z"
    },
    {
      "author": "jherby2k",
      "author_association": "NONE",
      "body": "Thanks for looking that up. Looks like adding \"PSHOST\" as a tag to WriteInformation is the part that does the trick.\r\n\r\nInformation messages don't pollute the output stream. They go into the Information stream. Anyway, I think it depends on what your cmdlets do. If it is complex analysis or processing that takes time, some kinds of feedback might be integral.\r\n",
      "created_at": "2018-09-22T03:24:38Z",
      "updated_at": "2018-09-22T03:24:38Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "You're not entirely wrong; there are some tasks where it's *helpful*... but I wouldn't say it's always needed or should be enabled by default -- personally.\r\n\r\nIn general, I think it more valuable for PS modules to be *consistent*, but... that's a personal opinion of mine, so if you have something you feel it's needed for, go for it. 😄 ",
      "created_at": "2018-09-22T03:34:33Z",
      "updated_at": "2018-09-22T03:34:33Z"
    }
  ],
  "created_at": "2018-09-21T20:01:22Z",
  "number": 7837,
  "state": "closed",
  "title": "SDK WriteInformation vs Write-Host",
  "updated_at": "2018-10-21T11:55:51Z"
}