{
  "_url": "https://github.com/PowerShell/PowerShell/issues/7852",
  "author": "larssb",
  "body": "This is a polite request on an allowance to use the [Test-Json](https://github.com/PowerShell/PowerShell/blob/53e6ec6eadc2f363fc671e96b34ade4dda3fe8eb/src/Microsoft.PowerShell.Commands.Utility/commands/utility/TestJsonCommand.cs) cmdlet code.\r\n\r\nI'm doing a project named [HealOps](https://github.com/larssb/HealOps) and it needs to support nodes running PowerShell versions below v6.1 (the version wherein the Test-Json cmdlet is included). Therefore, it would be wonderful if I could re-use the Test-Json code you did @iSazonov. However, can I? Am I allowed to do so? I know it is a MIT license and by reading the license text I get the impression that I can. As long as I include the license disclaimer.\r\n\r\nSo, would it be okay? Thank you very much.",
  "closed_at": "2018-09-28T21:04:43Z",
  "comments": [
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "@larssb Yes, you can re-use the code. See https://github.com/PowerShell/PowerShell/issues/7279#issuecomment-417146225\r\n\r\n> the recommendation is to attribute in a top level ThirdPartyNotices.txt file\r\n\r\n\r\nAlso we support side-by-side scenarios and you could redistribute latest PowerShell Core build (we have zip package) and latest Pester to target systems.\r\n",
      "created_at": "2018-09-24T05:26:46Z",
      "updated_at": "2018-09-24T05:26:46Z"
    },
    {
      "author": "larssb",
      "author_association": "NONE",
      "body": "Hi @iSazonov,\r\n\r\nThank you! That is wonderful 👍.  I will include a ThirdPartyNotices.txt file in the root of the repo. However, I'm a little in doubt over what to write in this file? Searching around for it does not give any good overview. If you have the time it would be of great help if you could elaborate on that.\r\nAlso, just adding the code in the `Test-Json` file is not enough I guess. I will have to get the Newton and NJsonSchema dlls. E.g. by downloading the NuGet packages. Or????\r\n\r\nInteresting option of using PowerShell core side-by-side. However, I don't know if I want to go down the road of bundling PS Core with the HealOps project. The download gets bigger and I will have some maintenance around updating to newer version continously. But IT IS a good option.\r\n\r\nThank you and I wish you wrote your blog in English as well :-D",
      "created_at": "2018-09-25T21:26:23Z",
      "updated_at": "2018-09-25T21:37:46Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "> what to write in this file \r\n\r\nLook the file in the PowerShell Core repo. (There is copies of original license texts).\r\n\r\n> E.g. by downloading the NuGet packages. Or????\r\n\r\nYes, you need to reference the NuGet packages to compile Test-Json.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
      "created_at": "2018-09-26T05:42:35Z",
      "updated_at": "2018-09-26T05:42:35Z"
    }
  ],
  "created_at": "2018-09-23T18:02:27Z",
  "labels": [
    "Issue-Question",
    "Resolution-Answered"
  ],
  "number": 7852,
  "state": "closed",
  "title": "Inquire on the Test-Json command. Allowance to use in a product that needs to support PS v6.1-",
  "updated_at": "2018-09-28T21:04:43Z"
}