{
  "_url": "https://github.com/PowerShell/PowerShell/issues/7981",
  "author": "TravisEz13",
  "body": "# Microsoft Security Advisory CVE-2018-8292\r\n\r\n##  .NET Core Information Disclosure Vulnerability\r\n\r\n### Executive Summary\r\n\r\nMicrosoft is releasing this security advisory to provide information about a vulnerability in .NET Core and PowerShell Core `6.0`. This advisory also provides guidance on what developers can do to update their applications to remove this vulnerability.\r\n\r\nMicrosoft is aware of a security feature bypass vulnerability that exists when .NET Core when HTTP authentication information is inadvertently exposed in an outbound request that encounters an HTTP redirect. An attacker who successfully exploited this vulnerability could use the information to further compromise the web application.  The PowerShell cmdlets `Invoke-WebRequest` and `Invoke-RestMethod` are not affected.\r\n\r\nSystem administrators running PowerShell Core applications are advised to migrate to PowerShell Core `6.1`.\r\n\r\n### Discussion\r\n\r\nPlease use dotnet/corefx#32730 for discussion of the .NET CoreFx aspects this advisory.\r\n\r\n## Affected Software\r\n\r\nThe vulnerability affects PowerShell Core prior to version `6.1.0`\r\n\r\n## Advisory FAQ\r\n\r\n### How do I know if I am affected?\r\n\r\nIf all of the following are true:\r\n\r\n1. Run `pwsh -v` (if, you cannot launch PowerShell Core using `pwsh` you are affected).  \r\n  If the reported version is any version before `6.1.0`, you are affected.\r\n1. You are using .NET Core HTTPClient directly.\r\n\r\n### How do I update to an unaffected version?\r\n\r\nFollow the instructions at [Get PowerShell](https://github.com/PowerShell/PowerShell#get-powershell) to install the latest version of PowerShell Core.\r\n\r\n## Other Information\r\n\r\n### Reporting Security Issues\r\n\r\nIf you have found a potential security issue in PowerShell Core, please email details to secure@microsoft.com.\r\n\r\n### Support\r\n\r\nYou can ask questions about this issue on GitHub in the PowerShell organization. This is located at https://github.com/PowerShell/. The Announcements repo (https://github.com/PowerShell/Announcements) will contain this bulletin as an issue and will include a link to a discussion issue where you can ask questions.\r\n\r\n### What if the update breaks my script or module?\r\n\r\nYou can uninstall the newer version of PowerShell Core and install the previous version of PowerShell Core. This should be treated as a temporary measure. Therefore, the script or module should be updated to work with the patched version of PowerShell Core.\r\n\r\n### External Links\r\n\r\n[CVE-2018-8292](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2018-8292)\r\n\r\n### Revisions\r\n\r\nV1.0 (Oct 9, 2018): Advisory published.\r\n\r\n*Version 1.0*\r\n*Last Updated 2018-01-24*",
  "closed_at": "2018-11-13T18:44:52Z",
  "comments": [],
  "created_at": "2018-10-09T23:31:08Z",
  "labels": [
    "Issue-Discussion"
  ],
  "number": 7981,
  "state": "closed",
  "title": "Discussion: Microsoft Security Advisory CVE-2018-8292 - .NET Core Information Disclosure Vulnerability",
  "updated_at": "2018-11-13T18:44:52Z"
}