{
  "_url": "https://github.com/PowerShell/PowerShell/issues/7986",
  "author": "LeeHolmes",
  "body": "The PS Core breaking change guidance is here: https://github.com/PowerShell/PowerShell/blob/master/docs/dev-process/breaking-change-contract.md\r\n\r\nRemoval of '-Encoding Byte' is a breaking change from Windows PowerShell. Although certainly a cleaner implementation, it does not meet the bar for breaking changes as identified by the guidance above.\r\n\r\nEven if fixing this causes a breaking change for PowerShell Core, that would be far less impactful than the breaking change for users coming from Windows PowerShell.",
  "closed_at": "2018-11-07T23:29:29Z",
  "comments": [
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "Are you suggesting that the parameter be restored *alongside* the newer syntax for backwards compatibility? Just trying to clarify what your desired outcome is, really. 😄 \r\n\r\nBut really, now... can't make an omelette without breaking some eggs. 😉 ",
      "created_at": "2018-10-10T19:50:43Z",
      "updated_at": "2018-10-10T19:50:43Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "The breaking change was approved in #5080 ",
      "created_at": "2018-10-11T17:48:00Z",
      "updated_at": "2018-10-11T17:48:00Z"
    },
    {
      "author": "LeeHolmes",
      "author_association": "CONTRIBUTOR",
      "body": "New functionality is great (-AsByteStream is cool). Breaking changes that are not in line with the breaking change contract are not cool - even if previously approved.",
      "created_at": "2018-10-12T17:34:37Z",
      "updated_at": "2018-10-12T17:34:37Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "Again, what would you suggest? Restoring the `-Encoding` parameter to a loosely-typed collection and add `Byte` back in as an option? I can see why it might be nice to have for backwards-compatibility purposes on occasion, but have people actually *used* `-Encoding Byte` commonly? I really can't say I've ever seen it (not that that means it *shouldn't* be restored, just trying to gauge how serious this issue could be in practice, really).",
      "created_at": "2018-10-12T17:51:05Z",
      "updated_at": "2018-10-12T17:51:05Z"
    },
    {
      "author": "LeeHolmes",
      "author_association": "CONTRIBUTOR",
      "body": "It's used 161 times in the PowerShell Corpus. (http://aka.ms/powershellcorpus)\r\n\r\n![image](https://user-images.githubusercontent.com/11475352/46887516-aeab5f80-ce12-11e8-8cf1-c31867457ea2.png)\r\n",
      "created_at": "2018-10-12T18:34:53Z",
      "updated_at": "2018-10-12T18:34:53Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "@PowerShell/powershell-committee reviewed this.  This change occurred prior to the PSCore 6.0 GA where our philosophy included taking opportunity to fix issues that were known to be breaking but improving the platform.  The breaking change contract was authored after 6.0 GA and we certainly have been applying it since.  At this time, without additional customer feedback, it seems that the number of hits in the corpus based on the size of the corpus doesn't justify spending effort to add this back.",
      "created_at": "2018-11-07T23:29:21Z",
      "updated_at": "2018-11-07T23:29:21Z"
    }
  ],
  "created_at": "2018-10-10T19:29:01Z",
  "number": 7986,
  "state": "closed",
  "title": "Removal of \"Encoding Byte\" is a breaking change",
  "updated_at": "2018-11-08T03:01:11Z"
}