{
  "_url": "https://github.com/PowerShell/PowerShell/issues/8063",
  "author": "SteveL-MSFT",
  "body": "## PR Summary\r\n\r\nThe FormatData format changed in version 5.1 so during remoting a client specifies the version of PowerShell FormatData it can understand.\r\nIn the case of FileInfo (and DirectoryInfo), the format requires 5.1 so remoting must pass the `-PowerShellVersion 5.1` parameter to successfully get format data.  There is a bug in the logic to validate the version and it was validating the build number.  So the version string `5.1` fails this check because it does not include a version number (which defaults to -1).  The fix is to remove the check on the build number and simply rely on major version and minor version.\r\n\r\nFix https://github.com/PowerShell/PowerShell/issues/4237\r\n\r\n## PR Checklist\r\n\r\n- [x] [PR has a meaningful title](https://github.com/PowerShell/PowerShell/blob/master/.github/CONTRIBUTING.md#pull-request---submission)\r\n    - Use the present tense and imperative mood when describing your changes\r\n- [x] [Summarized changes](https://github.com/PowerShell/PowerShell/blob/master/.github/CONTRIBUTING.md#pull-request---submission)\r\n- [x] [Change is not breaking](https://github.com/PowerShell/PowerShell/blob/master/.github/CONTRIBUTING.md#making-breaking-changes)\r\n- [x] [Make sure all `.h`, `.cpp`, `.cs`, `.ps1` and `.psm1` files have the correct copyright header](https://github.com/PowerShell/PowerShell/blob/master/.github/CONTRIBUTING.md#pull-request---submission)\r\n- [x] This PR is ready to merge and is not [Work in Progress](https://github.com/PowerShell/PowerShell/blob/master/.github/CONTRIBUTING.md#pull-request---work-in-progress).\r\n    - If the PR is work in progress, please add the prefix `WIP:` to the beginning of the title and remove the prefix when the PR is ready.\r\n- **User-facing changes**\r\n    - [x] Not Applicable\r\n    - **OR**\r\n    - [ ] User-facing [Documentation needed](https://github.com/PowerShell/PowerShell/blob/master/.github/CONTRIBUTING.md#pull-request---submission)\r\n        - [ ] Issue filed - Issue link:\r\n- **Testing - New and feature**\r\n    - [ ] Not Applicable or can only be tested interactively\r\n    - **OR**\r\n    - [x] [Make sure you've added a new test if existing tests do not effectively test the code changed](https://github.com/PowerShell/PowerShell/blob/master/.github/CONTRIBUTING.md#before-submitting)\r\n        - [ ] [Add `[feature]` if the change is significant or affects feature tests](https://github.com/PowerShell/PowerShell/blob/master/docs/testing-guidelines/testing-guidelines.md#requesting-additional-tests-for-a-pr)\r\n",
  "closed_at": "2018-10-19T19:45:04Z",
  "comments": [
    {
      "author": "JoeSalmeri",
      "author_association": "NONE",
      "body": "Hi Steve,\r\n\r\nI have been anxiously awaiting this fix to test out the issues we discussed last year.\r\n\r\nUnfortunately the problems do not appear to be fixed and things appear to be seriously broken still to the point that the results are unusable.\r\n\r\nRun these commands\r\n\r\n    pwsh -noprofile\r\n    Get-FormatData -PowerShellVersion 6.2 -TypeName System.IO.DirectoryInfo | Export-FormatData -LiteralPath DirectoryInfo.ps1xml\r\n    Get-FormatData -PowerShellVersion 6.2 -TypeName System.IO.FileInfo      | Export-FormatData -LiteralPath FileInfo.ps1xml\r\n\r\nIf you compare DirectoryInfo.ps1xml and FileInfo.ps1xml you will find the are exactly the same, however, the output for a directory item versus a file item should not be the same as a directory does not contain a length.\r\n\r\nIgnoring that issue, the results returned are missing lots of XML code that was previously in FileSystem.format.ps1xml.\r\n\r\nI won't detail them all here as you can compare the results produced of Get-FormatData with the old FileSystem.format.ps1xml file to see them all, however, I will point out a few.\r\n\r\nFileSystem.format.ps1xml created a SelectionSet named FileSystemTypes and then used that and a CustomControlName FileSystemTypes-GroupingFormat for the view definitions.  Those are all missing from the \"Get-FormatData\" results for System.IO.DirectoryInfo / System.IO.FileInfo.\r\n\r\nIgnore those issues, I attempted to merge my changes into the results returned from Get-FormatData and I found that my changes were not displaying so I did this simple test.\r\n\r\n    pwsh -noprofile\r\n    Get-FormatData -PowerShellVersion 6.2 -TypeName System.IO.DirectoryInfo | Export-FormatData -LiteralPath DirectoryInfo.ps1xml\r\n\r\n    Edit the DirectoryInfo.ps1xml file and make the following change:\r\n\r\n        Look for <Label>LastWriteTime</Label> and change it to <Label>XXXXWriteTime</Label>\r\n\r\n    Now run\r\n\r\n        Update-FormatData -PrependPath .\\DirectoryInfo.ps1xml\r\n\r\n    Now run Get-ChildItem and you will see that the label still says LastWriteTime instead of XXXXWriteTime\r\n\r\n    Now run this to get what the updated formatting info looks like\r\n\r\n        Get-FormatData -PowerShellVersion 6.2 -TypeName System.IO.DirectoryInfo | Export-FormatData -LiteralPath DirectoryInfo2.ps1xml\r\n\r\n    You will find that it does show the change, however. there is another section after it that still has the label as \"LastWriteTime\".\r\n\r\nI believe all of these issues are because Get-FormatData is not returning the full and correct format data for these types.\r\n\r\nIf I run \"Update-FormatData -Prepend My,FileSystem.format.ps1\" which uses the modified version of the old FileSystem.format.ps1xml file that used to be included in PowerShell, then everything works correctly and it has my changes.\r\n\r\nSo we are back to the original problem.\r\n\r\nThere needs to be a way for me to obtain the format data being used (either via a file like it previously did or with Get-FormatData returning the correct formatting that is really being used).\r\n\r\nSince PowerShell is no longer including the *.format.ps1xml files and Get-FormatData is broken and does not return the correct format data I have no way to determine what changes were made in new versions of PowerShell so that I can integrate them into my modified version.\r\n\r\nI hope that this can be made a priority and get fixed soon.\r\n\r\nHoller if you want any more details.\r\n\r\nThanks!\r\n\r\nJoe\r\n\r\n\r\n\r\n\r\n",
      "created_at": "2019-04-05T19:25:25Z",
      "updated_at": "2019-04-05T19:25:25Z"
    }
  ],
  "created_at": "2018-10-18T06:12:29Z",
  "number": 8063,
  "state": "closed",
  "title": "Fix PSVersion check in `Get-FormatData` to return format data",
  "updated_at": "2019-04-05T19:25:25Z"
}