{
  "_url": "https://github.com/PowerShell/PowerShell/issues/8081",
  "author": "glachancecmaisonneuve",
  "body": "## PR Summary\r\n\r\nThis PR is a re-implementation of the -AddToPath switch in tools/install-powershell.ps1, without the side-effects the current implementation has.  The changes only affects windows users.  \r\n\r\n## Summarized changes\r\n\r\nAs currently implemented, the -AddToPath switch has quite a few undesirable side-effects and 1 or 2 issues that prevents it from adding the path to the newly installed powershell to the registry.  Specifically:\r\n- it expands all variables in the path to their full value (%SystemRoot% ==> C:\\Windows for example) and saves the new path with all variables expanded.\r\n- it changes the path type from REG_EXPAND_SZ to REG_SZ, disabling all variables (wich are now gone in any event).\r\n- it fails o add the path to the newly installed powershell if the user has a path that has the same base path (it won't add c:\\pwsh of you have c:\\pwsh6 in your path).\r\n- it will add a duplicate path for path values that have a DirectorySeparatorChar at the end (for example, it will add c:\\pwsh6\\ in your path even if you have c:\\pwsh6).\r\n\r\nThis PR remedies all of the above by\r\n- strictly adding the new path to the current path value, without changing the current path value in any other way.\r\n- saving the new path with the same REG_EXPAND_SZ/REG_SZ it had before, if appropriate. \r\n- not adding a duplicate path by understanding that C:\\1 and C:\\1\\ is the same path.\r\n\r\n## Non-Breaking change\r\n- The updated script will attempt to add the path to the newly installed pwsh in the user's path.  This is entirely new, as the previous version only attempted to save the path in the machine wide path, and very likely failed most of the time, lacking sufficient rights to do so.  \r\n- This last bit also explains why these issues and side-efects have gone unnoticed until now ... you have to be in an elevated console for the path-rewrite to happen.  Since the script is mostly used while building (via build.psm1), and since most people don't use an elevated console for building, ... I beleive few users were affected.\r\n\r\n## An alternate fix (dont do anything for -AddToPath when $WinEnv -eq $true)\r\n- I am not convinced of the pertinence of saving the path to the registry.  It isn't required by the build script (adding the path to the current process is enough to satisfy it's needs).  It depends who the target audience for install-powershell.ps1 is.  If the script is used by the public at large as an easy way to install powershell, then it's pertinent.  If it's really only used by the build script, then I wasted quite a bit of time getting this right, and the -AddToPath switch should not do anything for $WinEnv -eq $true.\r\n",
  "closed_at": "2019-01-17T22:25:02Z",
  "comments": [
    {
      "author": "glachancecmaisonneuve",
      "author_association": "CONTRIBUTOR",
      "body": "Sorry it took so long to implemented the simple changes you were asking for.  I am not accustomed to this form of review were code changes can be accepted... and forgot that I could just push the requested changes by myself, just as usual.\r\n\r\nIt must have seemed like I was either being uncommonly stubborn/dimwitted/uncooperative.\r\n\r\nThank you for taking the time and your efforts towards integrating this code review.\r\n\r\n**Reminder:** There is one proposed change that has not been implement, i.e. using [Environment]::SaveEnvironmentVariable to write to the registry as it lacks the ability to assign a RegistryValueKind.\r\n",
      "created_at": "2018-10-31T08:46:14Z",
      "updated_at": "2018-10-31T08:46:14Z"
    },
    {
      "author": "TravisEz13",
      "author_association": "MEMBER",
      "body": "I restarted appveyor due to an intermittent failure.  Thanks for your changes.  Yes, I know understand why your are using the Registry API instead of the environment.\r\n  Thanks.",
      "created_at": "2018-11-01T19:54:24Z",
      "updated_at": "2018-11-01T19:54:24Z"
    },
    {
      "author": "glachancecmaisonneuve",
      "author_association": "CONTRIBUTOR",
      "body": "~~I just found out that the [Set-ItemProperty cmdlet honnors the registryvaluekind when provided](https://docs.microsoft.com/en-us/powershell/module/microsoft.powershell.core/about/about_registry_provider?view=powershell-6#type-microsoftwin32registryvaluekind).~~\r\n\r\n~~Would you have preferred that over a call to [Microsoft.Win32.RegistryKey]::SetValue?~~\r\n\r\nNevermind.  There is no way to get an unexpanded path out of the registry save for a direct call to [Microsoft.Win32.RegistryKey]::GetKey.\r\n\r\nMy part is done right?  I don't have to add anything for this to eventually go through?\r\n\r\n",
      "created_at": "2018-11-24T22:29:27Z",
      "updated_at": "2018-11-24T22:45:18Z"
    },
    {
      "author": "TravisEz13",
      "author_association": "MEMBER",
      "body": "Thanks for the contribution.  This fixes a regression in the code I introduced.",
      "created_at": "2018-11-26T20:57:10Z",
      "updated_at": "2018-11-26T20:57:10Z"
    },
    {
      "author": "TravisEz13",
      "author_association": "MEMBER",
      "body": "saving the path is needed even in the build systems we use.  They often spawn new processes from a central build orchestrator.",
      "created_at": "2018-11-26T20:58:48Z",
      "updated_at": "2018-11-26T20:58:48Z"
    },
    {
      "author": "TravisEz13",
      "author_association": "MEMBER",
      "body": "Sorry, We were focusing on the release of `6.1.1` and `6.0.5` and then I took vacation.  \r\nI have two comments that I would like addressed before merging, but I think the change is good.  There are two additional style issues with the label `NIT:` that I would love if you fixed but I'm won't block the PR for.",
      "created_at": "2018-11-26T21:02:20Z",
      "updated_at": "2018-11-26T21:02:20Z"
    },
    {
      "author": "glachancecmaisonneuve",
      "author_association": "CONTRIBUTOR",
      "body": "Sorry it's the end of the term and I haven't had much time at all.  I'll implement the requested changes as soon as i'm able\r\n",
      "created_at": "2018-12-06T12:42:20Z",
      "updated_at": "2018-12-06T12:42:20Z"
    },
    {
      "author": "stale[bot]",
      "author_association": "NONE",
      "body": "This PR has been automatically marked as stale because it has not had activity in the last 30 days. It will be closed if no further activity occurs within 10 days.\nThank you for your contributions.\nCommunity members are welcome to grab these works.\n",
      "created_at": "2019-01-06T06:22:03Z",
      "updated_at": "2019-01-06T06:22:03Z"
    },
    {
      "author": "TravisEz13",
      "author_association": "MEMBER",
      "body": "The script is failing on windows.",
      "created_at": "2019-01-08T01:14:34Z",
      "updated_at": "2019-01-08T01:14:34Z"
    },
    {
      "author": "TravisEz13",
      "author_association": "MEMBER",
      "body": "Thanks for your contribution.  Feel free to ping me if I lose you PR.  ",
      "created_at": "2019-01-17T22:25:34Z",
      "updated_at": "2019-01-17T22:25:34Z"
    }
  ],
  "created_at": "2018-10-19T03:28:49Z",
  "number": 8081,
  "state": "closed",
  "title": "AddToPath re-implementation in install-powershell.ps1",
  "updated_at": "2019-03-23T02:39:48Z"
}