{
  "_url": "https://github.com/PowerShell/PowerShell/issues/8092",
  "author": "SteveL-MSFT",
  "body": "Filesystem paths are strings for parameters.  So for any string parameter that doesn't have `ValidateSet`, tab completion defaults to using the filesystem provider.  For compatibility, we can't ask everyone to decorate parameters that are filesystem paths to indicate they should use the filesystem provider for tab completion.  Instead, we can introduce a new attribute to declare it's NOT a filesystem path so that tab complete doesn't start showing filesystem paths where it isn't appropriate.\r\n\r\nSteps to reproduce\r\n------------------\r\n\r\n```powershell\r\nAdd-Content -Path ./foo.txt -Value # hit tab\r\n```\r\n\r\nExpected behavior\r\n-----------------\r\n\r\n```none\r\nTab completion here should do nothing as the parameter is any arbitrary string\r\n```\r\n\r\nActual behavior\r\n---------------\r\n\r\n```none\r\nTab completion enumerates files/folders in the current path\r\n```\r\n\r\nEnvironment data\r\n----------------\r\n\r\n<!-- provide the output of $PSVersionTable -->\r\n\r\n```powershell\r\nName                           Value\r\n----                           -----\r\nPSVersion                      6.2.0-preview.1\r\nPSEdition                      Core\r\nGitCommitId                    6.2.0-preview.1\r\nOS                             Darwin 18.0.0 Darwin Kernel Version 18.0.0: Wed Aug 22 20:13:40 PDT 2018; root:xnu-4903.201.2~1/RELEASE_X86_64\r\nPlatform                       Unix\r\nPSCompatibleVersions           {1.0, 2.0, 3.0, 4.0...}\r\nPSRemotingProtocolVersion      2.3\r\nSerializationVersion           1.1.0.1\r\nWSManStackVersion              3.0\r\n```\r\n",
  "closed_at": null,
  "comments": [
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "Why use a whole new attribute? I think predefining some behaviours for ArgumentCompleter would be much more extensible.\n\n```powershell\nParam(\n    [Parameter(Position = 0)]\n    [ArgumentCompleter(Provider = 'FileSystem')]\n    [string]\n    $Path,\n\n    [ArgumentCompleter(Provider = 'None')]\n    [string]\n    $RandomString\n)\n```\n\nSo, yes, default to filesystem if not specified, but I think an entirely new attribute is overkill. Let folks specify filesystem for clarity if that is what it is, and let them specify no completion if none is desired.",
      "created_at": "2018-10-20T14:08:43Z",
      "updated_at": "2018-10-20T14:11:50Z"
    },
    {
      "author": "kilasuit",
      "author_association": "COLLABORATOR",
      "body": "^^^ Totally agree with the above.\r\n\r\nThis to me makes more sense than a new attribute",
      "created_at": "2018-10-20T14:42:59Z",
      "updated_at": "2018-10-20T14:42:59Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "> So for any string parameter that doesn't have ValidateSet, tab completion defaults to using the filesystem provider.\r\n\r\nIt is fallback. How many we have or can have such fallbacks? My thoughts here is about something like `ArgumentCompleter(SuppressFallback = $true)`\r\n\r\n>  For compatibility, we can't ask everyone to decorate parameters that are filesystem paths to indicate they should use the filesystem provider for tab completion. \r\n\r\nDo we really need the fallback and why? \r\nAs minimum I think it would be best practice to do this (to decorate path parameters) for future. We could use `ArgumentCompleter(filesystem)` for path parameters in the repo.",
      "created_at": "2018-10-20T17:29:48Z",
      "updated_at": "2018-10-20T17:29:48Z"
    },
    {
      "author": "lzybkr",
      "author_association": "MEMBER",
      "body": "`ArgumentCompleter` accepts a type, so I'd expect something like:\r\n\r\n```powershell\r\n[ArgumentCompleter([PathCompleter])]\r\n# or\r\n[ArgumentCompleter([FileSystemPathCompleter])]\r\n# or\r\n[ArgumentCompleter([NullCompleter])]\r\n```",
      "created_at": "2018-10-22T05:27:34Z",
      "updated_at": "2018-10-22T05:27:34Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "Problem with that is that would throw an immediate error in earlier versions. Ideally, I think we should try to have a solution that simply doesn't function in earlier versions / windows PowerShell, without throwing errors.",
      "created_at": "2018-10-22T11:03:06Z",
      "updated_at": "2018-10-22T11:03:06Z"
    },
    {
      "author": "lzybkr",
      "author_association": "MEMBER",
      "body": "A new attribute or named argument will be an error in older versions when you call the function.",
      "created_at": "2018-10-22T13:59:57Z",
      "updated_at": "2018-10-22T13:59:57Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "Yes, but passing it a type that doesn't exist will be an error as well, so it's about the same (except for a more noisy syntax, in my opinion), unless you plan on backporting the proposed classes. \r\n\r\nI would think that simply being able to specify a PSProvider would be *much* more streamlined in this case; given a string that matches a provider name, it can lookup against available PSProviders and apply completion for that instead of the standard filesystem only completion. \r\n\r\nOtherwise, every single new and existing PSProvider would need its own argumentcompleter attribute class, which strikes me as awkward and unnecessary.",
      "created_at": "2018-10-22T14:09:14Z",
      "updated_at": "2018-10-22T14:42:21Z"
    },
    {
      "author": "lzybkr",
      "author_association": "MEMBER",
      "body": "If you add a named argument, you allow something that is probably nonsense:\r\n\r\n```powershell\r\n[ArgumentCompleter([CompleterType], Provider = 'OtherThing')]\r\n```\r\n\r\nYou could use an unnamed argument so the constructor is overloaded, but I think a new attribute would be clearer than an unnamed argument to `ArgumentCompleter`.\r\n\r\nProviders should probably opt-in to completion anyway by implementing `System.Management.Automation.IArgumentCompleter` because some providers are really slow, should use a cache, etc. Then you could write:\r\n\r\n```powershell\r\n[ArgumentCompleter([Microsoft.PowerShell.Commands.FileSystemProvider])]\r\n```\r\n\r\nBut if you really want a single type doing all path completion and supports specific providers, the `ArgumentCompleterAttribute` could support passing arguments to the types constructor, e.g.:\r\n\r\n```powershell\r\n[ArgumentCompleter([PathCompleter], \"FileSystemProvider\")]\r\n```\r\n\r\nI will also point out that some people would like a global option to disable the fallback completion e.g. see this [StackOverflow question](https://stackoverflow.com/questions/52874517/powershell-5-psreadline-autocompletion-how-to-ignore-batch-files-cmd-bat).\r\n\r\nI think the trivial implementation of such a global setting would not be a good experience, but such an option might make sense once the core commands have an the necessary annotations to complete paths where it makes sense. I do think we'd still need to complete paths for native commands that have no registered argument completers, or maybe this global option has different levels, like `Off`, `NativeCommandsOnly`, `On`.\r\n",
      "created_at": "2018-10-22T15:14:42Z",
      "updated_at": "2018-10-22T15:14:42Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "Hmmm. All good points, indeed.\r\n\r\nSo, essentially our options seem to be:\r\n\r\n1. New attribute, or multiple new attributes (I think one is plenty, probably)\r\n2. Overload constructor for `[ArgumentCompleter]` -- as you say, this is kind of unclear to do, and would be interpreted in odd ways in old versions, I'm sure\r\n3. Named attribute argument for ArgumentCompleter -- as you say, this kind of permits trying to specify both, which probably isn't great.\r\n4. Have ArgumentCompleter pass additional arguments to the type constructor.\r\n\r\nI think option 1 is neatest; I've never really be a particular fan of the overly-bracketed syntax that arises with `[ArgumentCompleter([type])]` -- just too many layers, I think, really.\r\n\r\nSo maybe something along the lines of a `[ProviderCompleter('FileSystem')]` sort of approach, inheriting from the existing argumentcompleter class?\r\n\r\nUnless there's a backwards-compatible way to do it, which I... don't think there is?",
      "created_at": "2018-10-22T15:23:45Z",
      "updated_at": "2018-10-22T15:24:17Z"
    },
    {
      "author": "lzybkr",
      "author_association": "MEMBER",
      "body": "If going the new attribute route, it should probably implement `IArgumentCompleter`, see https://github.com/PowerShell/PowerShell/issues/7860",
      "created_at": "2018-10-22T16:23:27Z",
      "updated_at": "2018-10-22T16:23:27Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": ">  I do think we'd still need to complete paths for native commands\r\n\r\nWe could implement default ArgumentCompleter for native commands. It allows to create custom completers for native commands. (Could we use here your idea with proxy classes (psmore)?)\r\n\r\n> Providers should probably opt-in to completion anyway by implementing\r\n\r\nI like this most. This goes well with previous suggestion. \r\n\r\nI do not like the idea of creating new attributes so we already have a lot of ones. IArgumentCompleter allow address all scenarios in modern way.",
      "created_at": "2018-10-23T04:01:41Z",
      "updated_at": "2018-10-23T04:01:41Z"
    }
  ],
  "created_at": "2018-10-20T07:57:57Z",
  "labels": [
    "Issue-Enhancement",
    "Issue-Discussion"
  ],
  "number": 8092,
  "state": "open",
  "title": "Smarter completer for strings that are not file paths",
  "updated_at": "2018-10-23T04:01:41Z"
}