{
  "_url": "https://github.com/PowerShell/PowerShell/issues/822",
  "author": "andschwa",
  "body": "Where PSRP can take place over the host/guest path provided by the LIS drivers for Linux VMs running on Hyper-V.\n",
  "closed_at": "2018-04-30T17:13:54Z",
  "comments": [
    {
      "author": "bgelens",
      "author_association": "CONTRIBUTOR",
      "body": "FYI. LIS 4.1.2 now exposes the Hyper-V sockets if the user explicitly loads the module hv_sock in the guest VM. You cannot expect LIS to be installed though as LIS is only available for RHEL/CentOS distros and only if the user chooses to install them.\n",
      "created_at": "2016-08-13T19:17:31Z",
      "updated_at": "2016-08-13T19:17:31Z"
    },
    {
      "author": "andschwa",
      "author_association": "MEMBER",
      "body": "@bgelens I'm pretty sure that the LIS drivers live in the Linux tree, and have for quite some time; thus, they're available for [far more than just RHEL/CentOS](https://technet.microsoft.com/windows-server-docs/compute/hyper-v/supported-linux-and-freebsd-virtual-machines-for-hyper-v-on-windows), and are built-in.\n\nIf you're running Linux 4.x, you'll have Hyper-V sockets for sure. If you're running any of PowerShell's supported Linux distributions, you have LIS drivers. The only edge case is CentOS 7, and it by default will still have LIS built-in, but if you stuck with Linux 3.10 (unlikely), you won't have sockets, in which case you'd need to backport the drivers (or install a modern kernel).\n",
      "created_at": "2016-09-16T18:00:37Z",
      "updated_at": "2016-09-16T18:00:37Z"
    },
    {
      "author": "bgelens",
      "author_association": "CONTRIBUTOR",
      "body": "@andschwa I wouldn't take socket support for granted currently. LIS drivers are certified by the distros and in my experience are always a bit lagging. Great Ubuntu is in line but [Suse](https://technet.microsoft.com/windows-server-docs/compute/hyper-v/supported-suse-virtual-machines-on-hyper-v), [CentOS / RHEL 7 - 7.2](https://technet.microsoft.com/windows-server-docs/compute/hyper-v/supported-centos-and-red-hat-enterprise-linux-virtual-machines-on-hyper-v) and [Debian ](https://technet.microsoft.com/windows-server-docs/compute/hyper-v/supported-debian-virtual-machines-on-hyper-v) don't have socket support out of the box yet.\nUnfortunately the distros running on Hyper-V in the Enterprise (at least my customers) are mostly RHEL based and thus need additional work to have this available.\nThen again, when PSv6 will be GA? Hopefully all distros have updated their build-in Hyper-V drivers.\nMy comment was mend to raise awareness, not to undermine the importance of this feature.\nDon't get me wrong, I'm in big favor of this feature! Please make this available :-)\n",
      "created_at": "2016-09-16T21:35:21Z",
      "updated_at": "2016-09-16T21:35:21Z"
    }
  ],
  "created_at": "2016-04-12T16:48:52Z",
  "labels": [
    "Issue-Enhancement",
    "OS-Linux",
    "Up-for-Grabs",
    "WG-Remoting"
  ],
  "number": 822,
  "state": "closed",
  "title": "Implement PowerShell Direct",
  "updated_at": "2018-04-30T17:13:54Z"
}