{
  "_url": "https://github.com/PowerShell/PowerShell/issues/8230",
  "author": "DarwinJS",
  "body": "The usefulness of PowerShell's help system could be dramatically improved if conceptual help (about_*) topics supported the same format in the files and the same filtering using get-help available for comment based help.\r\n\r\nIt is evident by existing about_* help files that many help authors follow the basic format of comment based help - so it stands to reason there would be value in limiting the output to these sections.\r\n\r\n\r\nFor instance, many a conceptual help files contain examples, but the following command is not possible:\r\n\r\n````Get-Help about_sometopic -examples````\r\n\r\nIn addition, conceptual help has the greatest risk to getting very long and unwieldy to read. This argues for value of:\r\n- being able to limit output with things like \"-examples\"\r\n- being able to add \"role\" or \"component\" info to show related help topics across multiple **related** about_* help files\r\n\r\n````Get-Help about_somedocs* -component abc````\r\n\r\nThe seeming unused or low use get-help \"category\" items of \"FAQ\"\r\n\r\nOn Windows PowerShell Get-help get-help -parameter category lists only these value values: Alias, Cmdlet, Function, Provider, Workflow, and HelpFile\r\n\r\nOn PowerShell 6 there are some nice new categories that seem unimplemented. (````get-help * | select -unique category````).\r\n\r\nSome of these seem like they would be useful when applied to about_* help files - specifically: \"General\", \"FAQ\" and \"Glossary\"",
  "closed_at": null,
  "comments": [
    {
      "author": "DarwinJS",
      "author_association": "CONTRIBUTOR",
      "body": "Opps I should have restarted pwsh 6.  I was able to get .SYNOPSIS to show up after adding it to an existing about_PSReadLine file.\r\n\r\nSeems like .SYNOPSIS in contextual help might work in PowerShell 6, but not 5.x.\r\n\r\nNone of the other items seem to work - like specifying Component or Role and then using -component or -role to select.",
      "created_at": "2018-11-11T21:07:50Z",
      "updated_at": "2018-11-11T21:07:50Z"
    }
  ],
  "created_at": "2018-11-11T13:04:14Z",
  "number": 8230,
  "state": "open",
  "title": "about_* help files should support same format and filtering as comment based help",
  "updated_at": "2018-11-11T21:07:50Z"
}