{
  "_url": "https://github.com/PowerShell/PowerShell/issues/8288",
  "author": "vexx32",
  "body": "Currently there are several core cmdlets and no shortage of custom commands in public usage which declare parameters of type `[object]` (or `[psobject]`) and then after parameter binding decide whether or not input is usable, with varying success (as is practically always the case where multiple custom implementations may be present).\r\n\r\nWe are able to specify, currently, only a single possible parameter type. We _also_ have, for some convenience, the `[PSTypeName()]` attribute. However, given that PSObjects can be given completely arbitrary type names, this is at best a matter of convenience and ease of use where PSCustomObject usage is concerned. It cannot and does not attempt to validate that objects have the runtime type they may 'pretend' to have with an inserted PSTypeName.\r\n\r\nThis leads to unclear help documentation and parameter displays, and the user must either read the expanded help for such parameters specifically or the cmdlet as a whole, because the parameter diagrams are simply inaccurate. \r\n\r\nAs such, we have a bit of a gap here that we can fill. We could make use of a parameter attribute (suggested name: `ValidateTypeAttribute` aka `[ValidateType()]`) which would accept an _array_ of `Type` objects and/or _strings_ (provided those strings map to a resolvable runtime type; could be declared by the type's fullname or shortname/accelerator name if one is available).\r\n\r\nThis would provide necessary programmatic metadata for improvements to `Get-Help` whereby such parameters would in the syntax diagram explicitly be flagged as accepting (for example) _either_ `[string]`, _or_ `[hashtable]` or whatever else it might expect.\r\n\r\nI am willing to hash out the code for this, if it turns out to be something y'all like the concept of. 😄 ",
  "closed_at": null,
  "comments": [
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "Look interesting but we need discuss samples where it would be useful. Specially a bind error is terminating but current behavior can be to write non-terminating error.",
      "created_at": "2018-11-16T05:49:27Z",
      "updated_at": "2018-11-16T05:49:27Z"
    },
    {
      "author": "bergmeister",
      "author_association": "CONTRIBUTOR",
      "body": "I like the idea. It would be nice if the attribute could also do type inference, i.e. being able to specify a type (either interface or implementation) and if the type is implementing that interface or deriving from that implementation then it accepts it as well.",
      "created_at": "2018-11-16T08:46:13Z",
      "updated_at": "2018-11-16T08:46:13Z"
    },
    {
      "author": "romero126",
      "author_association": "CONTRIBUTOR",
      "body": "There are several instances I can think of where PowerShell users would find this useful. As well as a tool for internal development.\r\n\r\nThis would be great passing a [PSObject] to a specific overload in C# a great toolkit for future work in module builders.\r\n\r\n[ValidateType([int], [int32], [string], [float])]\r\nPSObject foo;\r\n\r\nwhere you could take \r\nvar x = foo.BaseObject;\r\ncalloverload(x);\r\n\r\nThis would be really good for that.\r\n\r\nAlso could also allow for type casting capabilities for desired type's without a need for a switch case or try catch all your error handling would be done at a validation level.\r\n\r\nI think this would be invaluable. ",
      "created_at": "2018-11-16T18:14:30Z",
      "updated_at": "2018-11-16T18:14:30Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "I don't think this will allow us to bypass compile-time constraints in that way; as I understand it, method overloads are determined at *compile* time, so it won't be possible to dynamically select which overload you're using... however, it might pave the way for a generic set of overloads to be created for a purpose like this. I'm not clear how this would function, in all honesty, I'm hazy about the possible use cases on that end... but if it's a possibility it'd definitely prove interesting to look at!",
      "created_at": "2018-11-16T18:21:58Z",
      "updated_at": "2018-11-16T18:21:58Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "By the way, we already have attributes to describe the source and return types. Although they are not used.",
      "created_at": "2018-11-16T18:34:33Z",
      "updated_at": "2018-11-16T18:34:33Z"
    },
    {
      "author": "KirkMunro",
      "author_association": "CONTRIBUTOR",
      "body": "I worry this may promote bad design.\r\n\r\nFor commands that are out there that take an object or a `PSObject`, should those parameters be that generic?\r\n\r\nIn core PowerShell commands, many of those should be generic because they work against objects. A few other ones (e.g. `Get-Acl` and `Set-Acl` from WindowsPowerShell) accept a `PSObject` and then have some other criteria that they require (in the case of `Get-Acl` or `Set-Acl`, the presence of a `GetSecurityDescriptor` or `SetSecurityDescriptor` method is required).\r\n\r\nWhat might help here are specific examples demonstrating why PowerShell would benefit from a specific attribute for this, and why `ValidateScript` is not sufficient for those scenarios, or why a different design of the command syntax wouldn't be a better option.",
      "created_at": "2018-11-17T19:59:01Z",
      "updated_at": "2018-11-17T19:59:12Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "Look at something like `Select-Object`'s `-Property` parameter:\r\n\r\n```\r\n-Property <Object[]>\r\n    Specifies the properties to select.  These properties are added as `NoteProperty` members to the output objects.\r\n    Wildcards are permitted.\r\n\r\n    The value of the Property parameter can be a new calculated property. To create a calculated, property, use a hash\r\n    table. Valid keys are:\r\n\r\n    - Name (or Label) <string>\r\n\r\n    - Expression <string> or <script block>\r\n\r\n    Required?                    false\r\n    Position?                    0\r\n    Default value                None\r\n    Accept pipeline input?       False\r\n    Accept wildcard characters?  true\r\n```\r\nNote the ambiguous nature of the parameter type, there is a brief mention that you can use property names, which to those of us already knowing how it works, we know that's a string, and then a mention of the hashtable syntax that can be used.\r\n\r\nThe parameters here are, as far as I know, evaluated at runtime to validate them. We could shortcut this quite a bit if we simply had a `[ValidateType([string], [hashtable])]`, and the help could look significantly cleaner, specifying clearly that only one of those two types are acceptable. The additional help text then need only specify the acceptable keys for hashtable input.\r\n\r\nThis cmdlet is not alone, but it _is_ the most commonly-used one that would benefit from this. If you pass in a completely bogus parameter value here, it should error at parameter binding time, I think.\r\n\r\nValidateScript isn't particularly suitable here since script blocks are not natively acceptable in C#. Certainly, you could use them for this, but it's significantly messier, and it would not translate to the help metadata whatsoever.",
      "created_at": "2018-11-17T20:08:36Z",
      "updated_at": "2018-11-17T20:11:39Z"
    },
    {
      "author": "KirkMunro",
      "author_association": "CONTRIBUTOR",
      "body": "Thanks, that's a great example, just what I was looking for, and I get what you're after now.\r\n\r\nFood for thought: I think this feature would be better implemented using an \"Allow\" attribute instead of a \"Validate\" attribute. e.g. Instead of `[ValidateType([string], [hashtable])]`, I think it would be more self documenting if the syntax was written like this: `[AllowType([string],[hashtable])]`, and if the parser only allowed the attribute to be used for parameters of type `[object]` or `[psobject]`.",
      "created_at": "2018-11-19T02:05:19Z",
      "updated_at": "2018-11-19T02:05:19Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "`Allow` attributes are not restrictive but permissive, so I don't think it's semantically appropriate to break that convention, given part of this suggestion is to help with validating the input types and remove the need to do so at runtime.\n\nI agree with the limitation on parameter types in can be applied to, but would add:\n\n* Script function parameters with no explicitly declared type\n* Parameters type as a specific interface type (e.g., `IEnumerable`)\n\nSo that the limitation is essentially: parameters that are not explicitly typed, `(PS)Object`-typed, or any `Interface`-typed parameters.",
      "created_at": "2018-11-19T02:12:52Z",
      "updated_at": "2018-11-19T02:16:08Z"
    }
  ],
  "created_at": "2018-11-16T04:14:13Z",
  "number": 8288,
  "state": "open",
  "title": "[Feature] - Add ValidateTypeAttribute",
  "updated_at": "2018-11-19T02:16:08Z"
}