{
  "_url": "https://github.com/PowerShell/PowerShell/issues/8351",
  "author": "Fonta",
  "body": "The LCM is already able to detect conflicts, with a fairly small change you could make it automatically resolve it.  In my opinion we should be able to set a priority of each partial configuration in the meta config of the LCM. \r\nWith a priority set and when a conflict is detected, the LCM could look at the priority and choose a winner and therefor automatically solve the conflict.\r\n\r\nYou could than create a layered approach of partial configs (by different teams) without having to be afraid of running into conflicts.\r\n\r\nFor more control we could introduce a LCM setting to turn auto remediation on or off.\r\nNice to haves would be options to report remediated conflicts and to change the behaviour of the priority (when 1 would be highest, you could set the priority be applied descending making 1 the lowest).\r\n\r\nThis is something I see more people struggling with, which results in solutions like datum (https://github.com/gaelcolas/Datum) which makes it unnecessary complicated to create a hierarchical structure in the partial configs. \r\nAt our company with somewhere around 9000 servers which are spread around the globe, we want to introduce a global config, which then can be overwritten with regional settings and on top of that server role and server specific settings.\r\n",
  "closed_at": "2018-11-30T04:18:23Z",
  "comments": [
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "@TravisEz13 Should the Issue be moved to DSC repo?",
      "created_at": "2018-11-29T10:00:36Z",
      "updated_at": "2018-11-29T10:00:36Z"
    },
    {
      "author": "TravisEz13",
      "author_association": "MEMBER",
      "body": "LCM is Windows PowerShell and should be filed per the issue template guidelines for Windows PowerShell.\r\nhttps://github.com/PowerShell/PowerShell/blob/master/.github/ISSUE_TEMPLATE/Windows_PowerShell.md\r\n",
      "created_at": "2018-11-30T00:01:15Z",
      "updated_at": "2018-11-30T00:01:46Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "@f0nt4 Please move the issue to UserVoice.",
      "created_at": "2018-11-30T04:18:04Z",
      "updated_at": "2018-11-30T04:18:04Z"
    }
  ],
  "created_at": "2018-11-28T20:35:23Z",
  "number": 8351,
  "state": "closed",
  "title": "DSC - Automatic conflict remediation for partial configurations",
  "updated_at": "2018-11-30T21:14:33Z"
}