{
  "_url": "https://github.com/PowerShell/PowerShell/issues/8397",
  "author": "SteveL-MSFT",
  "body": "Microsoft.Management.Infrastructure.dll and namespace is for the WMIv2 capabilities which include the CIM cmdlets, DSC dependency, as well as integration with the engine to handle CIM types as first class citizens.\r\n\r\nMMI.dll is not Open Source (and no plans to be OSS).  We should see about breaking this dependency so that MMI is a separate module.  This will likely be a big breaking change for anyone using CIM.",
  "closed_at": null,
  "comments": [
    {
      "author": "RichardSiddaway",
      "author_association": "NONE",
      "body": "Will the module still be delivered as part of the install on Windows. If so then I don't see a problem as the functionality is still available and usable. if the module has to be downloaded and installed separately then that will cause problems.  \r\n\r\nCIM is incredibly useful on Windows, in practice it doesn't exist on other platforms, so anything that made it harder to use would have a big impact on Windows administrators. From the dashboard the majority of PowerShell usage is Linux based - mainly I suspect because Windows PowerShell is still available. if you want PowerShell to be viewed as a viable alternative to Windows PowerShell  the CIM functionality must be easily accessible and usable",
      "created_at": "2018-12-05T12:00:04Z",
      "updated_at": "2018-12-05T12:00:04Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "@RichardSiddaway I think this would be solved by https://github.com/PowerShell/PowerShell/issues/5681",
      "created_at": "2018-12-07T23:04:51Z",
      "updated_at": "2018-12-07T23:04:51Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "What time is it planned?\r\nIs the breaking change approved by PowerShell Core Committee?",
      "created_at": "2018-12-08T17:49:12Z",
      "updated_at": "2018-12-08T17:49:12Z"
    },
    {
      "author": "RichardSiddaway",
      "author_association": "NONE",
      "body": "I'm still extremely apprehensive about how this will be received. If the #5681  approach is adopted  it should have a LOT of advance publicity to explain what's happening.  This needs to be explained to the PowerShell community in great detail and early enough that people know and expect the changes. If this is just sprung on the community PowerShell will take a huge credibility hit ",
      "created_at": "2018-12-08T18:04:46Z",
      "updated_at": "2018-12-08T18:04:46Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "Previously we discussed removing dependency on OMI native client library #8233. Seems MSFT team want to remove all dependencies on native libraries. This intention looks too laborious and perhaps too early.\r\nFirst, removing dependency on OMI native client library was postponed. Second, we can't get rid of Microsoft.PowerShell.Native until CoreFX team does native marshaling for Unix-s. Finally, getting rid of MMI is too painful and maybe we should wait for EOL of Windows 7.\r\n",
      "created_at": "2018-12-08T18:15:40Z",
      "updated_at": "2018-12-08T18:15:40Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "This is not in scope for 6.2 release.  Probably not 6.3 either.",
      "created_at": "2018-12-20T01:41:13Z",
      "updated_at": "2018-12-20T01:41:13Z"
    },
    {
      "author": "kilasuit",
      "author_association": "COLLABORATOR",
      "body": "this semi ties in with #1979  tagging that for visibility there too",
      "created_at": "2019-01-22T04:44:36Z",
      "updated_at": "2019-01-22T04:44:36Z"
    },
    {
      "author": "hyandell",
      "author_association": "NONE",
      "body": "Could the README be updated to indicate the non-open source licensing?",
      "created_at": "2019-01-23T22:28:45Z",
      "updated_at": "2019-01-23T22:28:45Z"
    }
  ],
  "created_at": "2018-12-04T23:08:02Z",
  "number": 8397,
  "state": "open",
  "title": "Decouple dependency on Microsoft.Management.Infrastructure",
  "updated_at": "2019-06-20T06:09:22Z"
}