{
  "_url": "https://github.com/PowerShell/PowerShell/issues/8442",
  "author": "msftrncs",
  "body": "Immediately after installation (upgrade from previous 6.2 preview) 6.2.0 preview 3 will not run, the console window just quickly flashes and disappears, or sometimes its so fast nothing appears at all, but I can see the focus move away and then back.\r\n\r\nWindows 10 1809 (Insiders)\r\n\r\nPowerShell 6.1.1 still works.\r\n\r\nI don't see any log files to report.\r\n\r\nI have not yet tried removing and reinstalling.\r\n",
  "closed_at": "2018-12-21T22:51:22Z",
  "comments": [
    {
      "author": "kborowinski",
      "author_association": "NONE",
      "body": "It's the same issue as with PowerShell 6.2.0 preview 2 (#8289). Run the installer again and use repair function. It will fix the problem.",
      "created_at": "2018-12-11T06:49:34Z",
      "updated_at": "2018-12-11T06:49:34Z"
    },
    {
      "author": "MaximoTrinidad",
      "author_association": "NONE",
      "body": "Workaround on https://github.com/PowerShell/PowerShell/issues/8289 ",
      "created_at": "2018-12-13T21:07:32Z",
      "updated_at": "2018-12-13T21:07:32Z"
    },
    {
      "author": "msftrncs",
      "author_association": "CONTRIBUTOR",
      "body": "@kborowinski, repair not working …  one time gave 'account already exists', and another time, I have dialog now waiting for me to relocate the missing install package.\r\n\r\nSo I have a hunch on why this may have affected me.  I installed the MSI package directly from the website without saving the download, so the dialog is looking for the install package in Edge's temporary download folder.\r\n\r\nSo now I have redownloaded and saved it … (that MSI file wouldn't repair it) … uninstalled it and then reinstalled and all is fine.   \r\n\r\nLooking back through things, this is the first time I have installed the preview without saving it first.  However, it appears that I did a straight run of the current released version without any difficulty.",
      "created_at": "2018-12-21T08:45:32Z",
      "updated_at": "2018-12-21T08:45:32Z"
    }
  ],
  "created_at": "2018-12-11T05:43:04Z",
  "number": 8442,
  "state": "closed",
  "title": "PowerShell Preview fails to open after install",
  "updated_at": "2018-12-21T22:51:22Z"
}