{
  "_url": "https://github.com/PowerShell/PowerShell/issues/8466",
  "author": "whitequill",
  "body": "# Support Question\r\nI'm listing a directory's content to a variable with the following command:\r\n`$pyd = Get-ChildItem .\\*.pyd | ForEach-Object{ @{Path=$_.FullName}}`\r\n\r\nWhen I use `$pyd.GetType()` it show that it is an Array.  Shouldn't it be showing it to be a Hashtable?\r\nI'm just making sure this is the intended behavior. I don't want to list a bug that isn't there.\r\n## Official support\r\n\r\n[PowerShell Support Lifecycle](http://aka.ms/pslifecycle)\r\n\r\n## Community Resources\r\n\r\n[Slack Community Chat](https://powershell.slack.com) - Interactive chat with other PowerShell enthusiasts\r\n[PowerShell.org Forum](https://powershell.org/forums/) - Search or post new general PowerShell usage questions\r\n",
  "closed_at": "2018-12-21T22:50:40Z",
  "comments": [
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "It's an array... of hashtables. 😉 \r\n\r\nIf you pipe that end to `Get-Member` you'll see that each object is indeed a hashtable. Arrays can hold anything, and any time you store multiple objects from the pipeline into a variable, they will be packaged into an array so that PS can store them. 😄 ",
      "created_at": "2018-12-14T21:54:15Z",
      "updated_at": "2018-12-14T21:54:15Z"
    },
    {
      "author": "whitequill",
      "author_association": "NONE",
      "body": "I was thinking it was a hashtable of strings. That is why it got me confused.",
      "created_at": "2018-12-14T22:31:24Z",
      "updated_at": "2018-12-14T22:31:24Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "It is! It's an array... Of hashtables... With strings in them! :D\n\nOn Fri, Dec 14, 2018, 5:31 PM whitequill <notifications@github.com wrote:\n\n> I was thinking it was a hashtable of strings. That is why it got me\n> confused.\n>\n> —\n> You are receiving this because you commented.\n> Reply to this email directly, view it on GitHub\n> <https://github.com/PowerShell/PowerShell/issues/8466#issuecomment-447498491>,\n> or mute the thread\n> <https://github.com/notifications/unsubscribe-auth/Ae6BIDt0ACYBNzHyh3XhrHc90QCIYMsGks5u5CbOgaJpZM4ZUUe5>\n> .\n>\n",
      "created_at": "2018-12-14T22:37:14Z",
      "updated_at": "2018-12-14T22:37:14Z"
    },
    {
      "author": "whitequill",
      "author_association": "NONE",
      "body": "I think what I wanted to do was this: `$pyd = Get-ChildItem .\\*.pyd | ForEach-Object{ @($_.FullName)}`\r\nI guess I'll just ask. How to do you put a list of files into a command like:\r\n\r\nthis is what you do in bash;`ln ../source/*.pyd .`, but powershell doesn't like it.\r\nNew-Item -ItemType HardLink -Path <destination directory> -Name .\\*.pyd -Value <source directory>\r\n\r\nIt also doesn't like a variable with a array of files or an array of hashtables of strings.",
      "created_at": "2018-12-14T23:04:05Z",
      "updated_at": "2018-12-14T23:04:05Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "Ah, okay, I see... I think. 😄 \r\n\r\nOkay, so you're providing too many parameters, and it's not clear what you're trying to do exactly. It _looks_ like you're trying to get a list of files in the current location and make hardlinks for them all in some other location?\r\n\r\nThis can depend a bit on the command, and it's easiest to read the help files on the command you're trying to send input to: `help new-item` lists all parameters and how they interact with the pipeline. In this instance, you can provide pipeline input to most of those parameters, but only one of them takes input directly (stated as `ByValue` in the help display). The rest take it `ByPropertyName`, which means you either have to construct a custom object with those parameters, or specify them on the command call.\r\n\r\nAs an example, I _think_ what you're looking for is a bit more like this:\r\n\r\n```powershell\r\n# change this to whatever destination folder you want to put the hardlinks in\r\n$DestinationFolder = 'C:\\Hardlinks\\' \r\nGet-ChildItem -Filter '*.pyd' |\r\n    New-Item -ItemType HardLink -Path $DestinationFolder -Name {$_.Name} -Value {$_.Fullname}\r\n```\r\n\r\nSo what I'm doing here is taking the full `FileInfo` objects that `Get-ChildItem` gives out and telling PowerShell to take each one and just give me two of the properties., which I'm calling out and passing to the -Name and -Value parameters. The script block braces indicate to PowerShell that I'm using a value from the piped object, but not the _whole_ object.\r\n\r\nThe reason I'd do it like this is mainly because you'll generally want to avoid weird cases where you try to make a few hundred hard links with the same name; in this case it's just taking on the same file name the original file had, and setting the full path (Fullname) as the target value of the hard link.\r\n\r\nI made several assumptions here, so if I'm off base in what you're trying to do, just let me know. The long and the short of it is that PS supports _several_ ways of piping values in, and some are more complex than others. `New-Item` does let you pipe raw values in, but you might quickly find that it just ends up rewriting the same hard link many times instead of creating a new one each time if you just pipe the value. It needs a few extra parameters to be specified to do exactly what you want to do... I think! 😄 ",
      "created_at": "2018-12-15T00:29:43Z",
      "updated_at": "2018-12-15T00:30:07Z"
    }
  ],
  "created_at": "2018-12-14T21:48:59Z",
  "number": 8466,
  "state": "closed",
  "title": "Hashtable or Array?",
  "updated_at": "2018-12-21T22:50:40Z"
}