{
  "_url": "https://github.com/PowerShell/PowerShell/issues/8564",
  "author": "kilasuit",
  "body": "In reading many issue's in this repo I see a smallish but nevertheless a common theme occurring.\r\n\r\n- Badly written issues, mainly in content of the issue but often also in the technical context behind the issue that can mislead the readers into what the actual issue is\r\n- Issues that due to being written up badly, perhaps ENG is not the writers first language so translations get lost in the midst, this can lead to long time being spent on issues and PR's intended to fix what could be completely incorrectly understood issue.\r\n\r\nTo combat this, I am suggesting\r\n\r\n- [ ] That the Issue Template for Bug gets updated to include a message that suggests for Triage purposes that the reporter should try to include a screen capture of the issue as it's happening. This would be extremely useful for issues where this could hypothetically reduce the time taken to come to a correct diagnosis of the issue, and further confirmation that the issue is in fact correctly raised and contains the right level of detail to aid in lowering the mean time between confirmed diagnosis with potential fix identified and then the time to implement said fix.\r\n- [ ] That other Issue Templates be updated accordingly to suggest that the above would be a beneficial addition where possible.\r\n- [ ] If implemented then new labels should also be added to signify a screen capture was/was not included in the issue submission\r\n\r\nI think that the above will help with longer term metrics to see how well the current triaging system works (which seems to be pretty solid thus far in the majority of cases) and if there may be any potential areas to improve further.\r\n",
  "closed_at": null,
  "comments": [
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "I'd agree that people including this might be a good idea.\r\n\r\nHowever, given that the majority of the issues with a problem like this seem to arise from people either not reading or not fully comprehending the issue template in the first place (whether it's due to linguistic differences or just them simply not thinking they need to read any of it), it's fairly probably that any such additions might also go similarly unheard.",
      "created_at": "2018-12-31T00:18:49Z",
      "updated_at": "2018-12-31T00:18:49Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "I agree that there is a problem, but also agree that most users who are not regulars don't really pay attention to the template anyways.  Perhaps if we had a `PSCoreIssue` module which had a `Register-PSCoreIssue` cmdlet that walked them through a repro and collected system information/screenshot, that would be ideal :)",
      "created_at": "2018-12-31T01:52:31Z",
      "updated_at": "2018-12-31T01:52:31Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "Some things really need a screen recording on occasion though.\r\n\r\nBut yeah, the rest would be great. Even better if it could automatically submit the issue for them :wink:",
      "created_at": "2018-12-31T02:02:00Z",
      "updated_at": "2018-12-31T02:02:00Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "[Windows Problem Step Recorder](https://support.microsoft.com/en-us/help/22878/windows-10-record-steps) could be very useful if we would had a player.",
      "created_at": "2019-01-01T11:07:35Z",
      "updated_at": "2019-01-01T11:07:47Z"
    }
  ],
  "created_at": "2018-12-30T20:06:56Z",
  "labels": [
    "Issue-Discussion"
  ],
  "number": 8564,
  "state": "open",
  "title": "Suggestion : Ask for issues when raised to also include an optional screen capture showingcasing the issue and it's manifestation",
  "updated_at": "2019-01-01T11:07:47Z"
}