{
  "_url": "https://github.com/PowerShell/PowerShell/issues/8675",
  "author": "jasonshave",
  "body": "I've created a function to run \"Find-Module\" with some additional parameters. I can run the function interactively without issue. The results come back and are stored in a variable I can use. If I let the function run as a scheduled task there is no output. This is the only function out of thousands of lines of code and many other functions which run as scheduled tasks; all without issue.\r\n\r\nIs there a known limitation or configuration necessary to get \"Find-Module\" to work inside a function which runs as a scheduled task?",
  "closed_at": "2019-03-22T05:33:14Z",
  "comments": [
    {
      "author": "Northman-de",
      "author_association": "NONE",
      "body": "`Find-Module psread* | Export-Clixml d:\\temp\\findmodule.xml`\r\nWorks for me. Do you use a proxy? Has the task account access to the proxy? ",
      "created_at": "2019-01-17T18:59:25Z",
      "updated_at": "2019-01-17T18:59:25Z"
    },
    {
      "author": "anmenaga",
      "author_association": "CONTRIBUTOR",
      "body": "@jasonshave it would be interesting to see task details; how it is configured.",
      "created_at": "2019-01-17T19:57:55Z",
      "updated_at": "2019-01-17T19:57:55Z"
    },
    {
      "author": "jasonshave",
      "author_association": "NONE",
      "body": "This has been resolved but remains an issue in principal. As it turns out, the registration of a `PSRepository` is a per/user action. My scheduled task runs under the `SYSTEM` context in Windows which means when the scheduled task runs, it can't find any user-created repository so the `Find-Module` command was working as expected.\r\n\r\nI was testing an auto-updating feature of my PowerShell module and didn't want to post many updates to PS Gallery (as per the guidance about avoiding this behavior). Once I published my module for the first time to PSG, my auto-update function worked as desired.\r\n\r\n[There is a feature request covering this matter.](https://github.com/PowerShell/PowerShellGet/issues/214)",
      "created_at": "2019-01-17T23:49:24Z",
      "updated_at": "2019-01-17T23:49:24Z"
    },
    {
      "author": "edyoung",
      "author_association": "CONTRIBUTOR",
      "body": "https://github.com/PowerShell/PowerShellGet/issues/214 is the primary issue. Closing this as a duplicate",
      "created_at": "2019-03-22T05:33:14Z",
      "updated_at": "2019-03-22T05:33:14Z"
    }
  ],
  "created_at": "2019-01-17T17:00:33Z",
  "labels": [
    "Issue-Question",
    "Resolution-External"
  ],
  "number": 8675,
  "state": "closed",
  "title": "Find-Module not working inside function (as scheduled task)",
  "updated_at": "2019-03-22T05:33:36Z"
}