{
  "_url": "https://github.com/PowerShell/PowerShell/issues/8819",
  "author": "Jaykul",
  "body": "I think maybe it's time we replace `function` + `cmdletbinding` with a new and improved keyword that would make it easier for authors to \"fall into the pit of success\" and write \"advanced\" script functions the \"best\" way ... \r\n\r\nRight now, a \"best practices\" function has to include a lot of repetitive boilerplate work (something like this):\r\n\r\n```PowerShell\r\nfunction Build-Noun {\r\n    [CmdletBinding()]\r\n    param(\r\n        [Parameter(ValueFromPipelineByPropertyName)]$Parameter\r\n    )\r\n    end {\r\n        # This try/catch ensures that if someone downstream uses `throw` ...\r\n        # or is otherwise misusing/altering ErrorActionPreference ...\r\n        # we catch it here, rather than passing the problem to our callers\r\n        try {\r\n            <# YOUR CODE HERE # >\r\n        } catch {\r\n            throw $_ # the $_ is important, don't remove it\r\n        } finally {\r\n            <# -- dispose, if necessary -- #>\r\n        }\r\n    }\r\n}\r\n```\r\nI would like to see that wrapped up in a new `cmdlet` (or `advancedfunction` or `function2` ...) keyword which would be the _new_ recommended way of writing commands in modules, and would, for instance:\r\n\r\n- imply CmdletBinding\r\n- simplify error handling by:\r\n  - add a `OnError` common parameter #6010\r\n  - wrapping the `begin`, `process`, `end` blocks in a try/catch/finally and rethrow so `throw` works the same as `$PSCmdletBinding.ThrowTerminatingError` does\r\n  - adding a `disposing` block  #6673 (called within the finally) for cleaning up handles\r\n- imply `ValueFromPipelineByPropertyName` (you'd **opt out** instead of opting in)\r\n- make the `process` block the default block, instead of end (like `filter` does)\r\n\r\nWe could perhaps even:\r\n\r\n- make these more strict, like class syntax:\r\n  - use lexical scoping\r\n  - make `Write-Output` mandatory for output\r\n  - force OutputType documentation and adherence\r\n- make `DynamicParameters` easier to use: add accelerators, and allow streaming output of dynamic parameter objects instead of requiring explicit creation of the `RuntimeDefinedParameterDictionary`\r\n\r\n### ... what else?",
  "closed_at": null,
  "comments": [
    {
      "author": "KevinMarquette",
      "author_association": "CONTRIBUTOR",
      "body": "* The `process` block should be the default block if not specified.\r\n* Correct support for `-ErrorAction Ignore`\r\n* Use lexical scoping instead of dynamic scoping",
      "created_at": "2019-02-03T23:58:32Z",
      "updated_at": "2019-02-04T00:02:45Z"
    },
    {
      "author": "rkeithhill",
      "author_association": "COLLABORATOR",
      "body": "I'd really like to see proper Path and LiteralPath parameter a bit more \"built-it\".  To get all the standard behaviors of built-in cmdlets: wilcard expansion, write appropriate error on non-existing path (when path should exist), proper pipeline binding behavior (aliasing PSPath), etc.  Not sure exactly how this would be implemented but I've often wanted a `PathParamter()` attribute e.g.:\r\n```\r\nfunction Get-Foo {\r\n    [CmdletBinding()]\r\n    param(\r\n        [PathParameter(Position=0, ExpandWildcards)]\r\n        [string[]]\r\n        $Path,\r\n\r\n        [PathParameter(Position=0, PathMustExist)]\r\n        [string[]]\r\n        $LiteralPath,   \r\n    )\r\n    ...\r\n}\r\n```\r\nBy the time you see $Path, it has had the supplied Path argument transformed into one or more paths (full expanded).  And if a required path does not exist, PowerShell would write the appropriate error record for the function.",
      "created_at": "2019-02-04T00:12:31Z",
      "updated_at": "2019-02-04T00:12:31Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "@rkeithhill I think perhaps a separate `[PathTransform]` would be better than attempting to merge it with the base `[Parameter]` attribute.",
      "created_at": "2019-02-04T03:02:53Z",
      "updated_at": "2019-02-04T03:04:08Z"
    },
    {
      "author": "bielawb",
      "author_association": "NONE",
      "body": "I would also like this construct to 'swallow' any *break* coming from called commands and also scope internal breaks to just this command.\r\n\r\nOn top of that some easy way to *return* in any of 3 blocks would be nice to have (so that I can stop processing in Begin w/o even starting Process block).",
      "created_at": "2019-02-04T07:20:57Z",
      "updated_at": "2019-02-04T07:20:57Z"
    },
    {
      "author": "Stephanevg",
      "author_association": "NONE",
      "body": "One things I would **really** like is the ability to have a way to **trust** the output type of a function.\r\n\r\nToday we have [OutputType](https://docs.microsoft.com/en-us/powershell/module/microsoft.powershell.core/about/about_functions_outputtypeattribute?view=powershell-6) which allows to specifiy which type will be returned from a that specific function.\r\n\r\nUnfortunatley as specified in the documentation: \r\n>The OutputType attribute value is only a documentation note. It is not derived from the function code or compared to the actual function output. As such, the value might be inaccurate.\r\n\r\nParhaps we could think of having the possibility to have something like a ```strict``` keyword in the function declaration. It would check the output type with the one returned from a function, and **throw an error if the wrong  type is returned**\r\n\r\nSomething like: ```[cmdletBinding(Strict)]``` maybe?\r\n\r\nI could imagine as well, that if 'strict' is set, that the usage of the ```return``` statement would become mandatory.\r\n\r\nThis would help in predicting the behaviour of our functions.\r\n",
      "created_at": "2019-02-04T08:00:42Z",
      "updated_at": "2019-02-04T10:33:22Z"
    },
    {
      "author": "KirkMunro",
      "author_association": "CONTRIBUTOR",
      "body": "IMHO a cmdlet keyword built on top of the class keyword would be best (i.e. a cmdlet would be a very specific implementation of class). I shared my thoughts on this on [this thread](https://github.com/PowerShell/PowerShell/issues/6652#issuecomment-444557931).",
      "created_at": "2019-02-04T14:23:12Z",
      "updated_at": "2019-02-04T14:24:37Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "@Stephanevg forcing a function to use `return` as a keyword is counterproductive, as it prevents the ability to output data as it is processing, forcing it to collate before outputting anything.",
      "created_at": "2019-02-04T14:27:05Z",
      "updated_at": "2019-02-04T14:27:05Z"
    },
    {
      "author": "Jaykul",
      "author_association": "CONTRIBUTOR",
      "body": "@rkeithhill @vexx32 do you maybe want to submit a PR to my [Path attribute](https://github.com/Jaykul/Path), or do you think it really needs to be in the box (also)?\r\n\r\n@Stephanevg @vexx32 I think we could strongly type the OutputType and still use `Write-Output` to allow streaming ...",
      "created_at": "2019-02-04T14:28:56Z",
      "updated_at": "2019-02-04T14:28:56Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "I think such an attribute should be in the box. While the Transform attributes aren't perfect, they are a very useful way to ensure input is in the correct form without cluttering the `begin{}` blocks of a function. Something as fundamental to PowerShell's operation as the _correct handling of paths_ should absolutely be in the box as a prebuilt solution which can be extended if needed via inheritance.\r\n\r\nAs for outputtype, I agree that strongly-typing one's outputtype is a good idea. I don't think it should throw if there is a reasonably clear conversion path from the output object and the target output type, though. I also don't think we need to enforce `return`; after all, the overall return types of `BeginProcessing`, `ProcessRecord`, and `EndProcessing` are _all_ `void`. I don't think it makes sense to muddy the implementation there. \r\n\r\nHowever, enforcing the use of `Write-Output` or `$PSCmdlet.WriteObject()` may be a worthwhile consideration... _if_ such an operation can be made equally performant to the current \"just drop it to output\". Currently, I know `Write-Output` is a bit slower, but I'm not sure if WriteObject() has a similar performance impact, though I'd expect it to be about as fast as dropping directly into the output stream.",
      "created_at": "2019-02-04T14:37:25Z",
      "updated_at": "2019-02-04T14:37:25Z"
    },
    {
      "author": "Jaykul",
      "author_association": "CONTRIBUTOR",
      "body": "@vexx32 (sorry, I didn't meant to lead you further off topic -- I don't disagree that it should be in the box, I filed issues about it a decade ago before I wrote my own solution).\r\n\r\nMaybe the answer to the Write-Output/return question is that `cmdlet` should expose `$PSCmdlet` as `$this` and you'd be required to call that for output if you didn't want to _end_ your block. That would certainly fit in with the idea of making these actual class-based as Kirk has suggested, and ...\r\n\r\nPerhaps we make these `cmdlet` objects instead of `function` objects --  i.e. same precedence as compiled cmdlets, and can only be exposed from a module, etc. Then, switching to `this` and to class-like semantics (with `$this.WriteOutput()`) would make even more sense.\r\n\r\nMAYBE we even create a new file extension `.pscmd` which is equivalent to the cmdlet keyword. We could make modules collect all `.pscmd` files that are in the module (sub)folders and \"compile\" them at module import time...",
      "created_at": "2019-02-04T16:57:25Z",
      "updated_at": "2019-02-04T16:57:36Z"
    },
    {
      "author": "KirkMunro",
      "author_association": "CONTRIBUTOR",
      "body": "That's almost exactly where my mind was heading @Jaykul, including a new file extension, but I liked .psx1 (fits current file extension names), for a new type of module that is compiled, not interpreted. That's discussed on the same thread I linked to earlier, the idea being that .psx1 files (class modules) would have a limited set of things you could do in them.\r\n\r\nI was originally thinking psx1 files could only be used to define cmdlets or classes and include other files that also define cmdlets or classes (dot source? using? a new include keyword? not sure what's the best semantic for that in this context). Functions and other PowerShell commands wouldn't be allowed -- psm1 files already allow you to include those in modules, and there's nothing stopping you from having a psd1 file with a psx1 file or a psd1 file with both psx1 and psm1 files (leveraging RequiredModules and NestedModules according to your needs). Essentially, the psx1 file extension identifies that the content is compiled (which .pscmd would also accomplish, but I like the notion of a compiled module).",
      "created_at": "2019-02-08T16:04:30Z",
      "updated_at": "2019-02-08T16:04:30Z"
    },
    {
      "author": "markekraus",
      "author_association": "CONTRIBUTOR",
      "body": "To further the discussion of the classy cmdlets, Another paradigm often requested by more advanced users is the ability to inherit a base cmdlet that contains common parameters. That's something some what trivial to do in C# but impossible in native PS.",
      "created_at": "2019-02-09T00:42:07Z",
      "updated_at": "2019-02-09T00:42:49Z"
    },
    {
      "author": "KirkMunro",
      "author_association": "CONTRIBUTOR",
      "body": "It's not always trivial in C#, at least not for all cmdlets. Some cmdlets are configured as sealed, preventing other devs from inheriting from them. That's gotten in my way a number of times, but can be partially worked around by creating proxy cmdlets (like proxy functions, but cmdlets), but you need to redefine parameters with that model. I suppose I should submit some PRs to change some of those cmdlets so that they are not sealed, because PowerShell is open source and I don't believe having cmdlet classes as sealed does anything but get in the way when an advanced dev wants to do something creative with existing functionality.",
      "created_at": "2019-02-09T01:52:40Z",
      "updated_at": "2019-02-09T01:52:40Z"
    },
    {
      "author": "markekraus",
      "author_association": "CONTRIBUTOR",
      "body": "@KirkMunro I'm specifically talking about a base class you create and then other classes you create derive from it. For example, if you have an API wrapper module, you will likely have a Session and other common parameters on pretty much all get/set/remove/update cmdlets. In Native PS, you have to manually define all of those common parameters in every advanced function. In c# it is trivial to derive from your own base class to reduce code repetition.",
      "created_at": "2019-02-09T13:27:32Z",
      "updated_at": "2019-02-09T13:28:11Z"
    },
    {
      "author": "cspotcode",
      "author_association": "NONE",
      "body": "How much of this can be prototyped via a source-to-source compiler?  That might be a nice way to experiment and prove out the idea, before it gets added to PSCore proper.",
      "created_at": "2019-03-08T18:06:09Z",
      "updated_at": "2019-03-08T18:06:09Z"
    },
    {
      "author": "cspotcode",
      "author_association": "NONE",
      "body": "I started prototyping a source-to-source transformer to implement some of these ideas.  I would love to hear what people think: bugs, ideas, whatever.  https://github.com/cspotcode/pwsh-transpiler\r\n\r\nThe eventual goal is that you can write modules assuming the future syntax proposed in this thread, and the transformer will rewrite your functions to give you those behaviors.  Eventually, when these capabilities are built-in to PowerShell Core, your code will not need to be transformed.\r\n\r\nWhat I've written so far only took me the past couple hours; I think with a bit more time we could make a productive, useful set of transformers.\r\n\r\nEDIT: I can make anyone a collaborator on the repo if you want to start pushing code.",
      "created_at": "2019-03-08T20:52:35Z",
      "updated_at": "2019-03-08T20:57:09Z"
    }
  ],
  "created_at": "2019-02-03T20:24:02Z",
  "labels": [
    "Issue-Enhancement",
    "WG-Language",
    "Issue-Discussion"
  ],
  "number": 8819,
  "state": "open",
  "title": "Is it time for a \"cmdlet\" keyword?",
  "updated_at": "2021-12-03T16:53:27Z"
}