{
  "_url": "https://github.com/PowerShell/PowerShell/issues/8906",
  "author": "LethiferousMoose",
  "body": "# Summary of the new feature/enhancement\r\nThis is probably going to be a matter of some debate, but I'll propose it anyway. Whenever I create a module in PowerShell I like to use constants at the top of my file for format strings, messages, etc. that I re-use in various functions across my module or just to have a one-stop location to see all my string message related data. It would be nice if there was a more concise way to define a constant than using:\r\n`Set/New-Variable -Name 'SOME_CONSTANT' -Value 'Value' -Option Constant`\r\n`Set/New-Variable 'SOME_CONSTANT' 'Value' -Option Constant`\r\n\r\nIf there was some keyword that could be interpreted by the compiler it would make such declarations more concise and less cluttered\r\n",
  "closed_at": null,
  "comments": [
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "Constants are pretty rare in PowerShell; once they're defined in a session they're basically impossible to remove no matter what you do. Given an administrative context, true constants are almost never needed or desired in most situations that come to mind as common uses of PowerShell. ReadOnly variables are _much_ more common, because should the need arise you can still remove them from the session using `Remove-Variable -Force`\r\n\r\nThat being said, however, I agree that Constant and ReadOnly variables should be able to be declared in a more intuitive fashion. In proper terms, these are typically registered as attributes attached to the internal PSVariable object, and their internal representation is _somewhat_ similar to type-constraining a variable (e.g., `[string]$Word = \"banana\"`). As such, I'd probably think that rather than using up a keyword for this, a specific attribute typing is a little more appropriate to the use here, something along the lines of:\r\n\r\n```powershell\r\n[PSConstant]$Million = 1e6\r\n[ReadOnly]$ConfigVar = @{Name = \"John\"}\r\n```\r\n\r\nThat's kind of the idea I think would be most straightforward to add in, and is in my opinion one of the more apropos forms this could take. 🙂 ",
      "created_at": "2019-02-17T05:17:34Z",
      "updated_at": "2019-02-17T05:17:34Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "@SteveL-MSFT is this something you guys would appreciate a PR for? It came up today in the PS discord community and I dug this one up.\r\n\r\nThe way I see it, we have a couple options:\r\n\r\n1. Keyword: `const $var = $value` ; `readonly $var = $value` \r\n2. Attribute: `[const()]$var = $value`; `[readonly()]$var = $value`\r\n3. Provider syntax: `$const:var = $value`; `$readonly:var = $value`\r\n\r\nWould appreciate some input from others here too, and if there're other ideas on it, more than welcome. This would go a long way towards the usability of const/readonly variables. You don't need 'em often, but when you do they tend to be a pain to add compared to regular variables.",
      "created_at": "2019-09-12T18:47:10Z",
      "updated_at": "2019-09-12T18:47:10Z"
    },
    {
      "author": "SeeminglyScience",
      "author_association": "COLLABORATOR",
      "body": "I think the attribute syntax makes the most sense.\r\n\r\nFor constants, I'd love to see them as a parse time concept.  Define them once per script file and have the compiler use the literal instead of a variable lookup.  Bonus points for allowing them in attribute arguments.  Might be too different from how they currently work though.",
      "created_at": "2019-09-16T18:57:36Z",
      "updated_at": "2019-09-16T18:57:36Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "That would actually be awesome. I'd love to be able to have that.",
      "created_at": "2019-09-16T19:04:56Z",
      "updated_at": "2019-09-16T19:04:56Z"
    },
    {
      "author": "joeyaiello",
      "author_association": "CONTRIBUTOR",
      "body": "+1 to the fact that I don't see constants much in PowerShell. Out of curiosity, is there a reason you don't use `.psd1`s for your static strings and messages? ([Example here](https://www.powershellgallery.com/packages/xSQLServer/7.1.0.0/Content/en-US%5CxSQLServer.strings.psd1))\r\n\r\n(Ooooh, re-reading @SeeminglyScience's post before I hit post, the parse-time nature of this is potentially compelling for PSSA/Editor Services scenarios...)\r\n\r\nBut let me have fun talking implementation assuming that there's value for constants beyond my limited understanding: \r\n\r\nKeywords are difficult because neither `const` nor `readonly` is reserved, so someone could have their own `const` or `readonly` functions:\r\n\r\n```\r\nC:\\Users\\jaiello> function const {'const'}\r\nC:\\Users\\jaiello> const\r\nconst\r\nC:\\Users\\jaiello> function readonly {'readonly'}\r\nC:\\Users\\jaiello> readonly\r\nreadonly\r\n```\r\n\r\nSimilarly, the provider syntax is going to break if someone has a `const` or `readonly` PSDrive:\r\n\r\n```\r\nC:\\Users\\jaiello> $const:var = 'var'\r\nObjectNotFound: Cannot find drive. A drive with the name 'const' does not exist.\r\nC:\\Users\\jaiello> $readonly:var = 'var'\r\nObjectNotFound: Cannot find drive. A drive with the name 'readonly' does not exist.\r\n```\r\n\r\nSo, by default, I think attributes would be the way to go. Plus, I think attributes work really well across the board. ",
      "created_at": "2019-12-18T22:24:29Z",
      "updated_at": "2019-12-18T22:24:29Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "@PowerShell/powershell-committee reviewed this, we agree that attributes is the right solution.  The attributes should have the same semantics as using `Set-Variable` for scoping and behavior (like ability to remove).",
      "created_at": "2019-12-18T23:27:11Z",
      "updated_at": "2019-12-18T23:27:11Z"
    },
    {
      "author": "LethiferousMoose",
      "author_association": "NONE",
      "body": "@joeyaiello I was actually not aware of storing strings in `.psd1` files, had I been looking for an i18n solution, I probably would have come across that...",
      "created_at": "2019-12-19T02:40:35Z",
      "updated_at": "2019-12-19T16:33:29Z"
    },
    {
      "author": "mklement0",
      "author_association": "CONTRIBUTOR",
      "body": "Note that there's now a lengthy debate in effective duplicate #15044 as to whether this syntactic sugar is worth implementing.",
      "created_at": "2021-03-17T22:18:07Z",
      "updated_at": "2021-03-17T22:18:07Z"
    }
  ],
  "created_at": "2019-02-17T04:01:27Z",
  "labels": [
    "Issue-Enhancement",
    "Up-for-Grabs",
    "Committee-Reviewed"
  ],
  "number": 8906,
  "state": "open",
  "title": "Shorthand for defining constants",
  "updated_at": "2021-03-17T22:18:07Z"
}