{
  "_url": "https://github.com/PowerShell/PowerShell/issues/8919",
  "author": "msftrncs",
  "body": "# Summary of the new feature/enhancement\r\n\r\nWhen PowerShell installations are updated on Windows, any pins (start menu, taskbar) for the shell are marked as no longer working, and are then removed, along with any items pinned in the jump lists.  VS Code is able to keep its icon and its jump lists intact during upgrades, and it would be appreciated if PowerShell could do the same.   It appears this was worked on at one time, but the issue might have been slightly different, as those issues are marked closed and resolved.  (#6088)\r\n\r\n# Proposed technical implementation details (optional)\r\n\r\nIt appears that VS Code has a specific mechanism that fires during the install process to preserve the pins so that they stay working.  I don't even remember how I ran across is, but at the time I said, `oh, that's how they do it.'",
  "closed_at": "2019-04-07T19:25:57Z",
  "comments": [
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "If we install to the same folder we shouldn't have the problem.",
      "created_at": "2019-02-21T13:25:57Z",
      "updated_at": "2019-02-21T13:25:57Z"
    },
    {
      "author": "msftrncs",
      "author_association": "CONTRIBUTOR",
      "body": "Every update to two machines so far has resulted in the icon (pinned to taskbar) of the original install being removed the first time I click on it after the upgrade, with a warning saying that something has been removed.   I am not sure that it is saying the target has been removed …   I have looked at the target paths, they look like they should, they just point to \"6\" or \"6-preview\".  This has been happening for both the stable and the preview releases.   I have always used the MSI installer package to install.",
      "created_at": "2019-02-21T18:43:12Z",
      "updated_at": "2019-02-21T18:43:12Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "The shortcut file is created in `%AppData%\\Microsoft\\Internet Explorer\\Quick Launch\\User Pinned\\TaskBar` folder and always reference \"C:\\Program Files\\PowerShell\\6\\pwsh.exe\" -WorkingDirectory ~\".\r\nSo I don't know where root case of the problem is.",
      "created_at": "2019-02-22T07:25:31Z",
      "updated_at": "2019-02-22T07:25:48Z"
    },
    {
      "author": "msftrncs",
      "author_association": "CONTRIBUTOR",
      "body": "I have yet to update my second machine to 6.1.3, I can try to capture some data, checking shortcuts before and after the install.  I'll do that over the weekend.",
      "created_at": "2019-02-22T20:52:57Z",
      "updated_at": "2019-02-22T20:52:57Z"
    },
    {
      "author": "msftrncs",
      "author_association": "CONTRIBUTOR",
      "body": "@iSazonov, during the install (upgrade) process, the shortcut you mentioned above was deleted from the folder you mentioned above.  The icon then goes blank on the taskbar.  I am not sure if the installer (the MSI package) or the OS removed the file.  I was watching the contents of the folder and the file was deleted towards the end of the install (which went pretty quickly).  I made a copy of the shortcut file before the install.  Restoring this file did not completely restore the pin.  The icon was still missing.  I clicked on the 'Change Icon...' button and this interesting message appeared.\r\n\r\n![image](https://user-images.githubusercontent.com/26179051/53468453-e876ae80-3a1f-11e9-8d82-1351cd3d6577.png)\r\n\r\nThe restored pin shortcut does work, it just doesn't have an icon.\r\n\r\nHope this helps.\r\n",
      "created_at": "2019-02-27T05:42:14Z",
      "updated_at": "2019-02-27T05:42:14Z"
    },
    {
      "author": "msftrncs",
      "author_association": "CONTRIBUTOR",
      "body": "After installing 6.2.0 release, I checked the icon location to the start menu shortcut, it points to the installer folder.  The icon really needs to be stored in the application folder.  Looks like its already in the assets folder, but it would appear that the installer keeps updating the start menu shortcut to point to the newest installer folder.\r\n\r\nIt appears that each new update removes the previous installer folder, and its that which causes the pinned link on the taskbar to be removed.  Even if the same install folder is 're-installed' during installation the damage is already done (maybe depending on system speed).",
      "created_at": "2019-03-29T03:31:22Z",
      "updated_at": "2019-03-29T03:31:22Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "/cc @bergmeister @SteveL-MSFT It seems a bug",
      "created_at": "2019-03-29T04:08:36Z",
      "updated_at": "2019-03-29T04:08:36Z"
    },
    {
      "author": "bergmeister",
      "author_association": "CONTRIBUTOR",
      "body": "First of all: I've observed this behaviour as well.\r\nI am wondering if this is a side effect of #7701 . At that time the installation directory had the full version name in it, so it made sense to auto-generate the Guid. Now that the directory name is a constant `6` we could go for the approach of just having 2 separate Guids for RTM and preview and then this might not occur any more.\r\nNote though that the team is usually reluctant to add such improvements in a patched version of PS and 6.3 might be based on MSIX, which is a new installation technology. Therefore even if we submit a PR it might not make it to the end user in time",
      "created_at": "2019-03-29T08:31:14Z",
      "updated_at": "2019-03-29T08:32:13Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "@bergmeister although I'm working on a MSIX package, MSIX aren't installable on Server skus, so we'll still need the MSI.  Go ahead and work on your PR.",
      "created_at": "2019-04-05T18:06:45Z",
      "updated_at": "2019-04-05T18:06:45Z"
    },
    {
      "author": "bergmeister",
      "author_association": "CONTRIBUTOR",
      "body": "OK. I just tried an experiment and reverted the change of #7701 locally and the problem did still occur so it must be something else.\r\nIt looks like it is an `msiexec` problem, see this thread and proposed solution: https://stackoverflow.com/a/33402698/1810304",
      "created_at": "2019-04-05T21:40:43Z",
      "updated_at": "2019-04-05T21:45:30Z"
    }
  ],
  "created_at": "2019-02-19T22:44:13Z",
  "number": 8919,
  "state": "closed",
  "title": "Feature Request: Windows pinned shortcuts to remain after updates",
  "updated_at": "2019-07-17T07:57:46Z"
}