{
  "_url": "https://github.com/PowerShell/PowerShell/issues/8932",
  "author": "Amaroq-Clearwater",
  "body": "# Summary of the new feature/enhancement\r\nOperations in PowerShell which consist of a single task being performed on many things at once could be accelerated significantly using [OpenACC Libraries](https://en.wikipedia.org/wiki/OpenACC) as PowerShell would be able to utilize the parallel computing power of modern GPUs such as those provided by Nvidia, AMD, and even the integrated graphics on various Intel CPUs. For owners of APUs and consumer-class Intel CPUs especially, it would basically be a free performance upgrade!\r\n\r\nOpenACC is best suited for Single-Instruction-Multiple-Data (SIMD) operations, so not _all_ code would benefit from parallelization in this manner.",
  "closed_at": "2019-02-22T03:07:12Z",
  "comments": [
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "@Amaroq-Clearwater PowerShell Core is based on C#, .Net Core and Roslyn and used all benefits from its. I think your suggestion is more for Roslyn. You could start discussion in Roslyn repo.\r\nOn the other hand, you can find several discussions in the repo on how we would benefit from using parallel (calculations).",
      "created_at": "2019-02-21T13:05:10Z",
      "updated_at": "2019-02-21T13:05:10Z"
    },
    {
      "author": "Amaroq-Clearwater",
      "author_association": "NONE",
      "body": "OpenACC could probably be adapted for C#, and .NET Core could probably be adapted with OpenACC. Not sure how difficult it would be, but PowerShell would be far from the only beneficiary if this were to happen.",
      "created_at": "2019-02-21T16:26:03Z",
      "updated_at": "2019-02-21T16:26:03Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "Precisely, and that's what @iSazonov was saying. This kind of change would have to happen at a much lower level than PowerShell, either in Roslyn or in .NET Core. 😄 ",
      "created_at": "2019-02-21T16:31:01Z",
      "updated_at": "2019-02-21T16:31:01Z"
    }
  ],
  "created_at": "2019-02-20T23:33:38Z",
  "labels": [
    "Issue-Enhancement",
    "Resolution-Answered"
  ],
  "number": 8932,
  "state": "closed",
  "title": "Performance Optimization: OpenACC acceleration",
  "updated_at": "2019-02-22T03:07:12Z"
}