{
  "_url": "https://github.com/PowerShell/PowerShell/issues/9072",
  "author": "DarwinJS",
  "body": "# Support Question\r\nWhen creating the chocolatey package for the prerelease of 6.2.0-rc1, I noticed it installs to c:\\program files\\Powershell\\6-preview - the same folders as previews.\r\n\r\nThis makes sense to me as it is non-default version and *should* be an upgrade to a preview - if EVERY prerelease is installed on a given machine.\r\n\r\nDoes it share MSI component GUIDS and Product Codes with actual previews so that we don't end up with two different MSI products pointing to the same file set?\r\n\r\nAlso, is the packaging constructed such that the NEXT preview installed after a pre-release will automatically work as expected and intended by MSI?\r\n\r\nFYI - I updated the regular package to detect prerelease installation and give proper messaging to users - rather than imply they had upgraded their default, production version.\r\n\r\n/cc @TravisEz13 ",
  "closed_at": "2019-03-06T18:33:26Z",
  "comments": [
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "> Does it share MSI component GUIDS and Product Codes with actual previews\r\n\r\nYes, preview and RC have the same product code, release - another one.",
      "created_at": "2019-03-06T13:57:34Z",
      "updated_at": "2019-03-06T13:58:38Z"
    },
    {
      "author": "DarwinJS",
      "author_association": "CONTRIBUTOR",
      "body": "Awesome - thanks!",
      "created_at": "2019-03-06T18:33:26Z",
      "updated_at": "2019-03-06T18:33:26Z"
    },
    {
      "author": "TravisEz13",
      "author_association": "MEMBER",
      "body": "In effect, the RC is a special kind of preview.  If that makes sense.  The plan for now is for the stable build to be one continuous upgrade and the previews to be one continuous upgrade until we find something that prevents that plan.",
      "created_at": "2019-03-07T20:29:08Z",
      "updated_at": "2019-03-07T20:29:08Z"
    }
  ],
  "created_at": "2019-03-06T12:53:48Z",
  "number": 9072,
  "state": "closed",
  "title": "previews and prereleases use the same folder",
  "updated_at": "2019-03-07T20:29:08Z"
}