{
  "_url": "https://github.com/PowerShell/PowerShell/issues/9141",
  "author": "SteveL-MSFT",
  "body": "Make it easier to notify users that a new servicing release or newer GA release is available on non-preview builds.  On preview builds, notify when new preview release is available.\r\n\r\nWe should probably push latest information to a well known Azure Blob during publishing time.  On startup, have the check run on a separate thread to do the check and store some state (maybe just the latest version) on the system (probably a file).  On next startup, if that file exists, compare versions and if running one is older, show the message.",
  "closed_at": "2019-10-15T20:38:20Z",
  "comments": [
    {
      "author": "GeeLaw",
      "author_association": "NONE",
      "body": "Perhaps provide an `Update-PowerShell` cmdlet (don't know if it's already there...) and users who want it could call this in their `$PROFILE`? We should be careful when introducing interactive elements to the shell, because automation workflows that invoke PowerShell without `-NonInteractive` (which I assume is everywhere) could get broken.\r\n\r\nIf you're making `Update-PowerShell`, I propose the following prototype:\r\n\r\n```powershell\r\nFunction Update-PowerShell\r\n{\r\n    [CmdletBinding(SupportsShouldProcess=$True,\r\n        ConfirmImpact='High')]\r\n    Param\r\n    (\r\n        [switch]$Automatic,\r\n        <# Not really needed from the perspective of functionality.\r\n         # Convenient alternative for -Confirm:$False\r\n         #>\r\n        [switch]$Force\r\n    )\r\n    Begin\r\n    {\r\n        If ($Force)\r\n        {\r\n            $local:ConfirmPreference = [System.Management.Automation.ConfirmImpact]::None;\r\n        }\r\n        $local:InstallPowerShellUpdate = {\r\n            If ($PSCmdlet.ShouldProcess('PowerShell new version', 'Install'))\r\n            {\r\n                Write-Host 'Install new version.';\r\n            }\r\n            Else\r\n            {\r\n                Write-Host 'Do not install because of WhatIf or denied confirmation.';\r\n            }\r\n        };\r\n        If ($Automatic)\r\n        {\r\n            Write-Host 'Check if a new version is already found and recorded.';\r\n            Write-Host 'If no new version is recorded:';\r\n            If ($PSCmdlet.ShouldProcess('PowerShell new version', 'Check in background'))\r\n            {\r\n                Write-Host 'Check in background.';\r\n            }\r\n            Write-Host 'If a new version is already recorded:';\r\n            . $InstallPowerShellUpdate;\r\n        }\r\n        Else\r\n        {\r\n            Write-Host 'Check the new version synchronously and report error.';\r\n            Write-Host 'If a new version is found:';\r\n            . $InstallPowerShellUpdate;\r\n            Write-Host 'If no new version is found:';\r\n            Write-Host \"Write-Verbose 'PowerShell is up-to-date.'\";\r\n        }\r\n    }\r\n}\r\n```\r\n",
      "created_at": "2019-03-15T02:27:57Z",
      "updated_at": "2019-03-15T02:27:57Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "I'm sure it should not be in the engine. \r\nThis is the function of package managers, WindowsUpdate, secure scanners and so on. If customer OS system is well-configured (pre-configured) the customer always get the new version notification and get update.\r\nThe presence of non-standard features is always a problem for centralized management in the enterprise environment.",
      "created_at": "2019-03-15T03:28:06Z",
      "updated_at": "2019-03-15T18:13:08Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "@iSazonov There isn't a good package manager story on Windows.  Also, if the user isn't installing the package, but using the zip or tgz, they won't know there is a newer version.  It would make sense if we want this notification to only be active for an interactive shell.  Many apps (Chrome, VSCode) handle their own notification to the user that an update is available.  `Update-PowerShell` is a bit more complicated particularly on Windows where open files can't be overwritten although it's possible to download it to a known location and on startup install it (using a helper process) if it's detected.",
      "created_at": "2019-03-15T17:34:57Z",
      "updated_at": "2019-03-15T17:34:57Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "> There isn't a good package manager story on Windows. \r\n\r\nWindows has great update infrastructure. Standalone Internet connected computer always gets updates from WindowsUpdate. In isolated enterprise network WSUS and SCCM is great tools.\r\nFirefox and Chrome have msi installers for enterprises. \r\nIt is products that do not have such capabilites create a headache for enterprise system administrators and annoy users with their reminders and notifications.\r\n\r\nAlso we cannot force users to use a newer version if they have no motivation or need (or it is disabled by local enterprise policy).\r\nIf we talk about security, then again this is a task for other products (WindowsUpdate, Windows Defender ...). It is too wasteful to inject in each utility its own update/notify tool.",
      "created_at": "2019-03-15T18:40:50Z",
      "updated_at": "2019-03-15T18:40:50Z"
    },
    {
      "author": "HumanEquivalentUnit",
      "author_association": "CONTRIBUTOR",
      "body": "> We should probably push latest information to a well known Azure Blob during publishing time.\r\n\r\nThis would be nice, I would like more software to do something like this. If it was as simple as `Invoke-RestMethod -Uri https://aka.ms/PowerShellCoreLatestVersionData` with no login and no complex protocols, people could implement their own checks very easily.\r\n\r\n> Also, if the user isn't installing the package, but using the zip or tgz, they won't know there is a newer version.\r\n\r\nThe recent Telemetry RFC - that will feedback to Microsoft how often PowerShell Core is opened, and will include versions, is that right? If so, waiting until that is implemented could provide context for how many people are not updating, to see if this is a problem which needs solving. I feel that people who download PowerShell Core from a zip/tgz are the sort of people who will be able to update when they want to, or will know that they don't want to.\r\n\r\nIn the meantime, an opt-in mailing list \"tell me when there are updates\" on the download page, could be less effort (assuming Microsoft has existing mailing list infrastructure), and could indicate how much demand there is for knowing about new versions. I feel that people who download PowerShell zip/tgz are more likely to know about 3rd party package managers on Windows than the general population.\r\n\r\nNote that Chrome installs a service, getting update approval once, and never prompting again. I think it only prompts if you leave the browser open for a long time, but if you close/open it regularly, the updates just happen. If there is going to be effort into an update mechanism, could that \"ask once, do it for me\" be an option for an MSI install?",
      "created_at": "2019-03-16T06:00:43Z",
      "updated_at": "2019-03-16T06:02:34Z"
    },
    {
      "author": "stknohg",
      "author_association": "CONTRIBUTOR",
      "body": "I'm digressing, but I had published [Update-PowerShellCore](https://github.com/stknohg/PSCoreUpdate/blob/v2.0.0/PSCoreUpdate/Update-PowerShellCore.ps1) function in my module ([PSCoreUpdate](https://github.com/stknohg/PSCoreUpdate)) a year ago.\r\nThis will be helpful for updating PowerShell Core on Windows and macOS.",
      "created_at": "2019-03-17T03:56:51Z",
      "updated_at": "2019-03-17T03:56:51Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "Related RFC https://github.com/PowerShell/PowerShell-RFC/pull/97",
      "created_at": "2019-03-19T04:17:29Z",
      "updated_at": "2019-03-19T04:17:29Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "After further thinking about this, I definitely would not want to have this opportunity on enterprice and cloud servers - OS images there should be managed centrally and have predictable versions of applications. This feature could be moved to our new decoupled helper module, which, when loaded in an interactive session, could check for a new version (in the background and with help -CheckNewVersion).",
      "created_at": "2019-04-28T06:05:17Z",
      "updated_at": "2019-04-28T06:05:17Z"
    },
    {
      "author": "mziyabo",
      "author_association": "NONE",
      "body": "Just to add- if the newer version notification could also come when one calls `$PSVersionTable` to give a headsup to the user that they are current/behind that would be quite useful/timely",
      "created_at": "2019-10-10T16:15:19Z",
      "updated_at": "2019-10-10T16:15:19Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "Fixed via https://github.com/PowerShell/PowerShell/pull/10689",
      "created_at": "2019-10-15T20:38:20Z",
      "updated_at": "2019-10-15T20:38:20Z"
    }
  ],
  "created_at": "2019-03-14T20:27:28Z",
  "number": 9141,
  "state": "closed",
  "title": "Notification on startup that a newer version is available",
  "updated_at": "2019-10-15T20:38:27Z"
}