{
  "_url": "https://github.com/PowerShell/PowerShell/issues/9254",
  "author": "msftrncs",
  "body": "# Summary of the new feature/enhancement\r\n\r\nIs there a reasonable shorthand to use the namespace variable notation to reference the current drive on Windows systems?  (at least I think this would be a Windows only thing). \r\n\r\nI guess the same notation would be a question on Linux like systems as well, in order to access a relative path of the file system provider?\r\n\r\n# Proposed technical implementation details (optional)\r\n\r\nIf not, could a notation such as `${.:somefile.txt}` be suitable?  It appears that '.' and '~' have been reserved from being part of drive names.  Either one could work here.\r\n",
  "closed_at": null,
  "comments": [
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "`.` isn't really the current _drive_; it's the current **directory**. Similarly, `~` refers to the user's home directory.\r\n\r\nThey're folders on the current or a specific PSDrive.\r\n\r\nThat said, I agree it makes sense to allow these relative (semi-relative(?) in the case of `~`) markers to be used for the namespace variable notation, except perhaps since they're not actually drive names they should probably still follow the colon perhaps? `${:./somefile.txt}`\r\n\r\nEDIT: A little bit of messing around seems to indicate that at least the first request is semi-possible:\r\n\r\n`${C:somefile.txt}` accesses `somefile.txt` in the current folder on drive C, as well as `${C:.\\somefile.txt}`",
      "created_at": "2019-03-30T01:02:15Z",
      "updated_at": "2019-03-30T01:21:55Z"
    },
    {
      "author": "msftrncs",
      "author_association": "CONTRIBUTOR",
      "body": "But, without specifying a drive, its just a variable.   I was proposing that `.` could be a drive that represents the current drive (in addition to the fact that it also represents the current folder in a normal path).\r\n\r\nYour example using `C:`  is was what I was basing this on.  You can get to the current folder on an existing drive if you specify the drive, but you cannot specify a filesystem provider path that also uses the current drive, or working path, which you may not know the drive.\r\n\r\nIf there isn't a way to accomplish this now in the current language, I think its a missing feature of completeness.\r\n\r\nTo be fair, it could also just be a drive called `pwd:`.",
      "created_at": "2019-03-30T02:38:08Z",
      "updated_at": "2019-03-30T02:38:08Z"
    },
    {
      "author": "msftrncs",
      "author_association": "CONTRIBUTOR",
      "body": "Fired up Ubuntu to make sure I understood how things work in a Linux world, and noticed that even though `/` is not a valid drive name character, the primary file system provider drive is `/` (since Linux doesn't have drives per say).   This would indicate there is some precedence to use reserved characters in a core system drive name.\r\n\r\nHowever, I seem to be unable to get this notation to work at all on ubuntu, with PS 6.1.1.  It seems that the `/` drive is not actually valid, even though it is defined.\r\n\r\nEdit: Updated the Ubuntu VM, and still the same behavior with PS 6.2.",
      "created_at": "2019-03-30T02:58:58Z",
      "updated_at": "2019-03-30T04:16:31Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "Yeah that's an existing bug; I think @mklement0 opened an issue for that one not too long ago.",
      "created_at": "2019-03-30T03:25:40Z",
      "updated_at": "2019-03-30T03:25:40Z"
    },
    {
      "author": "mklement0",
      "author_association": "CONTRIBUTOR",
      "body": "Thanks, @vexx32: it's #3245",
      "created_at": "2019-03-30T03:38:54Z",
      "updated_at": "2019-03-30T03:38:54Z"
    },
    {
      "author": "msftrncs",
      "author_association": "CONTRIBUTOR",
      "body": "So, I thought maybe `${filesystem::.somefile.txt}` would work, but `filesystem::` provider current working directory doesn't follow PowerShell's working directory, aka, the issue with [xml] save() method.",
      "created_at": "2019-04-27T23:04:39Z",
      "updated_at": "2019-04-27T23:04:39Z"
    }
  ],
  "created_at": "2019-03-30T00:24:26Z",
  "labels": [
    "Issue-Enhancement"
  ],
  "number": 9254,
  "state": "open",
  "title": "Feature Request/Clarification namespace variable notation shorthand for current drive or working directory?",
  "updated_at": "2019-04-27T23:04:39Z"
}