{
  "_url": "https://github.com/PowerShell/PowerShell/issues/9296",
  "author": "ylluminate",
  "body": "# Make PowerShell not only POSIX compliant, but also ZSH & BASH compatible.\r\n\r\nI don't want to start any kind of negative feedback loop here, but I'm thinking about a way for folks like me to give PowerShell a chance.  I've used it off and on for years and each time I've used it I have always spit and cursed under my breath about how on earth could MS be pushing backwards vs forging ahead with a proven technology that sys admins and developers already know and love around the globe.  I'm impressed that Microsoft is taking such steps as open sourcing this and I think this kind of an attempt at a visionary movement forward is both honorable and praiseworthy.\r\n\r\nIn an effort to unify the shell world, I think PowerShell could get really creative by providing a ZSH and BASH compatibility layer.  Frankly I'd probably use PowerShell if I could do this as I'd feel good about it being supported by a serious, large and long term investor like Microsoft - even though it would be on macOS for my OS flavor.\r\n\r\nSo to this end, could you please implement a POSIX compliant layer in conjunction with ZSH and BASH compatibility that would allow us to bring our decades of accrued shell scripts and configurations over to PowerShell?\r\n\r\n\r\n",
  "closed_at": "2019-06-01T00:00:42Z",
  "comments": [
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": ">  please implement a POSIX compliant layer\r\n\r\nThis has already been done. You can run these scripts from PowerShell just like any other application.",
      "created_at": "2019-04-05T06:43:02Z",
      "updated_at": "2019-04-05T06:43:02Z"
    },
    {
      "author": "msftbot[bot]",
      "author_association": "NONE",
      "body": "This issue has been marked as answered and has not had any activity for **1 day**. It has been closed for housekeeping purposes.",
      "created_at": "2019-06-01T00:00:15Z",
      "updated_at": "2019-06-01T00:00:15Z"
    },
    {
      "author": "KirkMunro",
      "author_association": "CONTRIBUTOR",
      "body": "@ylluminate Even though this has been marked as answered, I'd like to ask you a few questions if you're still paying attention to this thread.\r\n\r\n> I've used it off and on for years and each time I've used it I have always spit and cursed under my breath about how on earth could MS be pushing backwards vs forging ahead with a proven technology that sys admins and developers already know and love around the globe.\r\n\r\nCan you go into a bit more detail on this point? What about it has made you \"spit and curse\" when using it? What makes you feel MS is pushing backwards vs forging ahead?\r\n\r\n> In an effort to unify the shell world, I think PowerShell could get really creative by providing a ZSH and BASH compatibility layer.\r\n\r\nWhat does such a compatibility layer look like to you? Are there specific things you want added? If so, can you share some examples? Or did the replies above telling you that you could just invoke bash with an inline script really address your concerns? Since you didn't respond, I have no idea if that is all you were looking for or not.\r\n\r\nFYI, related to this topic, there are some discussions going on about adding language syntax that has bash users in mind. For example, [this RFC that is currently in a PR](https://github.com/PowerShell/PowerShell-RFC/pull/192). It proposes adding chaining via `&&` and `||`. If it's more features like those that you're looking for, what else?",
      "created_at": "2019-06-17T01:23:02Z",
      "updated_at": "2019-06-17T01:23:02Z"
    },
    {
      "author": "MyriaCore",
      "author_association": "NONE",
      "body": "Old post, but as far as I can tell, Powershell is NOT currently POSIX compatible, as @iSazonov suggested. I've been toying around with it since I've been trying out [fvim](https://github.com/yatli/fvim) on windows. There are basic POSIX things that aren't supported and just not there. \r\n\r\nTo demystify what \"POSIX compatibility\" means for users like @KirkMunro, it basically just amounts to support for a subset of syntax and functionality called the POSIX Shell, which is laid out in [this document](https://pubs.opengroup.org/onlinepubs/9699919799.2018edition/utilities/V3_chap02.html#tag_18). It includes things like, but not limited to:\r\n\r\n- `$@`, which is equivalent to `$args`\r\n- `$1`, `$2`, etc to get the first and second arguments, and so on\r\n- `if` / `fi`, `case` /  `esac` syntax\r\n\r\nThis syntax looks super fugly, especially for those who are used to the way PS does things. However, it's an important stepping stone, because it would attract people from the linux world who may have kept from switching to PS as their main scripting shell because their scripts wouldn't be guaranteed to run in PS. ",
      "created_at": "2020-07-13T15:22:04Z",
      "updated_at": "2020-09-04T20:31:23Z"
    },
    {
      "author": "brandones",
      "author_association": "NONE",
      "body": "PowerShell does not parse variable assignments in a POSIX-compliant way, see [the same document linked above](https://pubs.opengroup.org/onlinepubs/9699919799.2018edition/utilities/V3_chap02.html), section 2.9.1 Simple Commands. `FOO=bar echo \"$FOO\"` should print `bar`.",
      "created_at": "2022-03-09T17:42:11Z",
      "updated_at": "2022-03-09T17:42:11Z"
    }
  ],
  "created_at": "2019-04-04T21:22:27Z",
  "number": 9296,
  "state": "closed",
  "title": "POSIX'ify, ZSH'ify & BASH'ify PowerShell?",
  "updated_at": "2022-03-09T17:42:11Z"
}