{
  "_url": "https://github.com/PowerShell/PowerShell/issues/9339",
  "author": "PaulHigin",
  "body": "Named pipe IPC tests hang occasionally, and it is likely due to the target process host listener thread not running.  A named pipe connection attempt can be terminated with `Ctrl+C`, and also there is a 60 second timeout that will abandon the connection attempt.  But once a pipe connection is made there is no way to terminate the session except via the protocol.\r\n\r\nIf the listener thread stops running for some reason, the session cannot be disconnected because there is no way for protocol messages to be passed and handled, resulting in a hang.\r\n\r\nWe can fix this by implementing a 'heart beat' check to ensure the connection is still alive and working.  The heart beat can occur every 60 seconds and if no response is detected (within 60 seconds) then the connection is terminated at both sides.\r\n\r\nUnfortunately this will require a protocol/document change.\r\n\r\nAnother fix might be to ensure a listener thread ending always results in the named pipe object on the server being closed, which should cause the client to throw an error.  But a heart beat would be more reliable and detect more types of transport failures.\r\n\r\n# Steps to reproduce\r\n\r\n```powershell\r\n# Disable the listener thread by building a test version SMA.dll\r\n# Connect to an instance of the test version via named pipe\r\nPS> Enter-PSHostProcess -Id <procId>\r\n```\r\n\r\n# Expected behavior\r\n\r\n```none\r\nCmdlet should eventually timeout with an error\r\n```\r\n\r\n# Actual behavior\r\n\r\n```none\r\nCmdlet hangs\r\n```\r\n\r\n# Environment data\r\n\r\n```none\r\nName                           Value\r\n----                           -----\r\nPSVersion                      6.2.0\r\nPSEdition                      Core\r\nGitCommitId                    6.2.0\r\nOS                             Microsoft Windows 10.0.17763\r\nPlatform                       Win32NT\r\nPSCompatibleVersions           {1.0, 2.0, 3.0, 4.0…}\r\nPSRemotingProtocolVersion      2.3\r\nSerializationVersion           1.1.0.1\r\nWSManStackVersion              3.0\r\n```\r\n",
  "closed_at": null,
  "comments": [],
  "created_at": "2019-04-10T22:56:57Z",
  "number": 9339,
  "state": "open",
  "title": "Enter-PSHostProcess will hang if target process listener is not running",
  "updated_at": "2019-04-11T16:21:45Z"
}