{
  "_url": "https://github.com/PowerShell/PowerShell/issues/9565",
  "author": "Bartolomeus-649",
  "body": "_[NOTE: This is only about software provided by Microsoft, not anything by 3ed party or community provided]_  \r\n  \r\n# How to properly install and keep PowerShell up to date with the latest patches and updates\r\n\r\nThe documentation today tell how to do the initial installation in different ways depending on the platform, but there is no info on how to keep PowerShell up-to-date.\r\n\r\n## How do you manage, support, maintain and keep a PowerShell core up-to-date in a an enterprise environment?\r\n\r\n- There's need for a architectural overview on the life-cycle of the PowerShell Core runtime, as well as different modules.\r\n    - Exactly what is Powershell Core?  \r\n        - Is it \"part of\" the Windows operating system?\r\n        - What is the support lifetime for PowerShell Core?\r\n        - What about modules? Will the be around or can they be dropped without support at anytime without notice?\r\n    - Exactly how does powerShell core relate to WindowsPowershell?\r\n      - When do Microsoft recommend Powershell Core (and when not) to be used?\r\n      - When do Microsoft recommend WindowsPowerShell (and when not) to be used?\r\n      - Is Windows Powershell still something Microsoft invest in, or is the way forward Powershell Core?\r\n      - Will all Microsoft products, services, servers and so on provide cmdLets for both Windows PS and PS Core?\r\n    - What are the ambitions of PowerShell Core?\r\n       - Will PS Core in the long run get all the features of Windows PS (like `-Computer `parameter, workFlows and so on) \r\n      - Will PS Core replace Windows PS in the OS?\r\n    - Best practises for different scenarios of using, running, deploying and maintaining PS Core in a heterogeneous enterprise environment.\r\n      We need to know not only only one way to make something work, but what is the intended way of using things, else it is way too risky to setup and implement it in a an enterprise environment where you have 10s of thousands of machines all over the world. You need to know that you do things the correct way, and the way things are intended to be done (as opposed to the way some guy on StackOverflow might have gotten something to work on \"his machine\").\r\n  \r\n- There need to be information on how updates and patches are provided and distributed?\r\n    - Will they show up in Windows Update?\r\n    - Are we to manually check some resource for security and update information?\r\n    - OR what?\r\n  \r\n- What are the recommended way of updating Powershell Core in an enterprise environment, where you have installations on multiple servers running different versions of Windows and other OS:es, as well as multiple clients running different versions windows. And where the OS on both servers and clients might be in different languages, cultures and time-Zones?\r\n    - Should you push out updates with SCCM/WSUS (or something similar)?\r\n       **If not here, than how do you get critical security updates and make sure you don't miss anything?**\r\n    - Should you somehow run PowerShell commands on each individual machine (like `Update-Module` or something like that)? If so what is the recommended way of doing so?\r\n  \r\n- How do you manage updates of modules that don't work with Update-Module (like for example `PowerShellGet`)?  \r\n  \r\n- How do you get/install/update the correct/latest documentation/help on all machines (for example, the help for `Find-Module` ends with this \"Get-Help cannot find the Help files for this cmdlet on this computer. It is displaying only partial help.\", still, Update-Help makes no difference, but when -Online is used, you are presented with this web page, which has the complete help: https://docs.microsoft.com/en-us/powershell/module/PowershellGet/Find-Module?view=powershell-5.1)?\r\n\r\n\r\n",
  "closed_at": null,
  "comments": [
    {
      "author": "adityapatwardhan",
      "author_association": "MEMBER",
      "body": "Some information about the support life cycle can be found here: https://docs.microsoft.com/en-us/powershell/scripting/powershell-support-lifecycle?view=powershell-6\r\n\r\nSome information about security issue announcements can be found here:\r\nhttps://github.com/PowerShell/Announcements\r\n\r\nAlso see this blog about PowerShell 7: https://devblogs.microsoft.com/powershell/the-next-release-of-powershell-powershell-7/\r\n\r\nHopefully this answers some of your questions. ",
      "created_at": "2019-05-10T16:52:20Z",
      "updated_at": "2019-05-10T16:52:20Z"
    },
    {
      "author": "Bartolomeus-649",
      "author_association": "NONE",
      "body": "I can not see any info on how WSUS/SCCM will pick up any updates, patches or security fixes. I can't even find a clear process on **how you manually, on a single computer** install, manage, patch, upgrade and keep a PowerShell installation up to date.\r\n\r\nIt looks like v7 might be more structured and adapted for an enterprise environment, because we can't have a guy surfing around and google to find out what's going on and if there's a new patch or something. Also, PowerShell without modules becomes dull quickly, but there need to be the same level of support, predictability, documentation and consistency as with PowerShell itself.\r\nIt need to be crystal clear which modules are supported, endorsed and maintained by Microsoft.",
      "created_at": "2019-05-10T17:31:46Z",
      "updated_at": "2019-05-10T17:31:46Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "Earlier MSFT team announced that they will publish updates in Windows Update channel but I never saw them there https://www.catalog.update.microsoft.com/Search.aspx?q=PowerShell%20Core\r\nIt is true for .Net Core too.\r\n",
      "created_at": "2019-05-11T18:24:53Z",
      "updated_at": "2019-05-11T18:24:53Z"
    },
    {
      "author": "fMichaleczek",
      "author_association": "NONE",
      "body": "## I am not a Microsoft employee\r\n\r\n@Bartolomeus-649 \r\n\r\n> I can't even find a clear process on how you manually, on a single computer install, manage, patch, upgrade and keep a PowerShell installation up to date.\r\n\r\nI understand what you want but PowerShell 6+ is now a normal software that can be download as a MSI or ZIP (to manage multiversion on the same system).\r\nHow do you handle 3rd parties softwares update with SCCM ?\r\n\r\nHave you got issue with the current documentation ? [Installing PowerShell Core on Windows](https://docs.microsoft.com/en-us/powershell/scripting/install/installing-powershell-core-on-windows?view=powershell-6)\r\n\r\n> because we can't have a guy surfing around and google to find out what's going on and if there's a new patch or something\r\n\r\nIn Europe, with GDPR, it's now a real job :)\r\nAs a workaround, Github has a option to be notified for each release on this repository. \r\n[Chocolatey](https://chocolatey.org) is also compatible with SCCM and has a business options\r\n\r\n> It need to be crystal clear which modules are supported, endorsed and maintained by Microsoft.\r\n\r\nThere is a property on module to check that : \r\n`Get-Module -ListAvailable | Where { $_.ModuleBase -like \"$env:windir\\*\" -and $_.CompatiblePSEditions -contains \"Core\" }`\r\n\r\nI found 61/110 modules on Windows 10 20TH1 with administrative tools installed.\r\nSource : [Windows PowerShell Module](https://docs.microsoft.com/en-us/powershell/scripting/powershell-support-lifecycle?view=powershell-6#windows-powershell-module) | [Modules with compatible PowerShell Editions](https://docs.microsoft.com/en-us/powershell/gallery/concepts/module-psedition-support)\r\n\r\nI think until PowerShell is bring with Windows (as an optional features first), you have to wait. I'm surprised you don't ask for GPO settings too because it's another problem for an enterprise deployement.\r\n\r\nIn a Windows 10 or Windows Server environment, I prefer to stay with Windows PowerShell. \r\n\r\n\r\n",
      "created_at": "2019-05-12T01:20:49Z",
      "updated_at": "2019-05-12T01:20:49Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "> I'm surprised you don't ask for GPO settings too because it's another problem for an enterprise deployement.\r\n\r\nDiscussed here https://github.com/PowerShell/PowerShell-RFC/pull/111",
      "created_at": "2019-05-12T17:37:48Z",
      "updated_at": "2019-05-12T17:37:48Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "> In a Windows 10 or Windows Server environment, I prefer to stay with Windows PowerShell.\r\n\r\n@fMichaleczek Please open new issue with feedback why you prefer Windows PowerShell. ",
      "created_at": "2019-05-12T17:40:04Z",
      "updated_at": "2019-05-12T17:40:04Z"
    },
    {
      "author": "fMichaleczek",
      "author_association": "NONE",
      "body": "@iSazonov I prefer the latest version :) So I can't provide feedback. Let's me give you a more detailed response.\r\n\r\nIn corporate environment, for my customers who want to have a full support from Microsoft Premier, my advice for a massive deployment is to wait PowerShell Core is part of Windows (and by consequence updated throught WSUS / SCCM, declared to AMSI, GPO implemented , firewall rules declared for PSRemoting). This is the bare minimum for them to be reassuring.\r\n\r\nAs I see it, some old Microsoft customers have a particular mindset and this situation is a consequence of  years of lobbying against FOSS ... So don't think it will change until a moment.\r\n\r\nIn my opinion, the issue is around  integration in Windows, not PowerShell by itself.",
      "created_at": "2019-05-14T13:20:34Z",
      "updated_at": "2019-05-14T13:20:34Z"
    },
    {
      "author": "Chri-s",
      "author_association": "NONE",
      "body": "> ## I am not a Microsoft employee\r\n> @Bartolomeus-649\r\n> \r\n> > I can't even find a clear process on how you manually, on a single computer install, manage, patch, upgrade and keep a PowerShell installation up to date.\r\n> \r\n> I understand what you want but PowerShell 6+ is now a normal software that can be download as a MSI or ZIP (to manage multiversion on the same system).\r\n> How do you handle 3rd parties softwares update with SCCM ?\r\n\r\nHow about smaller environments which only have a WSUS server but don't have SCCM?\r\nAs far as I understand it, Powershell Core is a Microsoft product, even if it is open source. I don't see any point in *not* updating it via Microsoft Update.\r\n\r\nThat way:\r\n - updates are found easily without searching on web sites for new releases\r\n - the administrator can see whether all PCs and servers are on a patched version\r\n - updates can be installed without logging onto each PC to start an update (normal user accounts shouldn't have admin permissions) or trying to automate it with GPO startup scripts\r\n\r\nI would like to use the new PowerShell Core, but without a proper update management I won't install it in our environment. Not every user is a DevOp that updates his own PC.\r\n\r\nI just saw that on linux, Powershell can be installed by apt-get: https://docs.microsoft.com/en-us/powershell/scripting/install/installing-powershell-core-on-linux?view=powershell-7#ubuntu-1804\r\nI assume that updates will also be found by apt-get update?\r\n\r\n_Why are updates for a Microsoft product easier on linux than on Windows?_\n\n<blockquote><img src=\"https://docs.microsoft.com/en-us/media/logos/logo-ms-social.png\" width=\"48\" align=\"right\"><div><strong><a href=\"https://docs.microsoft.com/en-us/powershell/scripting/install/installing-powershell-core-on-linux\">Installing PowerShell Core on Linux - PowerShell</a></strong></div><div>Information about installing PowerShell Core on various Linux distributions</div></blockquote>",
      "created_at": "2020-02-26T18:16:23Z",
      "updated_at": "2020-02-26T18:16:25Z"
    },
    {
      "author": "JoelMiller74",
      "author_association": "NONE",
      "body": "I have to agree with this request. I can easily install Powershell 7 on a system with an MSI. However, how do I ensure that it updates to 7.01 after it is released? How do I ensure that it is properly patched? We use SCCM but could use Windows Update or WSUS. I prefer the upgrades and updates to come through those channels.",
      "created_at": "2020-06-17T02:49:05Z",
      "updated_at": "2020-06-17T02:49:05Z"
    }
  ],
  "created_at": "2019-05-08T19:40:43Z",
  "labels": [
    "Issue-Question",
    "Area-Maintainers-Documentation"
  ],
  "number": 9565,
  "state": "open",
  "title": "How to maintain PowerShell in an Enterprise environment?",
  "updated_at": "2020-06-17T02:49:05Z"
}