{
  "_url": "https://github.com/PowerShell/PowerShell/issues/9591",
  "author": "lukeschlather",
  "body": "# Set-StrictMode should cause errors to terminate execution.\r\n\r\nIn most languages with exceptions, an unhandled exception causes the program to terminate. However, Powershell defaults to continuing on when an unhandled exception occurs.\r\n\r\nAs a result, I think it is currently widely considered a best practice to begin all scripts with:\r\n\r\n```\r\n$ErrorActionPreference = \"Stop\"\r\nSet-StrictMode -Version 3.0\r\n```\r\n\r\n# Proposed change\r\n\r\nThis should be equivalent to the above:\r\n```\r\nSet-StrictMode -Version 4.0 \r\n```\r\n\r\nThere is also some discussion in https://github.com/PowerShell/PowerShell-RFC/pull/88 .\r\nI think that whatever the mechanism for causing non-zero exit codes to halt execution, that should also be included in StrictMode.",
  "closed_at": null,
  "comments": [
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "It's not so much that PS continues on when unhandled exceptions occur... it's that many commands _explicity elect_ to output a **non-terminating** error for non-serious scenarios. For example, if a particular object coming from pipeline input is mangled / unusable, a non-terminating error is usually written, allowing the rest of the probably OK data to be processed. If instead a specific non-pipelined parameter value is unusable, the error is usually considered terminating as the command cannot reliably process any input.\r\n\r\nStrict Mode shouldn't have any bearing on this behaviour, in my opinion, and should remain a separate setting.",
      "created_at": "2019-05-13T20:54:29Z",
      "updated_at": "2019-05-13T20:54:29Z"
    },
    {
      "author": "KalleOlaviNiemitalo",
      "author_association": "NONE",
      "body": "`Set-StrictMode -Version 3.0` already means something else, although it is undocumented. See MicrosoftDocs/PowerShell-Docs#2135.",
      "created_at": "2019-05-15T14:14:06Z",
      "updated_at": "2019-05-15T14:14:06Z"
    },
    {
      "author": "lukeschlather",
      "author_association": "NONE",
      "body": "\"allowing the rest of the probably OK data to be processed\" seems contrary to the spirit of StrictMode. @vexx32 you're saying that you usually use Set-StrictMode but not \"ErrorActionPreference\" = \"Stop\" ?\r\n\r\nIt would be interesting to get a sense for what style guides in different organizations look like. I think my big concern is I would advocate any style guide do max strict mode and \"ErrorActionPreference\" = \"Stop\" and I think all my coworkers agree. So having them separate settings seems bad since it makes it easy for people who want both to be unaware of one.",
      "created_at": "2019-05-23T22:05:29Z",
      "updated_at": "2019-05-23T22:05:29Z"
    },
    {
      "author": "KirkMunro",
      "author_association": "CONTRIBUTOR",
      "body": "I don't think terminating error handling should be a strict-mode feature -- it would be too easy to wreak havoc if someone turned it on and they happened to use modules or scripts that use `Set-StrictMode -Version Latest`.\r\n\r\nThere is an alternate proposal on how terminating errors could terminate properly as part of a collection of 4 related RFCs, all included in this PR: https://github.com/PowerShell/PowerShell-RFC/pull/187. That approach is designed to make opting into terminating errors actually terminating by default an explicit decision.",
      "created_at": "2019-06-13T21:46:44Z",
      "updated_at": "2019-06-13T21:46:44Z"
    }
  ],
  "created_at": "2019-05-13T20:09:55Z",
  "labels": [
    "Issue-Enhancement"
  ],
  "number": 9591,
  "state": "open",
  "title": "Set-StrictMode should cause errors to terminate execution.",
  "updated_at": "2019-06-13T21:46:45Z"
}