{
  "_url": "https://github.com/PowerShell/PowerShell/issues/9620",
  "author": "KirkMunro",
  "body": "I love the addition of the PoshChan bot and receiving email messages for PR tests that fail. That's tremendously valuable, thank you for adding that, I really appreciate it.\r\n\r\nThat said, I think you should reconsider PoshChan's interaction with conversations on the PR. The automated build process already shows its results in a PR, and while manually pulling the details of a failed build step is tedious/annoying, pulling those details out and adding them directly to the PR conversation is too noisy and takes value away from a PR conversation, especially when there are multiple builds (Windows, macos, linux) and when certain tests fail on each of those builds, resulting in the same information being posted three times.\r\n\r\nHow about updating PoshChan to gather the data for build step failures and posting a single message to the conversation that:\r\n1. Tags the PR author; and\r\n1. Includes a **link** to the specific issues (which would be stored elsewhere -- a randomly named text file in the cloud, or something similar) so that the PR author can review and correct the issues while still having useful, less noisy conversation in the PR itself.\r\n\r\nEither that or have PoshChan hide/remove old messages from a PR conversation when a new build starts so that only the latest are immediately visible, and on successful build hide/remove any previous messages.",
  "closed_at": "2019-05-31T22:00:40Z",
  "comments": [
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "/cc @SteveL-MSFT ",
      "created_at": "2019-05-16T17:39:56Z",
      "updated_at": "2019-05-16T17:39:56Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "@KirkMunro can you open an issue here? https://github.com/SteveL-MSFT/PoshChan-Bot\r\n\r\nLet me think about this a bit.  There isn't an API to hide comments, but there is one to delete them.",
      "created_at": "2019-05-18T02:50:07Z",
      "updated_at": "2019-05-18T02:50:07Z"
    },
    {
      "author": "msftbot[bot]",
      "author_association": "NONE",
      "body": "This issue has been marked as external and has not had any activity for **1 day**. It has been be closed for housekeeping purposes.",
      "created_at": "2019-05-31T22:00:17Z",
      "updated_at": "2019-05-31T22:00:17Z"
    }
  ],
  "created_at": "2019-05-16T13:29:32Z",
  "labels": [
    "Issue-Enhancement",
    "Resolution-External"
  ],
  "number": 9620,
  "state": "closed",
  "title": "PoshChan is great but PR conversations can become noisy really quickly",
  "updated_at": "2019-05-31T22:00:40Z"
}