{
  "_url": "https://github.com/PowerShell/PowerShell/issues/9742",
  "author": "JohnRusk",
  "body": "# Summary of the new feature/enhancement\r\n\r\nAs a user downloading from an aka.ms URL, I want the filename of my downloaded file to automatically match that of the source file. \r\n\r\nE.g. on Linux, if I do \r\n```\r\nwget https://aka.ms/downloadazcopy-v10-linux\r\n```\r\n\r\nIt just works. The output file is created, and it has the right name. E.g. when the aka.ms link points to a file name AzCopy_linux-amd64-10.0.9.tar.gz, that's the name I end up with on disk.  When someone updates the aka ms link to point to, say AzCopy_linux-amd64-10.2.0.tar.gz, then I can run the same command as before, and this time I automatically get the updated name.\r\n\r\nThis is useful for cases where the filename conveys useful information (such as the version).\r\n\r\nBut in PowerShell, I can't automatically use the file's existing name. I have to specify a name. But because the URL is a redirect, via aka.ms, I don't actually know the name of the download file in advance. So I can't specify a meaningful name (e.g. I can't include the version number). I still get the file, but I lose any information that was in its original name\r\n\r\n# Proposed technical implementation details (optional)\r\n\r\nAdd a new command line parameter, called something like `PreserveFilename'.  So the PowerShell equivalent of the Linux command above would be\r\n```\r\nInvoke-WebRequest https://aka.ms/downloadazcopy-v10-linux --PreserveFilename\r\n```",
  "closed_at": "2019-05-27T23:53:33Z",
  "comments": [
    {
      "author": "markekraus",
      "author_association": "CONTRIBUTOR",
      "body": "I've looked at this and decided that the Web Cmdlets would actually suffer in usability trying to add this. I can't find the issue, but this this is a duplicate of a closed issue. The web cmdlets are just not meant for downloading. They are meant for response body processing. \r\n\r\nInstead, some of the wget/curl functionality will be implimented in a new cmdlet where this exact scenario will be addressed. ",
      "created_at": "2019-05-27T23:52:59Z",
      "updated_at": "2019-05-27T23:52:59Z"
    },
    {
      "author": "markekraus",
      "author_association": "CONTRIBUTOR",
      "body": "Please comment on https://github.com/PowerShell/PowerShell-RFC/pull/124 instead.",
      "created_at": "2019-05-27T23:53:32Z",
      "updated_at": "2019-05-27T23:53:32Z"
    },
    {
      "author": "mklement0",
      "author_association": "CONTRIBUTOR",
      "body": "@JohnRusk, I think your suggestion makes perfect sense and has come up repeatedly; adding this functionality as an _experimental_ feature first has been green-lit: see https://github.com/PowerShell/PowerShell/issues/11671#issuecomment-578904101",
      "created_at": "2020-03-01T21:27:55Z",
      "updated_at": "2020-03-01T21:27:55Z"
    }
  ],
  "created_at": "2019-05-27T22:22:17Z",
  "labels": [
    "Issue-Enhancement",
    "Resolution-Answered"
  ],
  "number": 9742,
  "state": "closed",
  "title": "Invoke-WebRequest allow option to preserve orginal filename (even after redirect)",
  "updated_at": "2020-03-01T21:27:55Z"
}