{
  "_url": "https://github.com/PowerShell/PowerShell/issues/9838",
  "author": "Sarafian",
  "body": "# Summary of the new feature/enhancement\r\n\r\nCurrently, the only way to consume a SOAP API from PowerShell 6 or higher, is to render manually the XML envelopes and do a POST with `Invoke-RestMethod`. Before PowerShell 6, there was `New-WebServiceProxy` which managed to provide some of the WS* standards and worked quite well with most simple SOAP interfaces. When this was not enough, one could fall back to coding in  C# leveraging the `System.ServiceModel` assembly which unfortunately is not ported to .NET Core and therefore it is not an alternative in PowerShell 6 or higher.\r\n\r\nSOAP is not as dead as some people proclaim. Yes, it is not the current choice, but there are so many established API in SOAP, that makes it still alive. The one I've most recently encountered is the [Amadeus](https://developers.amadeus.com) which is used in the travel industry extensively and it doesn't seem to be going away soon. The travel industry, banking and insurance sector are known for keeping what works and for this reason the existing SOAP endpoints will not go away anytime soon. This makes PowerShell effectively a non-suitable scripting language and it shouldn't be.\r\n\r\nSOAP support was already there and needs to become available again for all platforms.\r\n\r\nUse cases I can think of are:\r\n- Use SOAP APIs from PowerShell on all platforms.\r\n  - Cheaper NX based VMs\r\n  - NX based containers support which are in general more lightweight than then windows server core counterparts.\r\n- Leverage a much-improved PowerShell 6 experience and performance when working with SOAP. SOAP tends to be generally heavy and I've already noticed how much faster the newer versions are compared to the previous ones\r\n- Integrate with SOAP using Azure Functions which currently supports only PowerShell 6. This would allow: \r\n  - A quick and dirty abstraction over REST\r\n  - Azure Logic apps would benefit as well\r\n  - Overall integration with other cognitive services and chatbots when SOAP is involved.\r\n- Windows Server Nano containers support.\r\n\r\n# Proposed technical implementation details\r\n\r\nI think that this is not a PowerShell issue alone and support from the .NET team is required to port some of the missing APIs and assemblies and support the otherwise known WCF on other platforms. \r\n\r\nNotice that on the [roadmap](https://devblogs.microsoft.com/dotnet/introducing-net-5/) announcement for .NET 5, many comments are about the missing support for WCF and there is quite a recognizable frustration.\r\n\r\n# Known repositories currently blocked from PowerShell 6\r\n\r\nI've added some repositories that I've been in involved with over the last years when working with SOAP interfaces.\r\n\r\n- [1ASOAP](https://github.com/Sarafian/1ASOAP/) provides a toolkit for working with Amadeus (aka 1A) endpoints. The repository has three internal modules that are probably going to be split into 3 different repos. The [SOAPProxy](https://github.com/Sarafian/1ASOAP/tree/master/Source/SOAPProxy) is the one that depends on `New-WebServiceProxy` to drive SOAP clients and this one blocks it from PowerShell 6. The remark is available [here](https://github.com/Sarafian/1ASOAP/tree/master/Source/SOAPProxy#powershell-core-not-supported) as well.\r\n- [WcfPS](https://github.com/Sarafian/WcfPS) was built around C# and the `System.ServiceModel` and `System.IdentityModel` assemblies. It generates in memory proxies but it can support even federated authentication (WSTrust 1.3) which is not available in PowerShell. The dependency on the `System.ServiceModel` effectively blocks it from PowerShell 6.\r\n- [ISHRemote](https://github.com/sdl/ISHRemote) is an automation toolkit for [a CMS over DITA by SDL known as Tridion Docs](https://sdl.github.io/). It is built around C# and the `System.ServiceModel` and `System.IdentityModel` assemblies to leverage support for SOAP over federate authentications using WSTrust 1.3. The dependency on these assemblies blocks it PowerShell 6 and non-Windows based operating systems.\r\n",
  "closed_at": null,
  "comments": [
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "I don't know when or if .NET will support this, so an alternate would be if there was an Open Source library that is .NET Core compatible that could be used.",
      "created_at": "2019-06-06T07:48:46Z",
      "updated_at": "2019-06-06T07:48:46Z"
    },
    {
      "author": "BrucePay",
      "author_association": "COLLABORATOR",
      "body": "WRT a delivery vehicle, given that this is not a core scenario (anymore), I think making it availables as a module on PSGallery makes more sense. The trickier bit is getting the underlying .NET classes that PowerShell requires ported to Core. It might be helpful to open an issue in the .NET Core repository requesting this functionality.",
      "created_at": "2019-06-06T12:17:27Z",
      "updated_at": "2019-06-06T12:17:27Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "> It might be helpful to open an issue in the .NET Core repository requesting this functionality.\r\n\r\n:-) And answer will \r\n>this is not a core scenario (anymore),\r\n\r\nAlthough they could make a standalone package with the API.",
      "created_at": "2019-06-06T13:41:45Z",
      "updated_at": "2019-06-06T13:41:45Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "Agree with @BrucePay, making it a standalone module makes sense regardless if we ship it with PowerShell package.  Long term plan has been to have less cmdlets/modules ship with PowerShell and have them independently maintained, updated, and published on PSGallery. ",
      "created_at": "2019-06-06T14:25:56Z",
      "updated_at": "2019-06-06T14:25:56Z"
    },
    {
      "author": "ChrisMagnuson",
      "author_association": "NONE",
      "body": "In light of the news about PowerShell 7 trying to unify the fork and get us back on one version of PowerShell I came looking to see if New-WebServiceProxy was going to be addressed and found this issue.\r\n\r\nI use New-WebService proxy to communicate with things like Adobe InDesign Server, Adobe Scene 7 Dynamic Media classic, ConnectShip Progistics (apis for shipping packages via Fedex, USPS, UPS, etc.), and in the past used this for managing Cisco Unified Communications Manager (and all the other on premise Cisco Collaboration tools).\r\n\r\nBeing able to quickly work with SOAP APIs is an important piece of the puzzule to enable System Administrators to automate a wide array systems they come in contact with using PowerShell.",
      "created_at": "2019-06-19T16:01:56Z",
      "updated_at": "2019-06-19T16:03:57Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "@ChrisMagnuson Thanks for your feedback! Based on MSFT team suggestion could you please clarify - do you ready to grab this in separate community project?",
      "created_at": "2019-06-20T05:12:57Z",
      "updated_at": "2019-06-20T05:12:57Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "Now that .NET Team has [announced](https://devblogs.microsoft.com/dotnet/supporting-the-community-with-wf-and-wcf-oss-projects/) a community project for WCF support, this may be viable.  Haven't looked to see how complete it is.  If there is interest by the community to talk this forward, I can create a public repo for you to use.",
      "created_at": "2019-06-20T14:47:12Z",
      "updated_at": "2019-06-20T14:48:21Z"
    },
    {
      "author": "ChrisMagnuson",
      "author_association": "NONE",
      "body": "In the article they mention “NET Core WCF Client“. \r\n\r\nGiven that in powershell we are acting as a soap client could that be used?\r\n\r\nGoogling for that name didn’t come back with something that matched that exactly, maybe this is what they are referring to: https://github.com/dotnet/wcf",
      "created_at": "2019-06-20T17:06:03Z",
      "updated_at": "2019-06-20T17:06:03Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "@ChrisMagnuson I believe the right repo is https://github.com/CoreWCF/CoreWCF",
      "created_at": "2019-06-20T21:01:22Z",
      "updated_at": "2019-06-20T21:01:22Z"
    },
    {
      "author": "Sarafian",
      "author_association": "NONE",
      "body": "@ChrisMagnuson and @SteveL-MSFT, I've done some more digging into this topic from the perspective of a couple of repositories I've in mind and mentioned on my original post.\r\n\r\nThe [CoreWCF](https://github.com/CoreWCF/CoreWCF) repo allows a soap client to function based on two requirements and their respected issues.\r\n- The interface and the data contracts are defined in code. This means a binary module. But, PowerShell as a scripting language, needs to ability to consume a SOAP endpoint dynamically like `New-WebServiceProxy` does.\r\n- Not all bindings are available, so complicated soap flows will not be supported. This limits the possibilities but I consider this a low impact issue. Most architect knew about the short commings of SOAP due to its complexity and have steered away from the most advanced bindings.\r\n\r\nIn the past, I've had already implemented an equivalent of the `New-WebServiceProxy` that could produce a more raw proxy but with much more support on the advanced bindings. I did this because I needed dynamic proxies that supported ws-trust authentication. This is [WCFPS](https://github.com/Sarafian/WcfPS) binary module and in short follows the following flow. \r\n\r\n1. Create a wsdl importer\r\n2. Extract the endpoint's interface and data contracts\r\n3. Create a service endpoint based on a matching binding\r\n4. Combine the interface and the service endpoint, to form a channel. The channel is the raw proxy. If you could wrap some code around it, then you could manage headers and add properties to mimic `New-WebServiceProxy`. Here is the example code.\r\n\r\n```powershell\r\n$wsImporter=New-WcfWsdlImporter -Endpoint $svcEndpoint -HttpGet\r\n$proxyType=$wsImporter | New-WcfProxyType\r\n$endpoint=$wsImporter | New-WcfServiceEndpoint -Endpoint $svcEndpoint\r\n$channel=New-WcfChannel -Endpoint $endpoint -ProxyType $proxyType\r\n```\r\n\r\nThis is full WCF and hence it supports the most complicated bindings as they are described in the wsdl endpoint. Problem is that the necessary .net types are not implemented in the [CoreWCF](https://github.com/CoreWCF/CoreWCF) and I'm not sure if they are going to. \r\n\r\nSo, I considered a different approach. I've considered packaging `dotnet-svcutil` tool or its code into a module that behind the scenes would generate the code, compile it into memory and wrap it around an object. The problem is that I can't find the code for `dotnet-svcutil` and when I looked deeper I run into an answer stating \"that this is not open source yet. \". I've also not been able to find the code for the `New-WebServiceProxy` to try and .NET standar-ize it and offer it a binary module.\r\n\r\nI wonder is someone has some more insight about the source of `dotnet-svcutil` and `New-WebServiceProxy`\r\n\r\n",
      "created_at": "2019-06-21T07:46:32Z",
      "updated_at": "2019-06-21T07:58:21Z"
    },
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "@Sarafian See https://github.com/PowerShell/PowerShell/blob/bd6fdae73520931f0d27a29d6290e18761772141/src/Microsoft.PowerShell.Commands.Management/commands/management/WebServiceProxy.cs#L38",
      "created_at": "2019-06-21T08:49:11Z",
      "updated_at": "2019-06-21T08:49:11Z"
    },
    {
      "author": "Sarafian",
      "author_association": "NONE",
      "body": "> @Sarafian See\r\n> \r\n> https://github.com/PowerShell/PowerShell/blob/bd6fdae73520931f0d27a29d6290e18761772141/src/Microsoft.PowerShell.Commands.Management/commands/management/WebServiceProxy.cs#L38\r\n\r\nThanks @iSazonov . The workhorse in the `New-WebServiceProxy` is the [DiscoveryClientProtocol](https://docs.microsoft.com/en-us/dotnet/api/system.web.services.discovery.discoveryclientprotocol?view=netframework-4.8) offered by the `System.Web.Services.dll` as already mentioned. The DiscoveryClientProtocol has some dependencies to other types from the same assembly and from a sampling I did, none of them are available in the upcoming `netcore-3.0` (currently preview 6).\r\n\r\n`System.Web.Services.dll` is the driver for ASMX web services and I'm not sure that any solution should be based on this codebase. This is the reason that `New-WebServiceProxy` is limited and supports very basic soap configurations. \r\n\r\nHas anyone ever tried to convert its [code](https://github.com/microsoft/referencesource/tree/master/System.Web.Services) to .NET standard?\r\n\r\nI'm more and more convinced that this is .NET team issue and maybe the PowerShell team can put an extra word :smile: .  I hope the new WCF in .net core 3, shares similarities in terms of features with `New-WebServiceProxy`. If they offer some the constructs to configure a Web Service, then hopefully they offer the drivers to generate in memory proxies like e.g. `DiscoveryClientProtocol`. In WCF this was [WsdlImporter ](https://docs.microsoft.com/en-us/dotnet/api/system.servicemodel.description.wsdlimporter?view=netframework-4.8) and still unavailable for .net core 3 (preview 6)",
      "created_at": "2019-06-24T07:09:06Z",
      "updated_at": "2019-06-24T07:09:06Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "@Sarafian Unfortunately, I don't see .NET team treating this as a priority at all which is why they invested in the CoreWCF project (even if incomplete).  They are investing in REST and gRPC.  We're doing some work in PS7 to make it more seamless using Windows PowerShell modules, so perhaps we can make it easier to call Windows PowerShell's `New-WebServiceProxy` from PS7.",
      "created_at": "2019-07-05T21:03:23Z",
      "updated_at": "2019-07-05T21:03:23Z"
    },
    {
      "author": "Sarafian",
      "author_association": "NONE",
      "body": "> @Sarafian Unfortunately, I don't see .NET team treating this as a priority at all which is why they invested in the CoreWCF project (even if incomplete). They are investing in REST and gRPC.\r\n\r\n@SteveL-MSFT thanks for reaching out and clarifying. It is expected what you said.\r\n\r\n> We're doing some work in PS7 to make it more seamless using Windows PowerShell modules, so perhaps we can make it easier to call Windows PowerShell's `New-WebServiceProxy` from PS7.\r\n\r\nThat would solve homogenity within the powershell experience, because the current way of executing windows specific modules with implicit remoting is really not good. Anyhow, this will not solve azure function with powershell, unless the functions teams decides to \"strengthen\" the powershell support. ",
      "created_at": "2019-07-06T13:11:46Z",
      "updated_at": "2019-07-06T13:11:46Z"
    },
    {
      "author": "SteveL-MSFT",
      "author_association": "MEMBER",
      "body": "Azure Functions can run on a Windows sandbox which contains Windows PowerShell.  Even today, you could from PSCore6 call out to powershell.exe to run whatever Windows PowerShell pipeline you need.",
      "created_at": "2019-07-07T05:05:51Z",
      "updated_at": "2019-07-07T05:05:51Z"
    },
    {
      "author": "Sarafian",
      "author_association": "NONE",
      "body": "> Azure Functions can run on a Windows sandbox which contains Windows PowerShell. Even today, you could from PSCore6 call out to powershell.exe to run whatever Windows PowerShell pipeline you need.\r\n\r\nHmmm didn't know that. This is in general good news. Potential problem is that with every `powershell.exe ....` from the Core session, the soap proxy would need to intiatiated. I'm not sure how it would be with the core session, if the process is kept alive. So with much tentativeness, my comment.\r\n\r\nThanks @SteveL-MSFT .",
      "created_at": "2019-07-07T14:08:41Z",
      "updated_at": "2019-07-08T06:31:41Z"
    },
    {
      "author": "mikeTWC1984",
      "author_association": "CONTRIBUTOR",
      "body": "I was looking for a way to mirror New-WebServiceProxy on linux powershell (to consume SharePoint soap services), and dotnet-svcutil seem to be a good option. It's not generating client automagically like windows powershell, but actually doing this manually might be even better approach in many cases (you just generate client code once and then reuse it).   Below are some notes to get started (if not familiar with this tool)\r\n\r\nTo generate cs file with client definition, install dotnet sdk 2 (it's not compatibale with v3 yet, but you can have both), then install the tool itself (dotnet tool install --global dotnet-svcutil) and create some dummy  app (dotnet new console)\r\nThen download all wsdl files you need and run: dotnet-svcutil *.wsdl -sync \r\nIf no error, build the project (dotnet build) and import project dll (Add-Type -path  ./bin/Debug/netcoreapp3.0/dummy.dll)\r\nYou can also load the type from cs file directly:\r\n```\r\nAdd-Type -TypeDefinition (get-content -raw ./ServiceReference/Reference.cs) -ReferencedAssemblies  netstandard, \r\n System.ServiceModel,\r\n System.ServiceModel.Primitives,\r\n System.Private.ServiceModel,\r\n System.Runtime.Serialization.Xml,\r\n System.Xml, System.Diagnostics.Tools,\r\n System.Xml.ReaderWriter,\r\n System.Diagnostics.Debug,\r\n System.Runtime.Serialization.Primitives \r\n# might need some extra libs to refer\r\n```\r\nOnce type is loaded you should instantiate Client  object. Type name likely will be \"ServiceName\" + \"SoapClient\", or something containing Client word. In case of SharePoint lists service:\r\n```\r\n$defaultConfig = [ServiceReference.ListsSoapClient+EndpointConfiguration]::ListsSoap\r\n$client = [ServiceReference.ListsSoapClient]::new($defaultConfig)\r\n```\r\nIf there is no auth or you are on windows network with NTLM you are likely all set. Otherwise try to configure auth using $client.ClientCredentials property, or you can also use other constructor for the client:\r\n```\r\n$result = [System.ServiceModel.BasicHttpBinding]::new()\r\n$result.Security.Transport.ClientCredentialType = [System.ServiceModel.HttpClientCredentialType]::Ntlm; # choose the one you need\r\n$endPoint = [System.ServiceModel.EndpointAddress]::new(\"https://sharepoint.site/_vti_bin/Lists.asmx\")\r\n$client = [ServiceReference.ListsSoapClient]::new($result, $endPoint)\r\n```\r\nYou can also use this constructor to consume same service from different endpoint.\r\n\r\n",
      "created_at": "2020-01-20T04:42:47Z",
      "updated_at": "2020-01-20T04:47:13Z"
    },
    {
      "author": "Sarafian",
      "author_association": "NONE",
      "body": "@mikeTWC1984 have considered wrapping everything in and generating proxies dynamically like it is done in the [WcfPS](https://github.com/Sarafian/WcfPS/tree/master/Modules/WcfPS) module? It uses .net classes that normally the wsdl importers use to generate the service references but instead of saving in file it compiles in memory.",
      "created_at": "2020-01-20T15:12:19Z",
      "updated_at": "2020-01-20T15:12:19Z"
    },
    {
      "author": "mikeTWC1984",
      "author_association": "CONTRIBUTOR",
      "body": "@Sarafian  is WcfPS compatible with powershell core, at least with Windows version? ",
      "created_at": "2020-01-20T17:29:59Z",
      "updated_at": "2020-01-20T17:29:59Z"
    },
    {
      "author": "Sarafian",
      "author_association": "NONE",
      "body": "> @Sarafian is WcfPS compatible with powershell core, at least with Windows version?\r\nI am not sure. You will probably need to change some namespaces. Keep in mind that the advanced stuff related to token are definitely not available. \r\n",
      "created_at": "2020-01-21T07:12:56Z",
      "updated_at": "2020-01-21T07:12:56Z"
    },
    {
      "author": "vazome",
      "author_association": "NONE",
      "body": "Please add this",
      "created_at": "2020-11-17T10:54:10Z",
      "updated_at": "2020-11-17T10:54:10Z"
    }
  ],
  "created_at": "2019-06-06T06:58:41Z",
  "number": 9838,
  "state": "open",
  "title": "SOAP support in all platforms",
  "updated_at": "2020-11-17T10:54:10Z"
}