{
  "_url": "https://github.com/PowerShell/PowerShell/issues/9851",
  "author": "kilasuit",
  "body": "In this menu\r\n\r\n![image](https://user-images.githubusercontent.com/6355225/59104025-4fadd400-8928-11e9-880b-a6bc90acd45b.png)\r\n\r\nIt would be helpful to also include any PowerShell Core Versions installed on the system as well as this will help aid adoption and eases scenarios where users are still switching between versions (like I am)",
  "closed_at": "2022-09-22T22:46:56Z",
  "comments": [
    {
      "author": "iSazonov",
      "author_association": "COLLABORATOR",
      "body": "Looks like one item for both versions.\r\n/cc @bergmeister Is it possible to implement?\r\n\r\n/cc @SteveL-MSFT Make sense to implement in PowerShell Core? It seems it should be in Windows distributive itself.",
      "created_at": "2019-06-07T18:34:20Z",
      "updated_at": "2019-06-07T18:34:20Z"
    },
    {
      "author": "bergmeister",
      "author_association": "CONTRIBUTOR",
      "body": "For PowerShell Core, I have added the 'Run as Administrator' option. The feature in general is referred to as a jumpstart menu.\r\nThe implementation of it calls a very delicate and complex sequence of Windows COM APIs (in Windows PowerShell it is C++ code that can still be seen in the MainEntry.cpp file of the source-depot branch, in PowerShell Core it is managed C# code).\r\nIt works roughly like this: When PowerShell is starting up and the console host is detected to be interactive then it registers this jump start menu with Windows (if it is not already registered). As an aside: You can actually see this by pinning an icon of PowerShell (either Windows PowerShell or PSCore) to the taskbar in a fresh new VM and right-clicking on it and you will observe the jump start menu is not there, only after you have opened PowerShell the very first time, the jump start menu will appear from then on.\r\n\r\nWithout digging deep into the details of the Windows API calls, I cannot say with certainty whether it would be possible to register a startmenu for the Windows PowerShell binary from PowerShell Core (because I am sure the PowerShell team would be against changing code in Windows PowerShell), therefore one would need to research or PoC this.\r\nIf it is possible then there is the complication that if a jump start menu is registered and PowerShell Core is uninstalled (or re-installed using a different path), then the installer would need to clear it.\r\n\r\nIn the next months, I would like to re-review the complex implementation because at the time neither WPF nor the Windows API code pack had appropriate methods to make the required calls to the Windows API. I'd like to see how much of WPF is already open sourced in the upcoming .Net Core 3 Preview 6 or 7 and possibly make a PR there (once they are ready) so that the API can be simplified (I expect to simplify 600 lines of code to something like 10). After that it would be much simpler looking at this problem again without the need to dig very deep and write lots of code.",
      "created_at": "2019-06-07T20:06:33Z",
      "updated_at": "2019-06-07T20:14:56Z"
    },
    {
      "author": "MovGP0",
      "author_association": "NONE",
      "body": "I guess this feature should be in Windows Terminal, rather than in PowerShell itself. ",
      "created_at": "2019-06-08T20:27:56Z",
      "updated_at": "2019-06-08T20:27:56Z"
    },
    {
      "author": "rkeithhill",
      "author_association": "COLLABORATOR",
      "body": "I'm a little uncomfortable with the jumplist of one app launching other versions of the app.  I realize that the Windows PowerShell jumplist does this by adding ISE but at least the two are related \"version-wise\".   FWIW I have machines with ~6 versions of Visual Studio installed and none of their taskbar jumplists offer to launch a different version of VS.\r\n\r\n@MovGP0 Windows Terminal already offers both Windows PowerShell and PowerShell Core (if it detects it is installed on the machine). You can also customize (add/remove/reorder) this list as I've done here:\r\n\r\n![image](https://user-images.githubusercontent.com/5177512/59152189-8c4aff80-89fc-11e9-8041-68ee1e71ed81.png)\r\n",
      "created_at": "2019-06-08T20:50:21Z",
      "updated_at": "2019-06-08T20:50:21Z"
    },
    {
      "author": "kilasuit",
      "author_association": "COLLABORATOR",
      "body": "Closing as per comment from @rkeithhill above ",
      "created_at": "2022-09-22T22:46:56Z",
      "updated_at": "2022-09-22T22:46:56Z"
    }
  ],
  "created_at": "2019-06-07T12:31:27Z",
  "number": 9851,
  "state": "closed",
  "title": "Extend the Task bar menu for Windows PowerShell to also include any other PowerShell Versions ",
  "updated_at": "2022-09-22T22:47:16Z"
}