{
  "_url": "https://github.com/PowerShell/PowerShell/issues/9891",
  "author": "KirkMunro",
  "body": "Currently there are several different uses of `-Scope` as a parameter in core PowerShell modules:\r\n\r\n- As a string to identify a PowerShell invocation scope (e.g. when using cmdlets that work with aliases, variables, PSDrives, and modules)\r\n- As a string to identify the profile to work with (e.g. when working with Package Management commands, you can specify CurrentUser or AllUsers, and now when working with experimental features)\r\n- As an ExecutionPolicyScope enumeration to identify the execution policy scope (e.g. when working with the `*-ExecutionPolicy` cmdlets)\r\n\r\nPersonally I've found it confusing when I see that parameter name, assume it means one thing, and then find out in the documentation it means something else. Before this confusion continues, especially within core PowerShell modules, perhaps it would be better if at least some of these used a more explicit parameter name, with `-Scope` as an alias for backward compatibility.\r\n\r\nFor example, in package management and experimental features, `-UserScope` would be more appropriate than simply using `-Scope`. For `*-ExecutionPolicy` cmdlets, `-PolicyScope` would be more appropriate and accurate than simply using `-Scope`.\r\n\r\nThoughts?",
  "closed_at": "2019-06-20T02:16:48Z",
  "comments": [
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "Given these are parameters, we can change the parameter name and assign the alias `Scope` to each of these both as a shorthand and for backwards compatibility. I see no reason not to clarify the meaning of these parameters, it's something that's bothered me for quite a while. ",
      "created_at": "2019-06-13T19:18:42Z",
      "updated_at": "2019-06-13T19:18:42Z"
    },
    {
      "author": "bpayette",
      "author_association": "CONTRIBUTOR",
      "body": "@KirkMunro \r\n\r\n>  -UserScope would be more appropriate than simply using -Scope. \r\n\r\nInteresting. Personally I find `-Scope user` much more readable than `-UserScope`. Also, as a parameter argument, you can easily pass it as a value without having to splat.\r\n\r\n@vexx32 \r\n\r\n> we can change the parameter name and assign the alias Scope to\r\n\r\nYou can't use aliases like that. You can't alias `-UserScope` to `-Scope User`.\r\n\r\n> see no reason not to clarify the meaning of these parameters, \r\n\r\nThat's what documentation is for. Is there a problem with the current docs? If so, please open a docs bug. Thanks.",
      "created_at": "2019-06-14T00:33:12Z",
      "updated_at": "2019-06-14T00:33:12Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "Hmm. It's not clear, but I read it as saying \"we should use `-UserScope` as a direct replacement for `-Scope` for that cmdlet; for example `-UserScope User` or `-UserScope System` (or whatever that one is, I gotta say I don't install a whole lot system wide).\r\n\r\nThe name might want to be changed if that is the case, though... maybe `-ModuleScope` or something.",
      "created_at": "2019-06-14T00:38:24Z",
      "updated_at": "2019-06-14T00:39:33Z"
    },
    {
      "author": "KirkMunro",
      "author_association": "CONTRIBUTOR",
      "body": "@bpayette That's not what I meant.\r\n\r\nMy issue is that there are three distinct parameter types for `-Scope` parameters among modules that ship with PowerShell, and when I see `-Scope` I may need to go to the docs to see what it's for when it would be better if I didn't have to.\r\n\r\nIf the `*-ExecutionPolicy` cmdlets instead had a `-PolicyScope` parameter (with an alias of `Scope` for backward compatibility), and if the PowerShellGet/PackageManagement cmdlets and the `*-ExperimentalFeature` cmdlets instead had a `-UserScope` parameter (with an alias of `Scope` for backward compatibility), then the parameters would be more self-explanatory.\r\n\r\nDoes that make more sense? Maybe the part that confused you was the `-UserScope` parameter name proposal. I suppose it could be called `-ProfileScope` instead, but having it just called `-Scope` by default with values of `CurrentUser` and `AllUsers` when other cmdlets in PowerShell have `-Scope` parameters that take values such as `Global`, `Local`, `Script`, or a numeric value, that difference in definition of scope (the difference between commands, not within one command) is a confusion point that could be eliminated.\r\n\r\nCase in point: when I was looking at `*-ExperimentalFeature` cmdlets and I saw `-Scope`, I initially presumed that it was referring to a PowerShell invocation scope where you could enable the feature, and didn't realize it was about enabling those features for the current user or for all users on the local system instead.",
      "created_at": "2019-06-14T02:21:29Z",
      "updated_at": "2019-06-14T14:21:15Z"
    },
    {
      "author": "BrucePay",
      "author_association": "COLLABORATOR",
      "body": "Historical reasoning:\r\n```powershell\r\nSet-ExecutionPolicy -scope ...\r\n```\r\nScope in this case is clearly qualified by the noun so `-PolicyScope` is redundant\r\n\r\n```powersell\r\nSet-Variable -Scope ...\r\n```\r\nAgain, `-Scope` is clearly qualified by the noun making `-VariableScope` redundant.\r\n\r\nAnd then it all goes off the rails with `Install-Module`:\r\n```powershell\r\nInstall-Module -Scope ...\r\nImport-Module -Scope ...\r\n```\r\nThis is extremely unfortunate because here the qualifying noun doesn't provide sufficient context. Maybe something like\r\n```powershell\r\nInstall-Module -Repository ...\r\n```\r\nwould be more semantically significant.\r\n\r\n> take values such as Global, Local, Script, or a numeric value is a confusion point that could be eliminated.\r\n\r\nFor `Import-Module -Scope ...` , `Get-Variable -Scope ...` and `$global:foo = ...` , in all cases, the word \"scope\" is referring to exactly the same thing: the activation stack of the currently running script.  The use of numeric values allows more specific non-local references than \"script\" or \"global\".\r\n\r\n> with `*-ExperimentalFeature `... thought it was referring to a PowerShell invocation scope where you could enable the feature, and didn't realize it was about enabling those features for the current user or for all users on the local system instead\r\n\r\nI totally get that. This should probably just be fixed. Maybe `-EnableFor` ? Or just `-For` ? `Install-Module -For CurrentUser` would work too as would `Set-ExecutionPolicy -For process`.",
      "created_at": "2019-06-14T04:59:16Z",
      "updated_at": "2019-06-14T04:59:16Z"
    },
    {
      "author": "KirkMunro",
      "author_association": "CONTRIBUTOR",
      "body": "I ❤️ the `-For` parameter name suggestion. That's very expressive! I've updated an RFC I have open proposing optional features to use that parameter name because it makes the commands self-documenting.\r\n\r\nI also like that parameter name for `*-ExecutionPolicy`, `*-ExperimentalFeature`, and the PowerShellGet/PackageManagement commands. Thanks for that suggestion @BrucePay!\r\n\r\nAside: You have two GitHub accounts that you seem to use on posts interchangeably. Is there one you would prefer we use when we @-mention you?",
      "created_at": "2019-06-14T14:38:07Z",
      "updated_at": "2019-06-14T14:39:47Z"
    },
    {
      "author": "KirkMunro",
      "author_association": "CONTRIBUTOR",
      "body": "@SteveL-MSFT: This should be a fairly quick decision to make for or against this in the Committee. Could you table this at a meeting? If the Committee buys in, I'll submit the PRs.\r\n\r\nThe tl;dr of this is:\r\n\r\nPowerShell uses \"scope\" to refer to the activation stack of the currently running script. Because of that, a `-Scope` parameter name on `Import-Module`, `Get-Variable`, etc. makes sense. There are other uses of `-Scope` as a parameter name that cause confusion: `Enable-ExperimentalFeature` and `Disable-ExperimentalFeature`, for example, as well as commands in PowerShellGet/PackageManagement and the `Get-/Set-ExecutionPolicy` cmdlets. I think we should consider changing the name of `-Scope` in those commands to something more appropriate, with `-Scope` as an alias for backwards compatibility. @BrucePay's suggestion of `-For` is a really good alternative parameter name that makes commands self-documenting in all of those cases.",
      "created_at": "2019-06-14T14:46:27Z",
      "updated_at": "2019-06-14T14:46:38Z"
    },
    {
      "author": "rkeithhill",
      "author_association": "COLLABORATOR",
      "body": "I'm not a fan of the `-For` idea because I use  `-For` interactively for `-Force`.   Also, while this is \"fluent\" in nature, a preposition doesn't quite fit the PowerShell idiom for parameter names IMO.  I'm certainly up for changing the parameter name on `Enable/Disable-ExperimentalFeature`.",
      "created_at": "2019-06-14T15:06:13Z",
      "updated_at": "2019-06-14T15:17:45Z"
    },
    {
      "author": "KirkMunro",
      "author_association": "CONTRIBUTOR",
      "body": "@rkeithhill Prepositions are already in use as parameter names in PowerShell commands. Some common examples that come to mind are the `-From` and `-To` parameters in `Send-MailMessage`, or the `-Before` and `-After` parameters in `Get-Job`.",
      "created_at": "2019-06-14T15:29:23Z",
      "updated_at": "2019-06-14T15:29:32Z"
    },
    {
      "author": "rkeithhill",
      "author_association": "COLLABORATOR",
      "body": "Fair enough.  I guess down the road I'd still like to still be able to recognize the language/commands.  I'm all for high value additions and strategic changes but changing things that have existed for a decade or more to make it \"slightly better\" ... yeah, I'm not a fan of that.  ",
      "created_at": "2019-06-14T15:37:12Z",
      "updated_at": "2019-06-14T15:37:52Z"
    },
    {
      "author": "KirkMunro",
      "author_association": "CONTRIBUTOR",
      "body": "Not all of these commands have been there for a decade or more, and among those discussed here, the commands that are a dozen years old are not the ones where changes are being proposed here, aside from `Get-/Set-ExecutionPolicy` which are usually just fire-and-forget commands.\r\n\r\nI look at issues like this as something that wasn't readily apparent early on, but that later became more of a problem due to additions to the language, at which time it makes sense to at least question the current direction, and perhaps change it based on the current landscape of features/commands.",
      "created_at": "2019-06-14T16:48:39Z",
      "updated_at": "2019-06-14T16:48:39Z"
    },
    {
      "author": "KirkMunro",
      "author_association": "CONTRIBUTOR",
      "body": "Plus, to speak to the \"slightly better\" comment and give some background behind where this discussion started, I have an RFC open for commands for use with optional features. In an earlier version of the draft, I was looking at using a `-Scope` parameter, but in those cmdlets that's very confusing because they have two notions of scope: the users for whom they are enabled/disabled or by default (e.g. `CurrentUser` or `AllUsers`) _and/or_ the activation stack in which they are enabled or disabled. It's during the authoring of that RFC that I ran into this parameter name challenge, and to maintain discoverability and consistency started to question the `-Scope` name more broadly.\r\n\r\nThis is not just a trivial I-have-nothing-better-to-do-with-my-time-so-let's-go-fix-something-that-isn't-important-to-make-something-slightly-better scenario.",
      "created_at": "2019-06-14T16:55:00Z",
      "updated_at": "2019-06-14T16:55:58Z"
    },
    {
      "author": "rkeithhill",
      "author_association": "COLLABORATOR",
      "body": "> I have an RFC open for commands for use with optional features.\r\n\r\nAnd it's a great conversation to have for new commands.  I'm just not so keen on the \"let's also change well-established commands for consistency\" aspect of this.  BTW I don't consider the `ExperimentalFeature` commands to be well-established - so they're fair game for changes.",
      "created_at": "2019-06-14T17:00:29Z",
      "updated_at": "2019-06-14T17:04:54Z"
    },
    {
      "author": "kilasuit",
      "author_association": "COLLABORATOR",
      "body": "Scope as a parameter to me makes sense & changing this in all the areas seems to not provide all that much benefit whilst adding more unnecessary confusion, especially as now you are moving into the realms of parameter naming guidance, whereas good Parameter Help should be where people go to learn and understand what the parameter means more than it's simple name, along with good examples.\r\n\r\nAlso Scope is used heavily in Az Commands for a manner of different contextual usecases.\r\n\r\nI'm siding with @rkeithhill on this as to me doesn't seem to add value to either new or existing scripters and would in fact likely cause more confusion than anything else.",
      "created_at": "2019-06-19T16:52:48Z",
      "updated_at": "2019-06-19T16:52:48Z"
    },
    {
      "author": "joeyaiello",
      "author_association": "CONTRIBUTOR",
      "body": "@PowerShell/powershell-committee reviewed this (@BrucePay included) and we don't feel anything we do here is going to add much value:\r\n\r\n* Adding a descriptor to `-Scope` is going to be repetitive with the noun (e.g. `-ModuleScope` or `-InstallationScope` for `Install-Module` doesn't seem helpful)\r\n* Where disambiguation is needed between two scope concepts, it's perfectly fine to use a prefix for that disambiguation\r\n* `-For` is a \"fluent\" parameter that might read better, but it's not a pattern we've used often in PowerShell parameters, and it's not any less ambiguous than `-Scope`\r\n* Tab completion works fine for all the `-Scope` values across the cmdlets\r\n* There was 50/50 agreement in the room between whether using `-For` for `-Force` was a valid concern. I personally use `-fo` interactively every day, and this would drive me crazy (especially on `Install-Module`). ",
      "created_at": "2019-06-19T22:31:45Z",
      "updated_at": "2019-06-19T22:31:45Z"
    }
  ],
  "created_at": "2019-06-13T19:13:04Z",
  "number": 9891,
  "state": "closed",
  "title": "Too many different -Scope parameters",
  "updated_at": "2019-06-28T12:58:19Z"
}