{
  "_url": "https://github.com/PowerShell/PowerShell/issues/9995",
  "author": "tloveland1",
  "body": "I have a script that collects a lot of data from remote machines in different time zones.  I serialize all of the data using `Export-CliXml`, and then deserialize the data using `Import-CliXml` to parse it into a SQL database.\r\n\r\nI'd like to be able to convert the DateTime objects I collect into DateTimeOffset objects, in order to store the DateTime in the machine's local time.  Unfortunately, it looks like the offset information is lost during the deserialization.  I know I could get the content of the CliXml file and convert the string to a DateTimeOffset, but I'm wondering if there's any way to preserve the information when using `Import-CliXml`.  I know I could also use `Get-TimeZone` to get the offset information, but I'm wondering if there's a way I can do this without collecting it.\r\n\r\nThank you!\r\n\r\nExample: **Converting string from CliXml file to DateTimeOffset**\r\n\r\n![image](https://user-images.githubusercontent.com/51245144/60029540-fe5f4d80-9666-11e9-9aae-638108af6bd3.png)\r\n\r\nExample: **Importing CliXml and converting to DateTimeOffset does not preserve TimeZone offset**\r\n\r\n![image](https://user-images.githubusercontent.com/51245144/60029625-2058d000-9667-11e9-9815-83708fa4f74b.png)\r\n",
  "closed_at": "2019-06-27T14:38:04Z",
  "comments": [
    {
      "author": "sramesh621",
      "author_association": "NONE",
      "body": "Can you please explain this issue a little more clearly???\r\n\r\n\r\nIn the original XML file, the date is stored in UTC time, so the time is displayed as 13:13 with an offset of 0.\r\n\r\n\r\nAfter the import, the date is stored in Central Time with an offset of -5 hrs.  That's why it is showing up as 8:13.",
      "created_at": "2019-06-24T20:45:16Z",
      "updated_at": "2019-06-24T20:45:16Z"
    },
    {
      "author": "tloveland1",
      "author_association": "NONE",
      "body": "I want to preserve the offset of the DateTime as it's stored in the XML file, so I can convert the DateTime back to the local time it was created.\r\n\r\nThe offset is stored in the XML file, and I can grab the string out of the XML file's contents and convert it to a DateTimeOffset to get that local time with the correct offset.  When I use `Import-CliXml` though, the offset is lost during the deserialization back to DateTime, and gets automatically converted to my machine's local time.  \r\n\r\nI sort of expected the answer to be \"get the timezone offset and calculate the local time\", but I was hoping there might be some way to preserve the offset during deserialization without needing to collect it.\r\n\r\n",
      "created_at": "2019-06-24T20:52:11Z",
      "updated_at": "2019-06-24T20:52:11Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "Not within DateTime's type structure, no. It's not designed for it. Had it been originally stored as DateTimeOffset, I think this might be possible, however. 🤔 ",
      "created_at": "2019-06-24T20:54:34Z",
      "updated_at": "2019-06-24T20:54:34Z"
    },
    {
      "author": "tloveland1",
      "author_association": "NONE",
      "body": "Here's a different example using Alaska time (-8):\r\n\r\n**Manual conversion of the string:**\r\n![image](https://user-images.githubusercontent.com/51245144/60051320-58c4d200-9698-11e9-8b1d-a9637e9261be.png)\r\n\r\n**Importing the CliXml**\r\n\r\n![image](https://user-images.githubusercontent.com/51245144/60051389-814ccc00-9698-11e9-8b5e-ae04189063e8.png)\r\n\r\nI'm probably just going to end up collecting it as a DateTimeOffset.  I was just hoping I didn't have to :)",
      "created_at": "2019-06-24T20:56:01Z",
      "updated_at": "2019-06-24T20:56:01Z"
    },
    {
      "author": "vexx32",
      "author_association": "COLLABORATOR",
      "body": "Yes, if you initially convert to `[datetimeoffset]` and serialize that you will retain the information.\r\n\r\n@tloveland1 was serializing `[datetime]` and attempting to rehydrate it as `[datetimeoffset]` in order to maintain the offset information as it isn't really possibly to instantiate `[datetime]` with a specified offset.",
      "created_at": "2019-06-26T16:18:34Z",
      "updated_at": "2019-06-26T16:19:01Z"
    }
  ],
  "created_at": "2019-06-24T15:04:23Z",
  "number": 9995,
  "state": "closed",
  "title": "How to get DateTimeOffset from DateTime object when importing a CliXml file",
  "updated_at": "2019-06-27T14:38:04Z"
}